{
    "authors": [
        "Katya Slepian"
    ],
    "content": "‘Jeopardy!’ host Alex Trebek has died at the age of 80 after a long battle with pancreatic cancer.\n\nTrebek had been fighting Stage 4 pancreatic cancer at the time of his death. He first announced his diagnosis on March 6, 2019.\n\nAccording to Jeopardy!, which the Canadian-born Trebek had hosted since 1984, the host died peacefully at his home on Sunday morning (Nov. 8), surrounded by family and friends.\n\nTrebek had announced earlier this year that if his current treatment didn’t work to cure his cancer, he would not try again.\n\nIn his memoir, “The Answer Is…Reflections on My Life,” the Sudbury, Ont.-raised TV personality had written that “quality of life was an important consideration” in the decision.\n\nThe seven-time Emmy Award winner said he and his wife, Jean Currivan, and their two children had “a good cry” when he told them.\n\nTrebek added he’d “lived a good, full life,” knew he was nearing the end of it, and was “not afraid of dying.”\n\nREAD MORE: Alex Trebek says if current cancer treatment doesn’t work, it might be his last\n\nVIDEO: Courtenay stroke survivor using Jeopardy! to relearn reading ability\n\nJeopardy! is saddened to share that Alex Trebek passed away peacefully at home early this morning, surrounded by family and friends. Thank you, Alex. pic.twitter.com/Yk2a90CHIM — Jeopardy! (@Jeopardy) November 8, 2020\n\nCondolences poured out across Twitter shortly after the news of Trebek’s death broke from ‘Jeopardy!’ contestants, friends and fans alike.\n\nAlex Trebek was in our homes for decades and as such, became our family, and he knew we welcomed him into our homes daily and it meant the world to him. Today, celebrate him and keep his family and those that he touched so deeply in your thoughts. North America lost a great man. — Austin Tyler Rogers (@austintylerro) November 8, 2020\n\nI was obsessed with Jeopardy as a nerdy kid growing up in Ohio. I’ve loved and revered Alex Trebek since I can remember. What an iconic career. RIP Alex Trebek. — John Legend (@johnlegend) November 8, 2020\n\nAlex Trebek was kind enough to film a cameo for our film Free Guy last year despite his battle. He was gracious and funny. In addition to being curious, stalwart, generous, reassuring and of course, Canadian. We love you, Alex. And always will. — Ryan Reynolds (@VancityReynolds) November 8, 2020\n\nAlex's impact is immeasurable. Thank you for sharing, Burt! pic.twitter.com/XgGGwJ8GlH — Jeopardy! (@Jeopardy) November 6, 2020\n\n@katslepian\n\nkatya.slepian@bpdigital.ca\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-08 09:30:00-08:00",
    "title": "‘Jeopardy!’ host Alex Trebek dead at 80 after long battle with cancer – Houston Today",
    "url": [
        "https://www.houston-today.com/entertainment/jeopardy-host-alex-trebek-dead-at-80-after-long-battle-with-cancer/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}