{
    "authors": [
        "Priyanka Ketkar",
        "Local News"
    ],
    "content": "Health officials in B.C.’s north say people should expect delays in receiving COVID-19 test results, stemming from an increase in the number of those needed to be tested in the region.\n\nIn a news release Northern Health said that “the number of new people testing positive for the virus is impacting public health‘s ability to quickly contact people who have tested positive. There is currently a backlog of people who have tested positive for COVID-19, but have not yet been contacted by public health.”\n\nThe health authority now has 1,159 cases of which 40 are currently hospitalized, 14 are in critical care, 772 have recovered. There have been nine confirmed deaths so far. Provincially, there are currently 9,524 active cases. Health officials said 346 people are in hospital with the virus, 83 of whom who are in critical or intensive care.\n\nRight now the way contact tracing works is that public health officials identify and directly notify all close contacts of every confirmed case. However, due to the increased case load, Northern Health will now gather information and notify close contacts only in certain situations.\n\nNorthern Health said that they are now deploying additional staff to its case and contact management teams, and making changes to how cases are notified, monitored, and cleared from self-isolation.\n\nAnyone who tests positive for COVID-19 will receive a call as soon as possible from public health, the health authority confirmed.\n\nThose who test positive have to self-isolate immediately, along with those in their household. In order to receive a result quicker, the health authority said opting to receive test results through text message is best. All COVID-19 positive individuals will receive a call from public health at the end of their isolation period, to release them from the requirement to self-isolate.\n\n“Rates of COVID-19 activity in the North during this second wave means that all residents, whether or not they are known close contacts of a lab-confirmed COVID case, are at similar risk. For this reason, everyone should be following public health advice and orders, closely self monitoring for symptoms, and seeking testing if symptoms develop,” said the release.\n\nPriyanka Ketkar\n\nMultimedia journalist\n\n@PriyankaKetkar\n\n\n\npriyanka.ketkar@ldnews.net\n\nLike us on Facebook and follows us on Twitter.",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-10 16:05:00-08:00",
    "title": "Haven’t received your COVID-19 test results yet? – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/news/havent-received-your-covid-19-test-results-yet/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}