{
    "authors": [
        "The Canadian Press"
    ],
    "content": "Commissioner Austin Cullen looks over the hearing room before opening statements at the Cullen Commission of Inquiry into Money Laundering in British Columbia, in Vancouver, on Monday, February 24, 2020. THE CANADIAN PRESS/Darryl Dyck\n\nBritish Columbia’s attorney general says he’s concerned about reports of a lack of co-operation from the federal financial intelligence agency at the province’s public inquiry into dirty money.\n\nDavid Eby said Thursday he called federal Public Safety Minister Bill Blair to discuss the issues raised by inquiry commissioner Austin Cullen that Fintrac, Canada’s anti-money-laundering agency, wasn’t sharing its knowledge about money laundering in B.C. with the inquiry.\n\n“I never expected anything but full co-operation from Canada’s only major anti-money-laundering agency,” Eby says in a statement. “To have anything short of that, given the agency’s stated mandate, is surprising and inexcusable.”\n\nCullen expressed disappointment with Canada’s approach to the inquiry in an interim report released Thursday.\n\n“While I was heartened when Canada applied for participant status, its level of engagement has, in a few respects, fallen short of expectations,” it said.\n\nThe report singles out Fintrac as one of the federal agencies that was slow to comply with obligations to identify and elaborate on documents it has that could be relevant to the inquiry, said Cullen’s report.\n\n“Fintrac’s initial list of documents was composed entirely of materials that were publicly available on its website,” it said.\n\nThe report said many of the documents the commission initially received from federal agencies were heavily redacted.\n\nHowever, his report said in recent months the commission has been receiving more federal documents.\n\n“I take this as a positive development and, I hope, an indication of change in approach,” the report said.\n\nEby said Blair pledged to assist in improving the responses to the public inquiry.\n\n“Despite this disturbing revelation from the commissioner, I am heartened following my conversation with Minister Blair, in which he shared the federal government will soon announce significant changes in federal policing related to money laundering in our province,” Eby said.\n\nBlair could not be immediately reached for comment.\n\nCullen said in a statement that his final report, due May 15, 2021, will be delayed. A new date for the report to the B.C. government with its recommendations was not announced.\n\nThe broad range of the issues being addressed, the length of the hearings, the effects of the COVID-19 pandemic and challenges obtaining documents are all responsible for the delay, the statement said.\n\n“Money laundering is an issue of great importance to the citizens of B.C.,” said the interim report. “It is a crime that strikes at the heart of our collective values and corrupts the fabric of a free and democratic society.”\n\nThe New Democrat government established the inquiry in May 2019 after four reports outlined the extent of illegal cash at casinos and the impact of laundered money on high real estate prices in B.C.\n\nThe inquiry has heard testimony from two former police officers who said they raised concerns about organized criminals and illegal cash at casinos more than a decade ago, but the claims were not properly addressed.\n\nCullen’s interim report said the commission will strive to uncover the nature and scope of money laundering in B.C. and make recommendations to ensure those involved in fighting the crime have the tools they need.\n\nThe Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nmoney laundering",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-11 10:10:00-08:00",
    "title": "B.C. attorney general relays money laundering inquiry concerns to federal counterpart – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/news/b-c-attorney-general-relays-money-laundering-inquiry-concerns-to-federal-counterpart/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}