{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "The witness said he ducked when he noticed a laser sight on the handgun\n\nA fire-destroyed property registered to Gabriel Wortman at 200 Portapique Beach Road is seen in Portapique, N.S. on Friday, May 8, 2020. Newly released documents suggest the gunman behind the April mass shooting in Nova Scotia had planned to “get” a pair of people in Halifax during his murderous rampage, but the Mounties were warned by his common-law spouse while he was on the loose north of the city. THE CANADIAN PRESS/Andrew Vaughan\n\nNewly released documents suggest the gunman behind the April mass shooting in Nova Scotia had planned to “get” a pair of people in Halifax during his rampage, but the Mounties were warned by his common-law spouse while he was on the loose north of the city.\n\nThe partially redacted RCMP search warrant applications, released Wednesday, say Halifax Regional Police officers were dispatched to an unidentified residence where they provided protection to two people.\n\nNo other details are provided, but the suggestion that the killer was headed to Halifax falls in line with the route he was taking after he killed 22 people in northern and central Nova Scotia.\n\nOn the night of April 18, the killer set fire to several homes and killed 13 people in Portapique, N.S., before evading police later that night while dressed as a Mountie and driving a vehicle that he modified to look exactly like an RCMP cruiser.\n\nThe next morning, he resumed killing people he knew and others at random before he was fatally shot by a Mountie at a gas station on a highway just north of Halifax. The killer drove more than 100 kilometres during the 13 hours he was at large.\n\nThe documents also provide new details about how a wounded witness told the first officers on the scene in Portapique that he believed the shooter was his neighbour, 51-year-old Gabriel Wortman.\n\nThe witness, whose name is blacked out, told two officers that he and his wife were in their car when they approached what they thought was an “RCMP car … with an officer in it,” parked in front of a burning home.\n\n“The police vehicle pulled around the driveway and pulled up beside them, so (the witness) rolled down the window to talk to him but before he could say anything (the man who looked like a Mountie) pulled a gun out and started shooting at them,” the document says.\n\nThe witness said he ducked when he noticed a laser sight on the handgun, which was pointed at his head.\n\n“He heard two or three bangs and wasn’t even sure if he was shot at the time,” the document says, and the witness noted that one bullet hit him in the shoulder and another grazed the side of his head.\n\n“His wife screamed at him to drive and they pulled away.”\n\nMinutes later, after meeting RCMP officers arriving at the scene, the witness informed officers his first suspicion was that the gunman was Wortman because his barn was on fire and Wortman had a white Ford Taurus that he’d previously referred to as a police car.\n\n“(The witness) said the car (the suspect) was driving is almost identical to the police cars that showed up on the scene.”\n\nThe witness also said he noticed that Wortman’s house was on fire, and that “all of sudden there’s this police car that’s not a police car lighting this other house on fire, so it had to be Gabe.”\n\nThe man’s observations are significant because they show that the RCMP were made aware of the killer’s disguise and his highly detailed replica vehicle early in their response to the shooting. However, the Mounties did not issue an alert about the vehicle on Twitter until 10:17 a.m. the next day.\n\nMeanwhile, the RCMP also released more details about the weapons used by the killer, confirming he was carrying illegal, over-capacity magazines for the two semi-automatic rifles he had with him.\n\nThe Mounties say one of the weapons, a 5.56-calibre Colt Law Enforcement carbine, had been smuggled into Canada from California. The second weapon, a .223-calibre Ruger Mini 14 rifle, had been purchased from a gun shop in Winnipeg, but the documents don’t say who bought the weapon.\n\nWortman did not have a licence to possess or acquire firearms.\n\nBlake Brown, a Saint Mary’s University history professor and author of “Arming and Disarming: A History of Gun Control in Canada,” said the Ruger and Colt weapons can discharge several rounds of ammunition quickly and accurately.\n\nBrown described the Colt carbine as a variant of the AR-15.\n\n“The AR-15 has been employed by several mass murderers in the United States, and by the Christchurch, New Zealand mass shooter in 2019,” Brown told The Canadian Press.\n\nSince the 1990s, Ottawa has sought to limit the damage that can be caused by such firearms by placing restrictions on the size of their magazines, which are typically limited to holding no more than five rounds, he said.\n\nWhen the gunman was killed, he had with him three over-capacity magazines for the Colt carbine, which could each hold 30 rounds. As well, there were three magazines with the Ruger rifle, including the original five-round magazine and two over-capacity magazines designed to hold 40 rounds each.\n\n“The Nova Scotia mass shooting shows that larger magazines can be smuggled into Canada, and then used with semi-automatic, assault-style rifles,” Brown said. “This may partly be why the government … has banned many models of assault-style rifles, including the AR-15 and Mini-14.”\n\nInside the car the gunman had been driving, police also found a .40-calibre semi-automatic Glock 23 pistol with an over-capacity magazine in the gun, and a 9-millimetre semi-automatic Ruger P89 pistol. Both were equipped with laser sights and were smuggled into Canada from Maine, police say.\n\nThe gunman also had the 9-mm Smith and Wesson service pistol issued to RCMP Const. Heidi Stevenson, who was killed by the shooter as she drove up to his mock cruiser earlier in the day in nearby Shubenacadie, N.S.\n\nMichael MacDonald and Michael Tutton, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nCrimeRCMP",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-11 10:10:00-08:00",
    "title": "Gunman behind mass shooting in Nova Scotia had targets in Halifax: search warrants – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/news/gunman-behind-mass-shooting-in-nova-scotia-had-targets-in-halifax-search-warrants/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}