{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "Canada’s camp was suspended after two players and one staff member tested positive for COVID-19\n\nTeam Canada celebrates after defeating Russia in the gold medal game at the World Junior Hockey Championships in Ostrava, Czech Republic, Sunday, Jan. 5, 2020. The Canadian junior hockey team says it will resume its selection camp on Tuesday after completing a 14-day quarantine. THE CANADIAN PRESS/Ryan Remiorz\n\nCanada’s top junior male hockey players returned to the ice Tuesday following a 14-day quarantine, although there were fewer of them.\n\nFive players were released from Canada’s selection camp roster in Red Deer, Alta., because they were “unfit to continue to play based on return-to-play protocols,” according to Hockey Canada senior vice-president of national teams Scott Salmond.\n\nDefencemen Matthew Robertson, Mason Millman and Daemon Hunt and forwards Ridly Greig and Xavier Simoneau were sent home.\n\nCanada’s camp was suspended on Nov. 26 after two players and one non-core staff member tested positive for COVID-19.\n\nThe world junior hockey championship is scheduled to start on Dec. 25.\n\nThe nine other international teams are scheduled to arrive by charter flight Dec. 13. Exhibition games are planned for Dec. 20-23.\n\nHockey Canada’s vice-president of events, Dean McIntosh, insists stringent protocols and testing required for international players to enter Edmonton’s “bubble” will make the world junior championship safe to proceed.\n\nREAD MORE: BCHL postpones regular season until new year\n\nDonna Spencer, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirushockeyjunior hockey",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-08 14:00:00-08:00",
    "title": "Canadian junior hockey team cuts players, resumes selection camp after quarantine – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/sports/canadian-junior-hockey-team-cuts-players-resumes-selection-camp-after-quarantine/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}