{
    "authors": [
        "Janelle Swift",
        "Trending Now"
    ],
    "content": "‘Claps that Counts’ offers a tangible way to support nurses by listening to a one-minute track\n\nHealthcare workers at St. Paul’s Hospital acknowledge applause and cheers from people outside the hospital, as a convoy of first responders with lights and sirens activated parade past to show support for the hospital staff, in Vancouver, British Columbia, April 5, 2020. (Darryl Dyck/The Canadian Press via AP)\n\nHonking horns, cheering voices and clapping hands for healthcare workers that took off across the country at the beginning of the pandemic has transformed into a new campaign in support of the Canadian Nurses Foundation (CNF).\n\nThe campaign, called Claps that Count, takes from the audible encouragement which created a pivotal point for supporting front-line workers.\n\nBy encouraging Canadians to listen to a one-minute sound clip on streaming platforms like Spotify or Apple Music, CNF is collects a small royalty, with 100 per cent of the funds donated to helping nurses with mental health support, skills and training, aid for new research and practices for handling future pandemics.\n\n“The pandemic has created many unforeseen challenges for charities and non-profit organizations across the country resulting in limited or reduced support from donors,” Claire Betker, board chair for CNF said in a news release.\n\n“The cleverness and simplicity of Claps that Count can help raise even more awareness of the essential role nurses play and add to much-needed funds in support of nurses on the front lines.”\n\nCOVID-19 cases are consistently rising across the nation and Canadian nurses are continuing to work overtime hours. For nurses over 35 who are working overtime, they’ve doubled the average number of hours they are dedicating to COVID from May 2019 to May 2020, according to a study from Statistics Canada.\n\nMatt Hassel is the CCO of Forsman and Bodenfors – the company that helped CNF launch the campaign.\n\n“These heroes haven’t stopped risking their lives for us, so we want to show our support for them hasn’t stopped either.”\n\nThe Canadian Nurses Foundation is encouraging Canadians to help spread awareness on social media using the hashtag, #ClapsThatCount.\n\n@janelle_swift\n\njanelle.swift@castlegarnews.com\n\nLike us on Facebook and follow us on Twitter.\n\nCoronavirusNurse practitioners",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-08 14:00:00-08:00",
    "title": "‘Claps that Count’: Canadian nurses launch unique fundraising campaign – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/trending-now/claps-that-count-canadian-nurses-launch-unique-fundraising-campaign/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}