{
    "authors": [
        "Janelle Swift",
        "Trending Now"
    ],
    "content": "Zoom is the number one downloaded app this year, as more people connect digitally\n\nBritish Columbians are using virtual methods to stay connected this holiday season (Pixabay)\n\nOver half of British Columbians will be using electronics to entertain themselves and to connect with others this pandemic holiday season, according to a new online survey from BC Hydro.\n\nThe use of digital devices and small appliances accounts for about 20 per cent of the electricity consumed in an average household.\n\nApproximately three-quarters of B.C. residents said they’ll be spending more time getting cozy and watching movies more than they normally would have in pre-pandemic times, the survey suggested.\n\nThe survey was conducted with 800 respondents between Nov. 16 to Nov. 19, 2020.\n\nVideo-conferencing has become a normal routine for British Columbians. The Zoom app has become the most downloaded app on iPhones and iPads this year. Almost 60 per cent of people said they’re planning on having virtual celebrations with their families over the holidays.\n\nHalf of the participants who were surveyed said they are planning to make more frequent phone calls with their loved ones, which may be related to the 10 per cent increase in cellphone purchases.\n\nBC Hydro shares some recommendations for British Columbians to improve their energy efficiency over the winter months, including streaming movies or TV shows on a device like a smart TV can help save up to 40 per cent in electricity usage, instead of using a gaming console.\n\nAlso, taking monitor size into consideration, a 17-inch screen uses 30 per cent more energy than a 15-inch display size.\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nBCHydro",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-11 10:00:00-08:00",
    "title": "BC Hydro predicts an electricity-usage high this COVID-19 holiday season – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/trending-now/bc-hydro-predicts-an-electricity-usage-high-this-covid-19-holiday-season/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}