{
    "authors": [],
    "content": "A top agent for Sotheby’s International, Lisa Williams is smart, competitive and a force of nature in the real estate market—and it’s no wonder, because she absolutely loves what she does.\n\n“It really doesn’t matter if it’s a waterfront estate or a little cottage somewhere, when it comes together, people are happy, and I’m grateful to play a part in that,” she says.\n\nIt’s a path she started on shortly after exploring her university options.\n\n“My family background is building and development, so after some travel and a stint at UVic, it seemed the natural direction to go,” she says. “I love the fact that every day is different. And I’ve met so many fascinating people over the years, many of whom are now friends.”\n\nREAD MORE: BLVD TV Interviews Jason Binab from the Agency Victoria\n\nRiding has been another big part of Lisa’s life.\n\n“I’ve been riding since I was about 10, and competing on the Hunter Jumper circuit since about 18,” she says. “I think the riding really gave me the ability to focus under pressure, think fast and react according to changing situations.”\n\nShe adds: “I’m definitely competitive, but having said that, I think you have to learn how to lose to really understand the winning part.”\n\nThat understanding helped fuel Lisa’s determination as well.\n\n“I get the biggest reward from being a problem-solver and bringing really tough deals together. If there is a solution to be found, I won’t sleep until I figure it out.”\n\nAnd on her days off?\n\n“Ha! I don’t have many of those!” she laughs. “If the world ever gets to a new normal, I’d love to travel more. Expanding my repertoire in the kitchen would be great too. And growing up, we did a lot of boating as a family, so being out on the water will always be something I love.”\n\nREAD MORE: Boulevard Interview with Blaise MacDonald\n\nThe 7 Sins\n\nEnvy:\n\nWhose shoes would you like to walk in?\n\nI have to say that I’m pretty happy walking in mine most of the time (hats off to John Fluevog for great style and amazingly comfortable shoes), but I’d love to have walked in Steve Nash’s shoes during his NBA run. I think Steve is the epitome of hard work and focus equalling success. In a world of brash big talkers, Steve moved faster, thought smarter and delivered with grace and style. What an amazing ambassador for Canada!\n\nGluttony:\n\nWhat is the food you could eat over and over again?\n\nI’m addicted to the Prawn Phad Thai from Ba’an Thai Wok & Bar. It’s amazing! Also pretzels—ridiculous—but they have to have just the right amount of salt.\n\nGreed:\n\nYou’re given $1 million that you have to spend selfishly. What would you spend it on?\n\nPre-COVID-19, I wouldn’t hesitate to say world travel and enjoying new culinary experiences. Now, I think it would be having a sunny little getaway place on one of the Gulf Islands to share with family and friends—and a faster boat to come and go!\n\nWrath:\n\nPet peeves?\n\nConceit, laziness and, the worst, entitlement.\n\nSloth:\n\nWhere would you spend a long time doing nothing?\n\nI don’t like to sit still for very long, but I’m quite happy doing nothing on the beach at Sidney Spit, or up in Desolation Sound, provided “nothing” includes some wine, fresh prawns or crab on the portable barbecue, and some good music and friends to share it with!\n\nPride:\n\nWhat is the one thing you’re secretly proud of?\n\nOn the play side, I’ve been lucky to have been able to compete and win at some top-level Hunter Jumper competitions in New York, DC, Kentucky, Pennsylvania and California. It’s a special partnership with the right horse, and a pretty incredible feeling to win under pressure. With real estate, I’m proud to be the highest-selling agent in Victoria and will be the first to reach the billion-dollar milestone in overall sales this year. I’m grateful to be able to do what I love, and lucky to live in such a special place in the world! Since COVID, I know I definitely appreciate it more than ever.\n\nLust:\n\nWhat makes your heart beat faster?\n\nSpeed. Winning. Making the deal happen and calling the clients to tell them. Music, dancing, great food and wine, laughing so hard it hurts. And of course, being in love!\n\nLike us on Facebook and follow us on Twitter.\n\nLifestyle",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-08-05 09:30:00-08:00",
    "title": "Secrets and lives, and the 7 sins – Houston Today",
    "url": [
        "https://www.houston-today.com/life/secrets-and-lives-and-the-7-sins/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}