{
    "authors": [
        "The Canadian Press"
    ],
    "content": "Among females, 44 per cent of Canadians who’ve come out to teammates reported being victimized\n\nMontreal Alouettes’ Michael Sam is set to make his pro football debut as he warms up before the first half of a CFL game against the Ottawa Redblacks in Ottawa on Friday, Aug. 7, 2015. Sam became the first publicly gay player to be drafted in the NFL. He signed with the Montreal Alouettes after being released by St. Louis, but abruptly left after playing one game. THE CANADIAN PRESS/Justin Tang\n\nChris Voth’s sexuality cost him a job with a professional volleyball team overseas four years ago.\n\nThe Winnipeg native, who has never named the team nor country, was told outright that the club wasn’t interested in having a gay player.\n\nThe 30-year-old came out publicly seven years ago because he hoped to be a role model for young LGBTQ athletes, and given the chance to go back and change that, he wouldn’t.\n\nBut Voth was disheartened to learn that the majority of gay athletes still don’t come out, and that homophobic language on the field or court remains rampant — and Canada is among the worst offenders.\n\n“That was disappointing, because I always like to think that we’re a bit more further ahead up north (compared to the U.S.),” said Voth, recently home from coaching in the Netherlands.\n\nThe former national team player was responding to two studies released Thursday by Monash University in Melbourne, Australia.\n\nThe first study analyzed survey responses from 1,173 lesbian, gay and bisexual people aged 15 to 21 living in Canada, the U.S., Britain, Australia, New Zealand and Ireland.\n\nThe study found that about 48 per cent of Canadian youth who come out to teammates reported being the target of homophobic behaviour, including bullying, assaults and slurs — and it was more prevalent among Canadian youth than Americans (45 per cent).\n\nAmong females, 44 per cent of Canadians who’ve come out to teammates reported being victimized — more than any other country surveyed by Monash’s Behavioural Sciences Research Laboratory.\n\n“It’s easy for Canadians to dismiss the data and say, ‘No, no, that’s not in our country. We’re inclusive and welcoming. And we’re known around the world for being friendly and polite and nice,’” said lead author Erik Denison, who’s Canadian.\n\n“Canada has been a laggard globally, full stop. There’s no other way to say that.”\n\nYoung people who came out were significantly more likely (58 per cent versus 40 per cent) to report they’d been the target of homophobic behaviors in sport settings than those who didn’t, the study found.\n\nEvery study over the past 15 years has shown that LGBTQ kids play sport at lower rates than straight kids, Denison said, and while there’s a perception that the gap is more prevalent in boys than girls, that’s not accurate.\n\n“And seeing these big gaps in participation, I can only use the word alarming,” said Denison. “We’re really alarmed about both discrimination in sport, and the fact these kids are avoiding sport.\n\n“Because the No. 1 thing we could be doing to reduce rates of suicide and self-harm is encouraging these kids to become active in safe and supportive environments.”\n\nNumerous studies have shown that suicide attempts and ideation about suicide are significantly higher in LGBTQ kids.\n\nVoth’s experiences as an out athlete varied wildly. The 30-year-old believes discrimination cost him spots on several pro clubs, contract negotiations inexplicably stalling with no explanation. On the other hand, when he signed with a pro team in Finland, he was “the first gay person that any of them had met. And only a month-and-a-half later, we were the first pro volleyball team to walk in a pride parade. So it can really go either way.”\n\nVoth said LGBTQ youth are doubly impacted, losing out on the mental health benefits that come from being part of a team.\n\nThe second Monash study investigated why some athletes use homophobic language.\n\nDenison pointed out that while there are “homophobes, racists and sexist people everywhere,” they tend to control their behaviour around others.\n\n“The opposite is happening in sport. In sport, the culture is very supportive of homophobic language being used,” he said. “Canadian sport has three official languages: French, English and homophobic language.”\n\nAnd while most people believe it’s slurs aimed at opponents during games, their studies found that homophobic language is being used at practices, in the locker-room, and at social events, as jokes and banter.\n\n“And we’re not just talking about words like ‘gay,’ we asked about much more severe language,’” Denison said.\n\nHe is working with the University of British Columbia among other schools around the world on a program aimed to train team captains to be leaders on this issue, because coaches can’t necessarily create change, it’s more effective when it comes from an athlete’s peers.\n\nDenison said that Volleyball Canada is the only national sport organization in the country that has done work specifically targeting homophobia, and it occurred around the same time Voth came out publicly.\n\n“I don’t want to denigrate what the NHL (among other leagues) has done, but at the end of the day, the NHL is a professional sporting organization, they’re ultimately a business,” Denison said. “It’s up to Hockey Canada, it’s up to Soccer Canada, it’s up to Rugby Canada, it’s up to those bodies and provincial bodies as well to be driving change.”\n\nThe Canadian Olympic Committee has done anti-homophobia social media campaigns, mall installations, and regularly marches in pride parades across the country.\n\nPro sports teams such as Toronto FC and the Toronto Raptors host annual pride games.\n\nDenison said his research, however, has shown those initiatives do little to reduce homophobic behaviour and language among fans. He’d rather see pro teams work with teams and programs at the grassroots level to hold their own pride games, among other initiatives.\n\n“What we’ve seen is that when amateur-level teams hold pride games, the players on those teams use half the homophobic language than those who don’t hold these events,” Denison said. “These events are really good at getting those conversations going around ‘Hey, guys, what kind of language do we actually want on our team?’ That’s where we can change those norms and culture, we think quite effectively.”\n\nDenison pointed out that there are openly-LGBTQ people in entertainment, government, and major corporations, but by comparison, they largely remain invisible in sports, particularly on the men’s side, and have since David Kopay came out in 1975 after he retired from the NFL. He’s believed to be the first pro athlete to come out.\n\nMichael Sam became the first publicly gay player to be drafted in the NFL. He signed with the Montreal Alouettes after being released by St. Louis, but abruptly left after playing one game.\n\nBrooklyn Nets forward Jason Collins came out in 2013, and former Major League Soccer midfielder Collin Martin followed suit in 2018. Collins has retired, and Martin plays in the USL, and there have been no active gay players in any of the five major North American sports leagues since.\n\nWomen’s pro sport has been a different story. Sports power couple Sue Bird and Megan Rapinoe are two of the numerous out athletes in the WNBA, NWSL, and other women’s leagues.\n\nFor Denison, Canada’s track record is particularly disheartening.\n\n“It’s quite embarrassing for me as a Canadian researcher who happens to be down in Australia now to see that Canada is a laggard. Because I’m a proud Canadian, and I think Canadians have a reputation for being friendly and inclusive.\n\n“But it looks like either Canadians have been ignoring this issue, we’re not aware of this issue, or worse, maybe there’s some deliberate resistance to do anything about this problem.”\n\nLori Ewing, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-05 06:30:00-08:00",
    "title": "Study finds Canada a ‘laggard’ on homophobia in sports – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/sports/study-finds-canada-a-laggard-on-homophobia-in-sports/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}