{
    "authors": [
        "Wolf Depner",
        "Trending Now"
    ],
    "content": "The Shaw Centre for the Salish Sea made news earlier by naming its new octopus Henry in honour of provincial health office Dr. Bonnie Henry. The animal is scheduled to leave Dec. 15. (Photo by Bob Orchard/Shaw Centre for the Salish Sea)\n\nA Henry is leaving the bubble, but it has nothing to do with COVID-19.\n\nHenry, the giant Pacific octopus named after provincial health officer Dr. Bonnie Henry, is leaving the Shaw Centre for the Salish Sea on Dec. 15, the facility announced in a release.\n\nThe male cephalopod arrived in June to much fanfare. The scheduled release of the animal reflects traditional practice. As the centre says in the release, octopuses are highly intelligent, grow incredibly large (and fast) with a short lifespan of three to five years, and reproduce at the end of respective their life cycles. “Gather all of these elements together and it’s clear why the Centre limits each octopus to approximately six months in residence,” it reads.\n\nRELATED: Sidney aquarium names new octopus after Dr. Bonnie Henry\n\nAccording to the release, staff will release the animal near where he was collected on the west coast of Vancouver Island.\n\nBut before Henry disappears into the depths of the Pacific Ocean, locals have a chance to guess his weight.\n\nHenry arrived in June weighing 2.3 kg or five pounds. “It’s anyone’s guess what the scale will register on Dec. 15, his scheduled departure date, but we’re pretty sure he’s put on a few pounds,” reads the release.\n\nRELATED: Shaw Centre releases 70 salmon and a giant octopus back into the sea\n\nAccording to his caretakers, the animal’s name was fitting. “This particular octopus, more than any former octopus resident, has been particularly calm, just like Dr. Henry,” it reads.\n\nwolfgang.depner@peninsulanewsreview.com\n\nAquariumSidney",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-08 17:00:00-08:00",
    "title": "Vancouver Island aquarium frees octopus named after Dr. Bonnie Henry – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/news/vancouver-island-aquarium-frees-octopus-named-after-dr-bonnie-henry/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}