{
    "authors": [
        "Clare Rayment",
        "Local News"
    ],
    "content": "Here we are in the final week before our Christmas Hamper pick up. COVID-19 has made several changes in our lives, the least of which is for our Christmas Hamper Appeal 2020. Anyone wishing to receive a Christmas hamper should have their request form in to the Kitimat Food Bank, located in the lower level of the City Centre Mall near the back entrance; if you missed the deadline of December 3rd please drop off a request form anyway and you will be placed on a wait list – forms can be picked up at the Food Bank on Tuesday and Thursday afternoons between 1-3 p.m. The Food Bank will be open for pick up of hampers from Monday, December 14th to Friday, December 18th, between 10 a.m. and 3 p.m. COVID rules will apply – please don’t forget your mask.\n\nDonations made over the past week include: M. Grant $100; R. McLeod $200; International Brotherhood Electrical Workers Local 993 (Kamloops) $500; J. Middleton $100; Anonymous $100; B&D Dueck $200; Kitimat Firefighters Local 130 $5000; J.A. Hildebrandt $125; I. Meier $100; Doctors Gottschling & Stevenson $500; B. Gottschling $100; Pacific Cornerstone Baptist Church $250 and Envision Full Cupboard donation $719.01 bringing our total to date of $13,394.01 – we are well on our way to meeting (or beating) last year’s total of $41,000.\n\nDonations of non-perishable food, gifts/gift cards and cash may be dropped off at the Envision Financial Credit Union Christmas Tree Monday to Friday during their regular banking hours; cash donations can also be mailed to Box 20, V8iC 2G6 – receipts will be issued for donations of $10 or more for income tax purposes.\n\nOur deepest thanks to all of you for your generosity and please continue to keep the donations coming in. Receipts are issued for cash donations throughout the year; non-perishable food will continue to stock our shelves. We appreciate the ongoing support from our various churches, No Frills, Save-on-Foods and other community businesses and organizations who provide their help and donations on a regular basis year round. We are blessed to have a group of committed volunteers who manage the Food Bank all year, although we have had to keep our numbers to the usual weekly “bubble” groups since the onset of COVID, who are so dedicated in turning out each week to stock shelves, fill hampers and hand them out on Tuesday and Thursday afternoons. Without the ongoing support of all the local media our Appeal would not continue to be the success it has been for over the past 50 plus years of hamper deliveries. Thank you again and please keep up the great work.\n\nYours sincerely,\n\nLuella Froess\n\nPublicity Chair",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-07 13:15:00-08:00",
    "title": "Kitimat Food Bank Christmas Hampers 2020 – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/community/kitimat-food-bank-christmas-hampers-2020/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}