{
    "authors": [
        "Clare Rayment"
    ],
    "content": "Any pet owner will tell you, pets are an important part of the family\n\nMy family and I recently had to say goodbye to my childhood dog, Archie.\n\nHe was 16 years old. I was only six when we got him. He was a Pekingese-Shih Tzu mix and we referred to him as our ‘grumpy little man,’ because he’d been a grump since we brought our second dog, Reggie, home when Archie was six.\n\nUnfortunately, Archie developed lymphoma this year and his health had been regressing fairly rapidly over the past few months. I had seen pictures my parents sent me and he just wasn’t really Archie anymore.\n\nHis coat was shaggy and dull, his eyes were glassy, and while my parents said he didn’t appear to be in pain, he barely moved anymore — only when he knew food was being opened in the kitchen. That was the hilarious thing: he went mostly deaf in his final year, but that nose never wavered and he could always smell when food was around.\n\nAnd as sad as we all were to put him down — and as sad as I was that I couldn’t be there to say goodbye — my parents told me that moment was the most calm and at peace he’s looked in the past few months.\n\nArchie was the second pet I had to put down this year, with my old cat, Carmello, being the first.\n\nI adopted Carmello when he was 18 years old because no one else wanted him. I only had him for about five months before I had to put him down this past January, but it’s incredible just how much we bonded in that time.\n\nIt’s amazing how much of an impact pets can have on our lives. We don’t speak the same language, yet most people I know can easily understand what their pet is saying or asking for based on intonation of the bark/meow/squeak/etc. and body movements, and often vice versa.\n\nEvery pet has their own personality, their own way of showing love. And the amount of stories you see and hear about pets saving their owners or alerting adults when young children are in trouble is just astonishing.\n\nAny pet owner can tell you, pets are an essential part of the family. They come on family trips, they’re in family photos, we accommodate their needs and wants, and we even make sure we celebrate their birthdays.\n\nI can’t put into words why humans first saw animals like dogs and cats and decided that they wanted them as pets. Maybe because they’re cute? They could help catch food? They were just really nice to hug when humans were sad?\n\nAnd while I can’t put it into words, every pet owner knows what I mean. Pets don’t really offer us anything in return. They can’t cook. They cause a mess and can’t even clean it up. They can’t help the kids with homework or help you file your taxes or pay bills. In terms of household help, they really can’t do much.\n\nThe thing they can do, however, is offer us unconditional love. As the saying goes: take a human family member and your pet and lock both of them in a closet for an hour. When you come get them out, who’s the one that’s going to be happy to see you? (Please don’t actually ever do this, it is just a saying and meant to show the unconditional love of pets. Although I’m sure this saying would apply more to a dog than a cat, even. Cats bow to nobody.)\n\nHonestly, that unconditional love and friendship is worth the expensive costs, dirty floors, cleaning up poop, and general pet care and maintenance. Our lives are hectic and stressful, and being able to come home to a ball of fluff and love that wants nothing more than to curl up beside you on the couch is not something to take for granted.\n\nAnd while I sadly can’t give Archie or Carmello a big hug anymore, or have them curl up beside me on the couch, I will always have those memories to keep me going and to share with others on days that I miss them.\n\nI will also always have the kindness of others who stop to let me pet their dog on the street, or who let me say hello to their cat when I come over for an interview.\n\nLike I said, it’s strange how much a small (or large), furry (or scaly, feathery, spiky, etc.) creature can affect us and play such a big role in our lives. But there’s definitely a special connection between people and pets, and it’s not one we should let go to waste.\n\n— Clare Rayment, Kitimat Northern Sentinel editor\n\nREAD MORE: Clare’s Corner: Proper punctuation can save lives\n\nREAD MORE: Clare’s Corner: Hello, darkness, my old friend\n\n\n\nclare.rayment@northernsentinel.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-07 15:57:00-08:00",
    "title": "Clare’s Corner: They’re not called ‘man’s best friend’ for nothing – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/opinion/clares-corner-theyre-not-called-mans-best-friend-for-nothing/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}