{
    "authors": [],
    "content": "Cameron Bulger was diagnosed with brain cancer at age 6 and passed away 2 1/2 years later. While BC Children’s Hospital is home to experts leading the way in treating the most aggressive cancers, a devastating 20 per cent of children who are diagnosed with cancer will not survive the next five years.\n\nIt was a phone call that Glenn and Sharon Bulger will never forget. On Jan. 18, 2018, their son’s school called to tell them that Cameron suddenly wasn’t able to speak or make eye contact with anyone.\n\n“When I got to the school and went up to Cameron, his gaze went right past me,” Glenn said. “We were rushed to the hospital from there.”\n\nA CT scan at their local hospital in Surrey revealed that the six-year-old had a mass in the right frontal lobe of his brain. He was quickly transferred to BC Children’s Hospital, where he underwent surgery that successfully removed 99 per cent of the mass.\n\nBut after additional tests, the family received unfathomable news: Cameron had an aggressive form of brain cancer, known as a grade IV malignant embryonic brain tumour. Over the next six months, he endured rounds of chemotherapy and stem cell transplants.\n\nAfter his treatment, Cameron was declared in remission. But just months later, his cancer returned – this time, it had spread to an inoperable part of his brain.\n\nDetermined to save their son’s life, Sharon and Glenn explored all possible new drug trials worldwide, with the support of their oncology care team at BC Children’s. However, the disease progressed so quickly that ultimately, the one option left wasn’t available to him soon enough.\n\nOn May 16, 2020, two and a half years after he was first brought to the hospital, Cameron passed away peacefully, at home, surrounded by his loved ones.\n\nChallenging the status quo\n\nBC Children’s Hospital is home to experts who are leading the way in treating the most aggressive cancers – but even so, a devastating 20 per cent of children who are diagnosed with cancer will not survive the next five years. Cameron was one of the 20 per cent. As Dr. Caron Strahlendorf, Division Head of Pediatric Oncology, Hematology and Bone Marrow Transplant at BC Children’s Hospital explains, so much more needs to be done to improve outcomes for children.\n\n“We are very fortunate that we’ve seen greatly improved cancer survival rates over the decades,” said Dr. Strahlendorf. “However, there are still children who are succumbing to their diagnoses or who live with life-long side effects as a result of the treatments used to heal them. BC Children’s is determined to change that.”\n\nPhilanthropy plays a powerful role in helping experts push the boundaries of what’s possible in childhood cancer care, as well as countless other health challenges that kids face. That’s why BC Children’s Hospital Foundation, the hospital’s fundraising arm, is on a mission to rally British Columbians in supporting the cutting-edge technology and groundbreaking research that are needed to conquer childhood illnesses.\n\n“Donors are so important to helping us advance research and improve care,” explained Dr. Strahlendorf. “For instance, they help enable our team of scientists and clinicians to identify what is causing these children to react differently to treatments – and to determine if there’s something unique about their cancer that will enable us to take a more personalized approach.”\n\nFor families like the Bulgers, it can bring renewed hope when it’s needed most.\n\n“We ran out of time to save Cameron, but together, we have the chance to save other children who are diagnosed with rare and hard-to-treat cancers,” Sharon said.\n\nInterested in learning more about how you can support the fight to conquer childhood illnesses? Watch Cameron’s story and to donate and learn more, please visit bcchf.ca.\n\nSharon Bulger, whose son Cameron passed away from cancer, joins BC Children’s Hospital Foundation in rallying British Columbians to support the cutting-edge technology and groundbreaking research needed to conquer childhood illnesses.\n\nFamiliesHealth and wellnessPhilanthropy",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-23 06:00:00-08:00",
    "title": "A childhood story of love, loss and hope – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/marketplace/a-childhood-story-of-love-loss-and-hope/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}