{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "Jobs Minister Ravi Kahlon speaks in the B.C. legislature, describing work underway to make a small business and tourism aid package less restrictive, Dec. 10, 2020. (Hansard TV)\n\nAs politicians argued over long-delayed B.C. government pandemic assistance for tourism and small business, a tourism task force released its recommendations earlier than planned in hopes of saving businesses that may not make it into 2021.\n\nThe report calls for the province to double the current $50 million emergency funding, with an additional $5 million to Indigenous Tourism B.C. and $95 million in emergency aid targeted to tourism businesses.\n\n“People want to come here, and they will return once this pandemic is over,” Tamara Vrooman, Vancouver airport CEO and chair of the task force, wrote in the report, released Dec. 10. “We are a strong industry but right now, we need an emergency funding bridge to keep businesses open and the workforce employed until demand returns.”\n\nIn the legislature, newly appointed Jobs Minister Ravi Kahlon and Tourism Minister Melanie Mark were under fire from opposition MLAs, reminding the NDP government that $1.5 billion in business assistance was approved by all parties last March.\n\nRELATED: Latest travel restrictions another blow to tourism\n\nRELATED: B.C. tourism industry pleads for assistance in July\n\nB.C. Liberal jobs critic Todd Stone noted the snap election in October added to delays, and called the restrictive application process for small business a “red tape disaster.” Businesses have to show they lost at least 50 per cent of their revenue every month of the COVID-19 restrictions, and 1,400 business owners who have applied still don’t know when they will receive help, he said.\n\n“They’re not sure they’re going to make it to the other side of Christmas,” Stone said.\n\nKahlon said he is still in briefings with ministry staff, and work is underway to make the small business and tourism aid more accessible.\n\n'This isn't a time for heckling,' says new tourism minister, as government pressed over delayed small business aid #bcleg #COVID19BC pic.twitter.com/vINpJFul8U — Tom Fletcher (@tomfletcherbc) December 10, 2020\n\nTourism Minister Melanie Mark said she received the task force report on Monday, and is working through the recommendations.\n\nB.C. Liberal interim leader Shirley Bond called on the government to act quickly on an opposition bill that would cap restaurant delivery fees for services such as Skip the Dishes and Doordash at 30 per cent of the cost of the order. Trevor Halford, the new MLA for Surrey-White Rock, tabled the bill Dec. 10, following up on election promises made by both his party and the NDP to help small businesses restricted by COVID-19 public health orders.\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC politicsCoronavirus",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-10 12:15:00-08:00",
    "title": "B.C. tourism calls for ‘bridge’ relief to recover from COVID-19 – Houston Today",
    "url": [
        "https://www.houston-today.com/business/b-c-tourism-calls-for-bridge-relief-to-recover-from-covid-19/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}