{
    "authors": [
        "Eric Welsh",
        "Local Sports"
    ],
    "content": "The delay is minimal, just six days, for now. But the league is open to starting up after Christmas\n\nThe BCHL is pushing the start of the 2020-21 season back by six days because of provincial health orders.\n\nThe schedule was set to begin Dec. 2 and will now begin Dec. 8, and the remainder of the ‘extended training camp’ games league-wide have been cancelled.\n\n“If the Provincial Health Office (PHO) extends their current restrictions beyond Dec. 7, we have the option of moving the start date to after the holidays, but it is our intention to begin play once the current order expires,” said BCHL Commissioner Chris Hebb. “Our objective from the beginning, when we worked out our COVID-19 Safety Plan with the PHO, was to allow our players to have a season, but we want to make sure it is under the safest conditions possible.”\n\n“Should the season start be delayed past Dec. 8, the players that choose to go home for the holidays will be required to adhere to travel guidelines, including going into isolation for 14 days prior to joining their team,” added league Executive Director Steven Cocker.\n\nA revised regular-season schedule will be released in the coming weeks.\n\nREAD MORE: BCHL approves pay-to-play model for 2020-21 season if fans can’t attend games\n\nREAD MORE: Chiefs bring back Kyle Penney as NCAA Ivy League teams shut down\n\n@ProgressSports\n\neric.welsh@theprogress.com\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nBCHLChilliwack Chiefs",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-23 09:00:00-08:00",
    "title": "BCHL pushes back season start due to provincial health orders – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/sports/bchl-pushes-back-season-start-due-to-provincial-health-orders/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}