{
    "authors": [
        "Associated Press",
        "Canada"
    ],
    "content": "Toronto Raptors forward Pascal Siakam (43) drives on Boston Celtics guard Kemba Walker (8) during the second half of an NBA conference semifinal playoff basketball game Wednesday, Sept. 9, 2020, in Lake Buena Vista, Fla. (AP Photo/Mark J. Terrill)\n\nThe Canadian government is reviewing a proposal from the NBA and the Raptors to play in Toronto amid the pandemic.\n\nA spokesman for Health Minister Patty Hajdu said Tuesday officials have been in contact with the Raptors and will continue to engage with them “in the coming weeks.” Raptors general manager Bobby Webster told Sportsnet television the team needs to know “in the coming days. This is not a next week type thing.”\n\nThe Raptors and the NBA need an exemption to a requirement that anyone entering Canada for nonessential reasons must self-isolate for 14 days. The U.S.-Canada border remains closed to nonessential travel.\n\nThe federal government denied the Blue Jays’ request to play in Toronto earlier this year because health officials didn’t think it was safe for players to travel back and forth from the United States, one of the countries hit hardest by the coronavirus pandemic. The number of cases in both countries, but particularly in the U.S, has surged since then.\n\n“The health and safety of Canadians is our government’s top priority and reducing the spread of COVID-19 must always be top of mind,” Hajdu’s office said in statement. “We understand that many Canadians are eager to see their favourite professional teams return to play. We are reviewing a proposal from the NBA and the Toronto Raptors for the resumption of NBA basketball in Canada.”\n\nThe NBA season is set to open Dec. 22, with training camps beginning in about two weeks. Time is running out for the Raptors.\n\n“We are working on, as everyone knows, a kind of parallel path here which is we want to stay in Toronto but as we all know time is of the essence and we are also working on a path to play elsewhere,” Webster said on a call with reporters Tuesday.\n\n“We want to be in Toronto. We want to play here. But we are also realistic about the timing and respectful of the protocols. … It doesn’t necessarily affect our operations. We all know we’ll run a basketball team and the 72 games will get played. But just where that is probably more of a — as everyone can imagine — drain on personal decisions and families which always looms large in this industry.”\n\nDr. Andrew Morris, a professor of infectious diseases at the University of Toronto and the medical director of the Antimicrobial Stewardship Program at Sinai-University Health Network, doesn’t think the Raptors should be allowed to play in Canada. Nor does he expect the government to approve it.\n\n“I anticipate the Raptors will have to play south of the border,” Morris said. “The logistics, the optics, make no sense.”\n\nMorris calls the U.S. a disaster and noted there won’t be a bubble in the NBA this time. This season will require teams to travel in the U.S.\n\nThe Blue Jays failed to persuade the federal government to grant exemptions and played home games in Buffalo this year. Two cities in Florida — Tampa and Fort Lauderdale — along with Nashville have been reported as potential destinations for the Raptors.\n\nThe Canadian government requites a comprehensive public health plan and written support from local health officials. The plan is being reviewed by the Public Health Agency of Canada.\n\nRob Gillies, The Associated Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirusNBA",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-18 11:05:00-08:00",
    "title": "Canada reviewing NBA plan to play in Toronto amid pandemic – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/sports/canada-reviewing-nba-plan-to-play-in-toronto-amid-pandemic/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}