{
    "authors": [
        "The Canadian Press"
    ],
    "content": "The announcement marks the interest last rate decision the central bank will make this year\n\nBank of Canada Governor Tiff Macklem and Senior Deputy Governor of the Bank of Canada Carolyn Wilkins are seen during a news conference in Ottawa, Wednesday, July 15, 2020. The Bank of Canada will deliver a rate announcement today with observers watching if news about vaccines gives a shot in the arm to the bank’s outlook on the economy. THE CANADIAN PRESS/Adrian Wyld\n\nThe Bank of Canada is keeping its key interest rate target on hold at 0.25 per cent.\n\nThe central bank says it will hold the policy interest rate at the effective lower bound until economic slack is absorbed so that the two per cent inflation target is sustainably achieved.\n\nIn its statement today, the Bank of Canada says it doesn’t expect inflation to get back on target until some time in 2023.\n\nThe central bank also says that it will maintain its quantitative easing program by continuing to buy about $4 billion in bonds per week to try and further reduce interest rates.\n\nThe announcement marks the last interest rate decision the central bank will make this year, after an extraordinary 2020 that saw it slash rates in response to the economic crisis caused by COVID-19.\n\nToday also marks a change in the upper echelons of the bank’s leadership, as senior deputy governor Carolyn Wilkins departs after a nearly 20-year career at the Bank of Canada.\n\nThe central bank’s board of directors has launched a search process to find her successor as the bank’s second-in-command.\n\nThe Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\neconomy",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-09 08:20:00-08:00",
    "title": "Bank of Canada keeps key interest rate target on hold at 0.25% – Houston Today",
    "url": [
        "https://www.houston-today.com/business/bank-of-canada-keeps-key-interest-rate-target-on-hold-at-0-25-2/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}