{
    "authors": [
        "Lachlan Labere"
    ],
    "content": "Damien Smith, with father Thomas Smith, is “frozen” with joy as he watches a special message Deadpool star Ryan Reynolds recorded for Damien’s 9th birthday on Tuesday, Nov. 24, 2020. (Contributed)\n\nTalking about his 9th birthday, Damien Smith is a boy of few words, but all of them are filled with joy.\n\nTuesday, November 24, 2020, marked a most memorable birthday for the young Canoe resident who, thanks to his mother Tiffanie Trudell and father Thomas Smith, was able to celebrate with the knowledge that many others were celebrating with him.\n\n“I’ve been in tears almost this whole time so I’m exhausted from crying,” said Trudell, whose tears of joy began falling on Saturday when she and Thomas revealed to their son the results of “Damien’s Birthday Project.”\n\nThe project began in October, approximately two weeks after the family moved to the area, with a public post on Facebook. In it, Thomas and Trudell explained Damien’s birthday was coming up and how, when asked if he was excited about it, the eight-year-old replied, “No, I’m just going to be lonely.”\n\nTo remedy this, and the fact that a birthday party was looking unlikely due to the COVID-19 pandemic, the heartbroken parents asked if anyone would be interested in sending their son birthday cards in the mail.\n\nThose broken hearts were quickly filled with happiness as people from all over the world began responding to their post. Soon, Thomas and Trudell were making clandestine trips to the post office, gathering bundles of envelopes and parcels addressed to their son while trying not to spoil the surprise.\n\nAnd then came the message from Canadian celebrity and Deadpool star Ryan Reynolds. With Damien being a big fan of Reynold’s “merc with the a mouth,” friends of the family helped bring Thomas and Trudell’s post to Reynolds’ attention.\n\nTrudell said it was at dinner time when she received a text from Reynolds and learned he’d be sending her son a special video message. She and Thomas finally got to share that video with Damien over the weekend.\n\n“Frozen,” is how Damien said he felt while watching as Reynolds spoke directly to him.\n\nTrudell, who has been brought to tears on more than one occasion by Reynolds’ involvement, said she expected his video message might be more humorous and light. While some of that is there, it is also personal, emotional and supportive.\n\nRead more: Ryan Reynolds text almost gives away Shuswap boy’s birthday surprise\n\nRead more: ‘I’m just going to be lonely’: Shuswap family asks for help celebrating son’s birthday\n\n“It was the most perfect video I could have ever expected,” said Trudell. “It’s easy to joke and be like, ‘ha ha happy birthday,’ but to really pull himself down from his stardom and be like, ‘I have been where you are,’ that was a really beautiful thing that he did for my son – To take the time out of his day just to say, ‘Hey, you’re just like me.’”\n\nOn the Deadpool theme, Damien also received a Deadpool birthday cake by Amanda Gage of Cake Creations. The Shuswap chapter of Bikers are Buddies, whose members took part in a community birthday parade that drove past Damien’s home over the weekend, also gave him a Leap Pad which, along with the cards, are to help Damien with his reading.\n\nTiffanie and Thomas have been reading the cards, received from Ireland, Russia, Mexico, Scotland, the U.S. and, of course, Canada, together with Damien. They also plan on sending out thank-you cards.\n\nBack home from school on his birthday, Damien had only one word to describe the celebrations so far: “Nuts!”\n\nTrudell and Thomas are relieved they no longer have to keep Damien’s Birthday Project a secret, and grateful for everyone who has contributed to the experience.\n\n“Seeing Damien’s face makes me feel like I’ve done a good job as a mom…,” said Trudell.\n\nLike us on Facebook and follow us on Twitter\n\nSalmon Arm",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-25 09:37:00-08:00",
    "title": "Shuswap boy celebrates 9th birthday with family, community and Ryan Reynolds – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/community/shuswap-boy-celebrates-9th-birthday-with-family-community-and-ryan-reynolds/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}