{
    "authors": [
        "Clare Rayment",
        "Local News"
    ],
    "content": "The compartments are being added to help accommodate the growing popularity of online shopping\n\nCanada Post will be adding new parcel compartments to the community mailbox site outside of Cablecar to help accommodate the growing number of online shopping deliveries, especially as the holiday season comes around.\n\nFour extra compartment units will be added in the next few days to the site at Hwy 37 and Oolichan Ave., with six parcel compartments in each. There will be a some compartments the same size as the current one, and some that are larger to accommodate larger parcels, but the new units will work the same way the current ones do. If there is a parcel waiting for a resident in the compartment, a key will be left in their mailbox. Use the key to unlock the compartment and collect the parcel, then drop it in the ‘key return’ slot to be ready for the next customer.\n\nThe new units are set to be installed around mid-December. Canada Post said the added compartments are part of a pilot project to help them learn the best way to serve different neighbourhoods as online shopping continues becoming more popular, and customers will be asked for feedback in the weeks following the installation of the units to see how they’re working.\n\nContact Canada Post at 1-800-267-1177 or parcel.locker@canadapost.ca for more information.\n\n\n\nclare.rayment@northernsentinel.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-18 09:30:00-08:00",
    "title": "New secure parcel compartments coming to Cablecar community mailbox site – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/community/new-secure-parcel-compartments-coming-to-cablecar-community-mailbox-site/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}