{
    "authors": [
        "Clare Rayment",
        "Local Entertainment"
    ],
    "content": "Fred Rodrigo talked about his experience during the Canadian liberation of the Netherlands in WWII\n\nA former Kitimat resident recently appeared in a Global News BC documentary honouring the 75th anniversary of Canadian soldiers helping to liberate the Netherlands during the Second World War.\n\nFred Rodrigo immigrated from the Netherlands to Vancouver, and subsequently to Kitimat, in the years following the war, and he lived in Kitimat until 1990. Rodrigo was 11 when the war began and said he remembers the first nights after the Netherlands were liberated.\n\n“The first night the Canadian troops were in town, I could hear music. I leaned out my window and they were playing music we hadn’t heard for years,” Rodrigo said in a press release. “And I thought – boy, we are free.”\n\nThe documentary, 75 Years Later: The Sounds of Freedom, tells Rodrigo’s story, along with stories from other Dutch people who were liberated and Canadian soldiers who were involved. A gala concert in Vancouver had originally been planned to celebrate the anniversary, but the plans had to be adapted into a documentary due to COVID-19.\n\nMore than 160,000 Canadian soldiers, sailors and airmen fought to free the Netherlands from Nazi occupation between early September 1944 and May 5, 1945, the day Germany surrendered. Wartime graves of 7,600 Canadians who died liberating the Netherlands are tended to by Dutch students to this day.\n\nRodrigo told The Kitimat Northern Sentinel he was living in Rotterdam when the war broke out, but left in 1944 when he was 15 because he was afraid of being taken by the German army.\n\n“I left my home and I went to the other part of Holland and I went underground there, you know, until the war was over,” he said.\n\nOnce the war was over, Rodrigo tried to enlist in the Dutch Army, but was told he was too young and to come back after he had been at school for a while. So he did three years at a vocational school and then joined the Dutch Navy in the Naval Air Service and trained as a radar technician.\n\nSix-and-a-half years later, Rodrigo quit the Navy and decided to move to Canada.\n\n“I went to the Canadian Embassy at Hague and put my name down and because I spoke the language and because I had been stationed in England for six months, as well, you know, so that was no problem. And I had been in the services, so they appreciated it.”\n\nIn Canada, Rodrigo tried to get a job in radar technology, but because it was still quite new and somewhat secretive at the time, he couldn’t get a job because he wasn’t Canadian. Eventually Rodrigo heard about a job in the North, and came to Kitimat to work at the Alcan — now Rio Tinto — aluminum smelter.\n\nOnce settled, Rodrigo knew coming to Kitimat was the right decision. He had good friends, a good job, and in 1949, Rodrigo attended a nurse’s dance and ended up meeting his future wife, Bev, who he’s still with to this day.\n\n“Oh, [it was] terrific. Oh yeah. I have absolutely no doubt that I made the right decision,” he said. “I’m always glad that I went up to Kitimat. Not only because I met my wife there, but it’s a great town to bring up families and make friends with a lot of people.”\n\nRodrigo left Alcan in 1985, but continued living in Kitimat until 1990, when they decided to move south.\n\n“We stayed in Kitimat for another five years, then it was just one winter when I said, ‘No, you know, enough is enough. We’ve got to start looking for somewhere else.’”\n\nThey decided on Langley and having been living there ever since, Rodrigo said.\n\nRodrigo got involved with the documentary when a family member, Olga Illich, who is a member of the 75 Liberation Committee and is also in the film, asked if he’d be interested in talking about his story after the plans for the gala event had to be changed due to COVID-19.\n\nRodrigo agreed to be interview and said that he is very happy with how things turned out.\n\n“I think it’s a very good movie — not because I am in there,” he said. “I think people will be quite pleased, you know, people who went through the war and people that never went through the war. I think it’s really enjoyable and informative for everyone.”\n\nThe documentary aired on Nov. 7 on Global News BC, and was interwoven with musical performances from the Vancouver Symphony Orchestra, the Dutch Symphony Orchestra, and the Seaforth Highlanders.\n\n\n\nclare.rayment@northernsentinel.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-14 09:00:00-08:00",
    "title": "Former Kitimat resident stars in Second World War documentary – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/community/former-kitimat-resident-stars-in-wwii-documentary/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}