{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "A coal-fired power plant seen through dense smog from the window of an electric bullet train south of Beijing, December 2016. China has continued to increase thermal coal production and power generation, adding to greenhouse gas emissions that are already the world’s largest. (Tom Fletcher/Black Press)\n\nCanada’s transition to “net zero” greenhouse gas emissions by 2050 includes not only B.C.’s liquefied natural gas exports, but Newfoundland’s offshore oil, Alberta’s oil sands and Ontario’s nuclear power, federal Natural Resources Minister Seamus O’Regan says.\n\nO’Regan kicked off an energy and climate conference in Vancouver Dec. 3 with an upbeat speech on the future of the Canadian oil and gas industry, battered as it is by world market slumps, COVID-19 and a flight of international investment capital from Canada.\n\n“Canada cannot reach its climate goals without the oil and gas industry,” O’Regan said by video link from his office in St. John’s, Newfoundland, where the offshore oil industry is at a near standstill and construction of Husky Energy’s latest offshore platform is being kept alive with federal aid of $41.5 million announced this week.\n\nKey to the net zero goal is B.C.’s LNG industry, led by the LNG Canada export facilities at Kitimat and the Coastal GasLink pipeline from northeast B.C.’s shale gas resources. Bryan Cox, CEO of the Canadian LNG Alliance, said LNG Canada’s plan to be the lowest-emitting producer in the world is getting international attention of investors.\n\nHosted by the Greater Vancouver Board of Trade and law firm Bennett Jones, the conference included Anna Stukas of Carbon Engineering, which has a direct air capture plant at the demonstration stage, pulling carbon dioxide out of the atmosphere. Stukas said the facility not only creates “negative emissions” to balance emitting activities such as oil and gas, the captured CO2 can be converted to lower-emission diesel and jet fuel. This is a way reduce emissions in truck and air transportation, two of the most difficult areas to make progress, she said.\n\nRELATED: Horgan campaigns on carbon neutral B.C. by 2050\n\nRELATED: Despite COVID-19, LNG Canada on track to start up\n\nDoug Slater of FortisBC, the province’s main private electricity and gas provider, said his company is pursuing innovations such as compressed natural gas for transport trucks, LNG for shipping to replace diesel and bunker fuel, and applications for hydrogen fuel.\n\nFortis is putting $100 million a year into incentives for household retrofitting and high-efficiency appliances, an approach endorsed by O’Regan.\n\n“I have become a convert of retrofitting homes and businesses,” he said, estimating that as much as 40 per cent of Canada’s commitments to the Paris climate agreement in 2016 can come from that strategy.\n\nO’Regan acknowledged that investment has drained away from Canada, after years of international protest targeting Alberta’s oil sands and B.C.’s natural gas production. Canada became “a box to check” for big companies like Total, Shell and others to demonstrate to shareholders they are doing something about climate change, he said.\n\nBC politicsClimate changeLNG",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-03 12:10:00-08:00",
    "title": "LNG featured at B.C. energy industry, climate change conference – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/business/lng-featured-at-b-c-energy-industry-climate-change-conference/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}