{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "B.C. Premier John Horgan on a conference call with religious leaders from his B.C. legislature office, Nov. 18, 2020, informing them in-person church services are off until further notice. (B.C. government)\n\nB.C.’s tourism industry task force is getting recommendations for COVID-19 relief to the provincial government next week, and Premier John Horgan says a long-awaited $300 million in aid for small business and tourism will be sent out as soon as possible.\n\nHorgan said Dec. 2 he has been assured by the task force chair, Vancouver Airport CEO Tamara Vrooman, that its recommendations will arrive next week, in time for brief session of the B.C. legislature that begins Dec. 7.\n\n“They plan on issuing their report next week rather than waiting for the end of December,” Horgan told reporters. “That will give us precious days in the legislature to make any changes that that report may recommend.”\n\nSki resort owners are also in discussions with Health Minister Adrian Dix on how they can operate through the winter.\n\n“We’ll keep those discussions going, the report will come next week, and we’ll take whatever steps we can to keep the industry going with liquidity, with access to staffing resources and retraining, and a whole host of other issues that I know will be in their recommendations,” Horgan said.\n\nJust before calling the October election, Horgan rolled out his $1.5 billion “StrongerBC” plan to assist small business, with applications that opened during the campaign. The fund will provide from $10,000 to $30,000 in grants, with an additional $10,000 for qualifying tourism businesses. Applications are being accepted until the end of March, or until the fund runs out.\n\nRELATED: Horgan defends election-delayed small business aid\n\nRELATED: B.C. extends private gathering ban province-wide\n\nHorgan appointed Delta North MLA Ravi Kahlon as minister of jobs, economic recovery and innovation, with his first task to oversee the program and carry on from there. But Horgan warned that with no end in sight to the public health travel advisory, within B.C. and beyond, there is a limit to what the province can do.\n\n“We tried our level best in the summer to make sure people stayed in British Columbia,” he said. “They took their discretionary dollars and spent them around B.C. But as we come into winter in the depths of the second wave of COVID-19, this is a very difficult time for the tourism sector.”\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC politicsCoronavirus",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-02 14:25:00-08:00",
    "title": "B.C. tourism relief coming soon, Premier John Horgan says – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/business/b-c-tourism-relief-coming-soon-premier-john-horgan-says/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}