{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "Retired former NDP leader and finance minister Carole James has agreed to B.C. Premier John Horgan’s request to help him navigate the coming year of economic uncertainty due to COVID-19.\n\nHorgan said his long-time friend and colleague in the B.C. legislature since they were both elected in 2005 can offer her expertise and calm leadership in a part-time capacity, as she deals with a Parkinson’s disease diagnosis that led her to announce her retirement last spring. He expressed hope that James would continue longer into the NDP government’s four-year majority mandate.\n\n“I’m going to pay her the princely sum of a dollar,” Horgan told reporters after his new cabinet was sworn in last week by video conference. “I offered her five bucks for a five-year contract. She said, ‘I’ll take it a dollar at a time.’”\n\nRELATED: B.C. mayors call for resource development role in recovery\n\nRELATED: B.C.’s COVID-19 recovery point man calls for teamwork\n\nCoquitlam-Maillardville MLA Selina Robinson moves from municipal affairs and housing to the finance ministry, inheriting a coronavirus-driven deficit that is closing in on $13 billion for the fiscal year ending in March. Robinson’s first task is to deliver on Horgan’s election promise of pandemic recovery payments of $1,000 per household or $500 per individual to most people in the province, which is expected to add another $1.4 billion to the deficit, then produce another budget for the coming year.\n\nJames led borrowing of $5 billion for B.C.’s initial pandemic relief this summer, including $1,000 payments to anyone who qualified for federal emergency aid due to lost income from COVID-19 restrictions. About $1.5 billion of that remains to be paid out to businesses, another immediate priority of the NDP government.\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC legislatureBC politicsCoronavirus",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-30 09:25:00-08:00",
    "title": "Carole James stays on to advise B.C. Premier John Horgan – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/business/carole-james-stays-on-to-advise-b-c-premier-john-horgan/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}