{
    "authors": [],
    "content": "The fall cranberry harvest is spectacular and while this year’s Fort Langley Cranberry Festival is on hold, the Creative Cranberry Online Recipe Contest will give one winner the chance to experience a private family harvest tour.\n\nWhat’s your favourite red berry? While some savour strawberries in June, and red raspberries are a summer delight, as the calendar turns to September, there’s no doubt the star of fall fields is the cranberry.\n\nCranberry farming reaches back as far as the 1940s in BC, with crops growing with the demand. Today, approximately 65 farmers are harvesting the tasty crop in British Columbia, mostly concentrated in the Lower Mainland area, with a few growers on Vancouver Island.\n\nAbout 95 per cent of berries harvested in BC will find their way to Ocean Spray, a farmer-owned cooperative, where they’ll be dried into sweet and delicious craisins, processed into juice or packaged for your grocery shelves to be used as a tart addition to muffins and scones, added to sweets or cooked into the perfect accompaniment to your holiday dinner!\n\nNot only are cranberries a tasty addition to the kitchen, but ongoing studies continue to point to the berries’ powerful wellness-promoting phytochemicals that have been linked to prevention of certain infections and some age-related chronic diseases, for example.\n\n“A lot of people enjoy using cranberries in their baking and for many people, craisins have replaced raisins as a favourite snack,” says Jack DeWit, a longtime cranberry farmer and member of the BC Cranberry Marketing Commission.\n\n“When I talk to the public and I say I grow cranberries, people often tell me how much they like the product.”\n\nA crop unlike any other\n\nCranberries are unique in a few ways. A successful season requires frost-free days before the early fall harvest, level land with appropriately acidic soil, and ample water for harvest, DeWit notes.\n\nWhy?\n\nUnlike other berry crops, cranberries are harvested in water, with fields flooded and the cheery crimson berries beaten off the bush then gathered in booms.\n\nThis unique harvest is typically the focal point of the annual Fort Langley Cranberry Festival – scheduled to welcome some 60,000 people for its 25th anniversary this year, before COVID-19 put a damper on the celebrations.\n\n“It’s a unique crop and people love to see how it’s grown and harvested. They’ll come out to spend a day at the farm and take photos with the flooded fields, surrounded by the berries,” DeWit says.\n\nWhile this year’s festivities are on hold, one lucky winner of the Cranberries BC Culinary Contest will enjoy a private farm tour for up to four family members this fall. Watch your Black Press Media community news website for details starting Sept. 1, and check out the hashtag #CranCulinaryBC!\n\nAnd while eagerly await next year’s 25th annual Fort Langley Cranberry Festival, you can enjoy BC cranberries any time of year! Visit bccranberries.com for an array of delicious recipes, family fun activities for kids and a wealth of nutrition resources.",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-08-31 06:00:00-08:00",
    "title": "Time to savour a sweet-tart home-grown harvest! – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/marketplace/time-to-savour-a-sweet-tart-home-grown-harvest/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}