{
    "authors": [],
    "content": "This Request for Proposals (RFP) is to obtain proposals from qualified building contractors to complete an upgrade to the existing Ts’oohl Ts’ap Recreation Centre. No contract will be created upon submission of a compliant application, nor upon selection of a Proponent to commence further discussions respecting the Project following review of submissions under this RFP. Proposals will be accepted today through June 29, 2020, and target completion for the project is January, 2021. Please submit completed applications to Village of Gitwinksihlkw CEO Linda Morven at linda.morven@gitwinksihlkw.ca.\n\nProject Description\n\nIn anticipation of hosting the Nisga’a Nation’s 2021 Hobiyee, and a growing community population and corollary community event space needs (including weddings, settlements, stone-movings, Yuletide Season events, sports clinics, daycare, sporting events, and other community events), the Owner is planning an approximate 2,800 square foot expansion (Expansion) to the existing Ts’oohl Ts’ap Recreation Centre located at 4002 Lax Mihl Street District Lot 7278, Cassiar District Plan, NLT14, Gitwinksihlkw, British Columbia (Rec Centre), including the addition of a second level to the Rec Centre, and including new:\n\nwork spaces for youth and recreation staff;\n\na quiet room for infants or elders;\n\na meeting room;\n\na spectator-viewing gallery with additional seating for large events;\n\nnew retractable bleachers on the main floor accommodating up to 230 persons;\n\nfire safety and alarm system, including a new sprinkler system for the renovation and the existing building;\n\nexpanded or additional water main to service building demands;\n\nan elevator-lift/stairs between floors and accessible ramp access to the gallery area; and\n\ntwo new washrooms.\n\nPhotographs providing detail of the Rec Centre’s current placement on the lot, design, layout and engineering are attached as Appendix A to Part A of the RFP. Plans for the Rec Centre are available on a confidential basis and upon request by applicant Proponents to the Owner.\n\nProject Requirements\n\nThe Project Requirements are mandatory minimum components of the Project which must be included in the scope of Work. We encourage Proponents that cannot complete the Project Requirements within the Project Budget not to apply.\n\n• The Project design and aesthetics of the design must reflect and be informed by the Village and its peoples’ culture and history and the surrounding natural habitat and nature.\n\n• The Project must be a durable, long-lasting structure intended to last for 75 years or longer.\n\n• The Project must meet or exceed the requirement of the highest published accessibility standard established in the British Columbia Building Code, CSA B651-18 Accessible Design for the Built Environment (2018), or other applicable building code or standard.\n\n• The Project must incorporate commercially reasonable best available sustainability features, including the following:\n\nThe Project must meet or exceed any applicable energy efficiency standards for buildings outlined in the Pan-Canadian Framework on Clean Growth and Climate Change.\n\nThe Project must reduce water use or provide for the reuse of water.\n\nReduce energy use of the Rec Centre.\n\nEnergy efficient heating, cooling and electricity sources and equipment.\n\nUse local materials to the extent commercially reasonable.\n\nOther measures that reduce greenhouse gas emissions of the Rec Centre or otherwise reduce the environmental impacts of construction of the Project or operation of the Rec Centre.\n\n• The Project must comply with all applicable laws, including any applicable federal, provincial, municipal or regional district, Nisga’a Lisms Government or Nisga’a Village of Gitwinksihlkw laws, regulations and policies. Any selected Proponent will be responsible for obtaining such required development and occupancy permits, licenses or authorizations as are required under applicable law.\n\n• The Project must be developed in accordance with reasonable signage requirements imposed by the Owner, the cost of which such signage will be included in the Project Price.\n\n• The Project involves certain communications obligations which will be the responsibility of any selected Proponent that enters into a Contract:\n\nPeriod progress reports for periods ending March 31, June 30, Sept. 30 and Dec. 31 of each calendar year until substantial completion of the Project must be prepared and submitted in a form determined by the Owner no less than 7 days after the end of any such period during Project development.\n\nMonthly budget forecast reports must be prepared and submitted within 7 days of the end of each calendar month during Project development in a form determined by the Owner.\n\nA final report at the time of Substantial Completion of the Project in a form determined by the Owner.\n\nAn audit report at the time of Substantial Completion.\n\nAn Asset Renewal Profile showing the capital asset replacement schedule and projected cost for the Project over the first 30 years of operation on a date to be determined by the Owner on reasonable prior notice.\n\nAn Environmental Performance Report setting out the impact of the Project on the green house gas emissions, water savings and other environmental performance of the building and the extent of local materials obtained (including reasons why certain materials could not be obtained locally) on a date to be determined by the Owner on reasonable prior notice.\n\nSuch other commercially reasonably required written reports or summaries as reasonably required by the Owner, on such dates determined thereby, on reasonable prior notice.\n\n• The Proponent acknowledges by submitting a Proposal in response to this RFP that payment of the Proponent will be conditional upon timely and complete fulfillment of these communication obligations.\n\nPlease submit completed applications to Village of Gitwinksihlkw CEO Linda Morven at linda.morven@gitwinksihlkw.ca.\n\nFor more information, visit gitwinksihlkw-rfp.squarespace.com",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-06-16 06:00:00-08:00",
    "title": "Nisga’a Village of Gitwinksihlkw RFP: Ts’oohl Ts’ap Recreation Centre Upgrade – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/marketplace/nisgaa-village-of-gitwinksihlkw-rfp-tsoohl-tsap-recreation-centre-upgrade/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}