{
    "authors": [],
    "content": "For Coastal GasLink, the health and safety of their workforce, their families, and surrounding communities is at the forefront of everything they do.\n\n“As a project team we have to continually strive to meet the highest standards so that every worker goes home healthy and safe at the end of the day,” said Michael Gibb, Coastal GasLink’s Director of Health, Safety and Security. “This has always been our top priority, and will continue to be as we face the challenges presented with COVID-19.”\n\nA key component of Coastal GasLink’s team is International SOS; global health experts who have been supporting Coastal GasLink since 2014. Their medical professionals are embedded in the project to provide their workforce with on-site care.\n\nBy engaging the medical expertise of International SOS, Coastal GasLink is also delivering on a key commitment to minimize the strain of project activities on local health care infrastructure.\n\n“Our goal is to try to mitigate the impact that [any medical situation] would have on the local health care infrastructure by trying to manage them in the field,” said Dr. Michael Evans, International SOS Canada’s Medical Director.\n\n“As well as emergency services, we also provide a bridging primary care service to take care of a worker’s basic medical needs, like ordering their prescription, so there’s no need for them to go to town to see a physician or a nurse practitioner,” adds Dr. Evans.\n\nDr. Evans and his team are also advising Coastal GasLink as they adapt their high standards for health and safety to meet all government guidelines and do their part to help slow the spread of COVID-19.\n\nTransmission prevention efforts are in effect project-wide with enhanced health screening for all workers.\n\nThat wealth of expertise and commitment to health and safety is also shared by International SOS medical professionals on the ground.\n\n“We are constantly adapting to execute our plans and it’s been very successful,” said Clint Papineau, a Registered Nurse with International SOS who is supporting Coastal GasLink in the Prince George area.\n\nPapineau and his colleagues carry out the protocols they’ve implemented with International SOS. These include educating workers about health guidelines, enhanced screening of workers for symptoms, medical monitoring, and designated quarantine and evacuation protocols.\n\n“These parameters are in place so we can catch something early enough that the employee will be able to isolate themselves,” said Papineau. “My colleagues are front line workers and we take this very seriously. This is part of Canada’s economy and many thousands of people’s livelihoods.”\n\nInternational SOS and Coastal GasLink continue to work closely with health authorities, including Northern Health and WorkSafeBC, to ensure they are meeting all health directives and requirements.\n\nLearn more about the Coastal GasLink’s commitment to health and safety at www.CoastalGasLink.com/Safety\n\nenergy sector",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-05-19 06:00:00-08:00",
    "title": "On-site medics support Coastal GasLink worker health and safety – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/marketplace/on-site-medics-support-coastal-gaslink-worker-health-and-safety/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}