{
    "authors": [
        "Clare Rayment"
    ],
    "content": "Why does the after-work darkness affect you so much more as an adult than as a child?\n\nThis might be a controversial opinion, but I’m not a huge fan of standard time.\n\nDaylight savings time runs from March to November, then we switch back to standard time to get more hours of daylight in the morning during the winter.\n\nHonestly, I’d happily stay in daylight savings time. It’s still dark at the time I wake up for work (however I don’t know if that’s because it’s actually dark or simply because it’s usually cloudy in Kitimat. I will experiment with this on the next sunny day we get), and I would much rather go home when it’s still somewhat light out.\n\nGoing home at dusk or when it’s already dark makes it feel like the day is over. There’s no fun, after-work activities in the daylight to look forward to. You can obviously still go out and do things, but it makes it more tiring trying to function when it’s dark and your body thinks it should be in bed.\n\nTo be fair, it’s 4 p.m. now as I write this, and it’s already getting dark, so maybe I wouldn’t feel any different if we stayed in daylight time. Who’s to say?\n\nIn Fall 2019 and early 2020, the provincial government in B.C., for those who don’t remember, was actually discussing and planning on staying on permanent daylight time. Most people, however, sleep researchers included, deduced that it would actually be better to stay on permanent standard time, for sleep patterns, daily movement, and general proper body and brain functioning. (You’d have to read the studies on this for more information, I don’t think I could sum it up properly here.)\n\nI don’t know if it’s the childhood memories of playing with friends after school, or just feeling like you still had your whole evening ahead of you after doing homework and chores, but having at least a couple of hours of daylight after leaving work or school or whatever you were doing made the day feel so much longer and just full of opportunity.\n\nI’m finding, as an adult, that the darkness tires me out even more than it used to. I get home and immediately I’m ready to go to my bed to read, watch TV, or honestly even go straight to sleep. That might just be because adults have less energy than children, but going home from work in darkness definitely doesn’t help.\n\nAnd as I say all this, the thought occurs to me: maybe it’s not the darkness that affects me, maybe it’s the growing up.\n\nAs a child, everything seems big and bright and magical. The darkness may be a little darker (and full of monsters), but the light is often one thousand times brighter.\n\nComing out of school after the bell rings and knowing you have hours upon hours to play with friends, be creative, and enjoy some fun time sometimes seems a little less exciting as an adult. Like I said, on an average night, I’m ready for dinner and bed once the work day is done.\n\nMaybe, then, it’s not about embracing the darkness, but embracing the inner child and those childhood memories. Kind of like in The Polar Express, when the parents can’t hear the bell, nor can the sister once she grows up, but the main boy who believes is always able to hear it.\n\nIt’s all about belief, in that case, and seeing that light through the darkness — literally and figuratively. It’s making time for fun, realizing that fatigue is mental just as much as it is physical, and sometimes going out and doing something active and fun in the evening wakes you up more than you thought it would.\n\nSo, I know it’s a little early, but I think that’s going to be part of my New Year’s Resolution. Embracing the after-work darkness and having fun with it either way. Remembering to make fun and friends and play priorities in my life, as those are the things you’re going to remember as you get older.\n\n— Clare Rayment, Kitimat Northern Sentinel editor",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-29 10:24:00-08:00",
    "title": "Clare’s Corner: Hello, darkness, my old friend – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/opinion/clares-corner-hello-darkness-my-old-friend/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}