{
    "authors": [
        "Clare Rayment"
    ],
    "content": "Winter driving is stressful for everyone, and we all need to do our part to try and keep it safe\n\nWinter driving isn’t easy. Everyone knows this.\n\nSnow piles up, tires slip around on the road, people drive a lot slower to be careful. The difference between summer and winter driving — especially in a region that gets to much snow — is noticeable, and it absolutely should be.\n\nWith the several days of snow we’ve had in Kitimat over the past few weeks, I’ve noticed many posts on Kitimat Facebook pages complaining about bad and dangerous drivers people have seen around town.\n\nPeople going through stop signs or red lights, making turns in the wrong lane, not using turn signals to turn or change lanes, speeding up to dangerous speeds to try to get in front of or around people while downtown or on major streets, to name a few. People forget that they can’t drive in winter conditions the same way they drive in summer conditions; it just doesn’t work that way if we want to be safe.\n\nOne post online I saw summed up some of the issues in quite a clever manner. It said: “The Lord moves in mysterious ways, but you don’t have to. Please use your blinker.”\n\nAnd honestly, it really is that simple. With winter driving, we need to drive like we’re taking a driving test. Drive the speed limit, or often slower so you don’t slip around on the roads and when turning. Use your blinkers to indicate every lane change and turn. Check your mirrors constantly to see who’s around you. And mostly, just be kind to others on the road.\n\nEveryone gets stressed with winter driving, even those who have been driving for many, many years. New drivers, especially, need time to learn how to drive properly in winter weather, so try to pretend everyone you meet on the road is a newer driver.\n\nLet people in if there’s a big line and they want to join your lane. Stay calm and patient when the person in front of you is taking their time trying to navigate a corner. And don’t freak out at people if they slip or make a mistake. It’s winter, mistakes are going to happen, but unless someone is killed or severely injured, it’s usually not the end of the world.\n\nNow, that being said, I don’t feel that you need to show kindness to those being jerks or being dangerous on the road. If you see someone driving dangerously or doing things that might not be safe for winter driving or might freak newer drivers out, report it. On Facebook, to the RCMP (depending on how dangerous it was, of course).\n\nPeople have the right to feel safe driving in their town and we need to stick together to make sure it stays that way, especially when the weather wants us to feel like we’re driving on an ice rink.\n\n‘Driving Home For Christmas’ by Chris Rea is one of my favourite Christmas songs and, yes, I know it’s a bit too early for Christmas music for most people, but I find it works well to help calm me down when I get agitated or stressed when driving. It’s got a nice, melodic rhythm and is calm, but just peppy enough to give you a nice, Christmasy driving feeling.\n\nAnd if that doesn’t do it for you, I also find that screaming to yourself is a good way to get out your driving frustrations, without taking it out on anyone else on the road.\n\nSo stay safe this winter, drivers. Don’t follow the Lord when it comes to moving in mysterious ways. Use your blinker.\n\n— Clare Rayment, Kitimat Northern Sentinel editor",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-15 13:18:00-08:00",
    "title": "Clare’s Corner: ‘The Lord moves in mysterious ways, but you don’t have to’: driving safely in the snow – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/opinion/the-lord-moves-in-mysterious-ways-but-you-dont-have-to-driving-safely-in-the-snow/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}