{
    "authors": [
        "Clare Rayment"
    ],
    "content": "Trying to find the bright side of an otherwise dreary month\n\nI always find November to be one of the dreariest months of the year.\n\nIt’s cold, but not cold enough to be cozy. It’s wet, but usually cold rain and sleet, not a warm rain or light snow.\n\nThe leaves on the trees are changing from bright colours to browns and are no longer fun and crunchy on the ground.\n\nHowever, as much as I dislike November, I try to give it the benefit of the doubt when I can.\n\nFirst of all, it can’t help that it falls right in between October and December, two months with very popular holiday seasons. It’s hard to be excited about November when you’re coming off a sugar high from Halloween and impatiently waiting for it to be Christmas (/Hanukkah/Kwanzaa/New Years/etc.).\n\nAlso, from the parental or adult side of things, November provides a sweet break between the two holidays, especially when the December holiday season involves buying gifts, planning for family gatherings, decorating, and so on.\n\nAlso, the first Sunday in November gives us fall daylight savings, where we get an extra hour of sleep that night. I’d say that’s a pretty fantastic way to start off an otherwise dreary month.\n\nBirthdays are another reason November isn’t so bad. No, not my birthday, unfortunately, but a few close friends have their birthdays dispersed throughout the month, so I always try to get them fun gifts or do something nice, especially knowing how dull November can be on its own.\n\nOf course, November also has Remembrance Day, a day to think about and honour those who fought and served our country.\n\nThis reason alone makes it a special month takes away some of the dreariness when you think about all the stories and history involved.\n\nI’m not trying to say that November is the worst month by any means — that, for me, is usually April because of those darn spring allergies and the wet, slushy ‘snow,’ if you can even call it that.\n\nIt’s just that I find November to be the month where people, myself included, often feel the most blue. The skies are grey, and so is the mood.\n\nAt university, November is always a tough month for students, as well. Coming back after Fall Reading Week (if your school got one) to mountains of homework, midterm exams, and projects and deadlines piling up was definitely a cause for dread.\n\nAs final exams for the Fall semester began usually the first or second week of December, November is always a flurry of work and stress, and usually one of the months students like the least because of that.\n\nBut again, it isn’t November’s fault that it isn’t always seen as a favourite month. It’s just the way the world’s made it and I try my best not to fault it for that.\n\nSo come November 1 of this year, when my wake-up alarm comes an hour later than usual and it’s only dark black, not pitch black when I wake up, I’m going to try to remember to say a little thank you to November and all it gives us.\n\nBecause whether we like it or not, it’s not like we can skip days, weeks, or months that we don’t enjoy. So might as well jump in those wet, brown leaf piles, put a sweater on under your raincoat, and remember: at least it’s not April.\n\nREAD MORE: Clare’s Corner: Yes, love is strange — and an addiction\n\nREAD MORE: Clare’s Corner: Proper punctuation can save lives\n\n\n\nclare.rayment@northernsentinel.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-10 14:22:00-08:00",
    "title": "Clare’s Corner: November highs and lows – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/opinion/clares-corner-november-highs-and-lows/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}