{
    "authors": [
        "Clare Rayment"
    ],
    "content": "For those who aren’t aware, back in June/early-July 2020, Merriam-Webster dictionary officially defined the word “irregardless.”\n\n“Irregardless” means the exact same thing as “regardless,” which means ‘despite everything else’ when used as an adverb and ‘careless’ or ‘heedless’ when used as an adjective. However, many people use ‘irregardless’ instead of ‘regardless,’ despite the former not technically being an actual word prior to this summer.\n\nIt’s a word that many people have many qualms with, as the ‘ir’ at the beginning doesn’t actually add anything or change the word’s meaning in any way. Merriam-Webster decided to officially define it because “it has been in use for well over 200 years, employed by a large number of people across a wide geographic range and with a consistent meaning,” they wrote on their website.\n\nHowever, the many articles written about it showed that the employees who had to define the word were not happy to be including it in the official dictionary and decided to be mildly petty about it. Because of that, the official dictionary definition of ‘irregardless’ is simply “regardless.”\n\nAs someone who writes for a living, in English, in particular, I often find myself conflicted with some words and whether or not they should be included in the dictionary. On one hand, yes, they’ve been used for centuries, but on the other hand, just because they’ve been used for a long time, does that mean they’re actually right? And right enough to be included in the dictionary?\n\nTo me, ‘irregardless’ feels like just another eggcorn — a word or phrase that results from mishearing or misinterpreting another word or phrase (e.g. nip it in the ‘butt’ instead of nip it in the ‘bud’).\n\nNow, because it’s a dictionary-defined word, I’m not going to complain about it for too long because there’s nothing really I can do. It’s not a word I’d ever use myself, but I’ll try my best to not make a huge deal out of it.\n\nI do love the English language and all its complexities, though.\n\nI’m not very good at math. I did well in math classes at school, but try to get me to add, divide, or figure out percentages at a moment’s notice and my brain completely freezes up. But for some people, math comes easy to them. Get them to multiply two large numbers at the drop of a hat and within a few seconds they can give you the correct answer.\n\nMy brain definitely doesn’t work like that, which is why I love English and words and grammar so much. That’s something my brain actually understands, for one reason or another. English, History, writing papers, articles, stories, you name it. I love the diversity and openness of writing, even if it means accepting words like ‘irregardless.’\n\nEnglish is a tricky language, that’s for sure. Spelling, grammar, proper sentences are all key parts of the language, all of which have changed and adapted as language and society did. Text lingo such as “LOL” (laughing out loud) and “luv” (instead of ‘love’) have also been added to the dictionary in past years, marking them as an official part of the English language.\n\nBut regardless of the fact that I love to laugh out loud — and likely use many of these words while I’m texting — don’t expect to see too many nonstandard or texting words or eggcorns from me in the paper anytime soon. That’s something I’ll make sure I’m nipping in the butt!\n\n— Clare Rayment, Kitimat Northern Sentinel editor",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-01 10:22:00-08:00",
    "title": "Clare’s Corner: ‘Their our know rules’: the difficulties of English – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/opinion/clares-corner-their-our-know-rules-the-difficulties-of-english/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}