{
    "authors": [
        "Clare Rayment"
    ],
    "content": "A little bit of love to help get you through those Monday blues\n\nWho here remembers their first ‘official’ date?\n\nI sure do. I knew the boy from school and he asked if I wanted to go to dinner and then go skating. I said sure.\n\nDinner was fine; he was a bit of a bore, but we still had a nice conversation.\n\nSkating was after dinner. Now, the other thing to note is that I’m not a very good skater. I can skate well enough, but stopping is more of a ‘glide until you slowly stop’ rather than a purposeful one.\n\nWell, this boy was a good skater. Holding my hand while skating, literally skating circles around me, skating backwards in front of me; he was everywhere. At one point, while he was skating backwards in front of me, he even tried to lean in for a kiss. I pretended to fall, instead.\n\nNeedless to say, we didn’t go out a second time. A mix of unexciting conversation and showing off really just didn’t do it for me. I had to be very upfront about it though, because he seemed to think the date went very well and that we’d be an official couple in due time.\n\nAnd see, that’s the issue with dating. Unless the date is truly horrible or something goes completely wrong, it’s sometimes hard to tell how the date went. One person may have had a great time, while the other only felt so-so. However, if you’re lucky, both will have had a great time and will be asking each other out again shortly.\n\nThe world of dating is a complex world, which makes sense given that humans have complex feelings. For example, ask anyone what love feels like. There’s no set dictionary description for love (actually that’s a lie, there definitely is, but in my opinion, that’s just the definition of the word, not the feeling).\n\nAccording to ‘Love is Strange,’ the song by rhythm and blues duo Mickey & Sylvia, once you get love, you never want to quit it. After you’ve had it, you’re in an awful fix. Essentially, love is an addiction.\n\nBut love can take many forms, as the feeling of love means something different to everyone, whether it’s big or small, public or private, spoken aloud or shown through other actions.\n\nTo some, love is a significant other, bringing you a cup of tea without asking when they see that you look sad. To others, it may be a grand gesture with balloons, an orchestra, and expensive gifts. And the great thing is, both are valid definitions because love is different for everyone.\n\nTry to think about the first time you realized you loved someone. Let’s stick with specifically romantic love this time around. Think about that moment. What were you doing? What did it feel like? What about that moment made something click to make you realize that you loved that other person?\n\nThat is a rare moment in your life and one I hope you’re able to carry with you always. Even when love doesn’t always work out, I hope that specific moment only brings happiness and good memories because it’s such a special moment in time.\n\nAnd yes, of course, just like all things, love can change and grow, and also die. The feeling of love is its own entity, capable of causing pain just as much as it’s capable of causing joy. And with dating, you never know what you’re going to get.\n\nSo the question is, is it worth the risk? Is the happiness love brings worth the pain? I think most would argue yes, yes it is, not only because the potential happiness is such a fantastic feeling, but because you can grow and learn from the pain and realize it was all a part of your life for a reason.\n\nAlso, you often get some pretty funny stories later on from dates going horribly wrong!\n\nWas the skating boy worth the risk? There wasn’t love, nor any pain involved really — except for how long it took me to convince him that I truly was not interested in another date. I’d say that it was. Because dating is always an adventure, one way or another.\n\nAnd hey, I still got a free meal out of it, so it definitely couldn’t have been all bad.\n\n— Clare Rayment, Kitimat Northern Sentinel editor\n\nREAD MORE: Clare’s Corner: Proper punctuation can save lives\n\nREAD MORE: Tea: it picks you up, it does not let you down",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-10-26 16:20:00-08:00",
    "title": "Clare’s Corner: Yes, love is strange — and an addiction – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/opinion/clares-corner-yes-love-is-strange-and-an-addiction/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}