{
    "authors": [
        "Clare Rayment"
    ],
    "content": "My Grandpa really enjoyed a good cup of tea.\n\nHe always liked the saying, “Tea: it picks you up, it does not let you down.” My parents are both fans of tea, as well, as are my grandparents on my dad’s side, who are both straight from England and it would probably be considered some sort of treason if they didn’t like tea.\n\nThat being said, it should come as no surprise that I, too, enjoy a good cup of tea. I tried coffee for a while, but it just didn’t have the same, soothing effect for me that a hot cup of tea in the morning brings.\n\nSummer, winter, rain or shine, a cup of tea is always a nice way to start the day. My personal favourite would have to be Earl Grey, as it’s a basic black tea, but still has a powerful kick of flavour and spice. If there’s no Earl Grey, Orange Pekoe is a solid second.\n\nI’m not a huge fan of herbal teas, however. Peppermint, I can do, but anything fruity just feels too sweet and sour, like a juice rather than a tea. Just give me a strong, black tea in a large mug and I’m perfectly set.\n\nTea has gotten me through many a stressful day, be it during exams or large assignments in university and high school, a difficult interview at work, or a stressful life event that required a calming moment. When I was a teenager and used to get into arguments with my mom, I’d come home from school to two cups of tea sitting on the table and somehow I’d know that everything would be resolved with a little chat and those cups of tea.\n\nI’m always amazed by people who can make their own tea, as well, because I am definitely not that nature-savvy. I know a girl who went camping one time and, upon realizing she had forgotten tea or coffee for the mornings, scavenged through the woods and found leaves and roots to make tea with. What kind of leaves and roots? I couldn’t tell you, but all who were there said the tea was absolutely delicious.\n\nAnd while I am amazed by that, I am also perfectly happy to sit back with my store-bought tea, boiling some water in a kettle and plopping in the tea bag from the comfort of my own home. Definitely might not be as adventurous, but I’m also not usually drinking tea to be adventurous. Adventure teas only come about on early morning hikes or road trips.\n\nI think, however, one of my favourite things about tea is how it reminds me of my parents. Every morning, for as long as I can remember, my dad brings my mom a cup of tea in the morning. Whether she’s lying in bed reading, or in the bathroom getting ready for work, as soon as she’s up and moving, a cup of tea is on its way to her.\n\nIt’s something so small, but something that never fails to bring a smile to my mom’s face. And for some reason, whether intentional or not, she reacts as though it’s a nice surprise every time, like she wasn’t expecting it. It’s the absolute sweetest thing, and makes me happy every time I think about it.\n\nSo maybe it isn’t necessarily the tea, itself, but the memories around it that make me love it so much. Tea is cozy, like home. It’s warm, like my family.\n\nAnd while it’s often chugged back, mostly cold as I rush to get to work in the mornings nowadays, those times when I can sit and read a book while sipping a hot mug of tea always bring me back to memories of home. And that makes me happy no matter where in the world I am, which is definitely nice on those stressful days.\n\nI guess my Grandpa was right all along. Tea: it picks you up, it does not let you down.\n\n— Clare Rayment, Kitimat Northern Sentinel editor",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-10-18 06:30:00-08:00",
    "title": "Clare’s Corner: Tea: it picks you up, it does not let you down – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/opinion/tea-it-picks-you-up-it-does-not-let-you-down/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}