{
    "authors": [
        "Clare Rayment"
    ],
    "content": "Punctuation is one of the most important parts of writing. It can completely change a sentence’s meaning, depending on what you use and where you use it.\n\nOne of the most common examples of this is the phrase, “Let’s eat, Grandma!” Seen with the comma, it’s a grandchild talking to their grandmother saying it’s time for a meal.\n\nHowever, without the comma it becomes, “Let’s eat Grandma!” Now, it’s a child in a post-apocalyptic universe or a family of cannibals who is telling the others around them to eat the grandmother.\n\nAnother cool example of this is when groups are given the phrase “Woman without her man is nothing” and are told to add the appropriate punctuation. In most of the groups, men changed it to “Woman, without her man, is nothing.” The women, however, more often changed it to “Woman: without her, man is nothing.”\n\nThe simple change of placement and switch from two commas to a colon and a comma completely changes the meaning of the sentence. And because of this, punctuation is something that journalists, especially, have to be careful with.\n\nIn mediums such as radio and television, you see or hear the people talking and can tell their intonations and meanings by how their tone changes, where they choose to pause, etc.\n\nWith written journalism, however, you have to choose to enter the appropriate punctuation into the sentence yourself, based on how the person’s voice sounds in the interview or in the recording of the interview.\n\nBecause of that, a single punctuation mark can change a direct quote’s meaning. This can be tricky to navigate sometimes, especially if a person never seems to take a breath or, on the other end of things, if they pause after every word.\n\nAs you do more interviews and talk to more people, it becomes easier to differentiate between the many ways of speaking and better understand where sentences end and begin. But you still sometimes get that one person or even just that one response that plays with you a little bit, and you may need to listen several times or get another’s opinion to make the final decision on what punctuation to use.\n\nI think part of the reason it’s so difficult, too, is because we obviously speak much differently than we write. I could speak on and on about something and merge sentences and go back to a previous point and all around and, for the most part, it would make sense. But if I tried to do that in writing, the reader would be completely lost and would probably give up on understanding what I was trying to say.\n\nIf I were to write every story exactly the way I spoke, or exactly the way interviewees spoke, it would make for a much different, likely less eloquent or understandable story. Run-on sentences would run amok, I would have to use ellipses and commas to backtrack and rephrase every few words, and the amount of exclamation marks present would make every story read like I was a child on Christmas morning.\n\nSo all that being said, and despite the lack of (proper) punctuation in most texting and correspondence these days, remember how important punctuation can be and that, when it comes down to it, one single comma can save Grandma’s life.\n\n— Clare Rayment, Kitimat Northern Sentinel editor",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-10-06 15:10:00-08:00",
    "title": "Clare’s Corner: Proper punctuation can save lives – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/columns/clares-corner-proper-punctuation-can-save-lives/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}