{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "A tongue-in-cheek message about wearing a face mask to curb the spread of COVID-19 on a sign outside a church near Royal Columbia Hospital, in New Westminster, B.C., on Sunday, Nov. 29, 2020. THE CANADIAN PRESS/Darryl Dyck\n\nB.C. recorded another 656 cases of COVID-19 for Tuesday, reversing a slight decrease as the province comes out of the weekend with strict restrictions on travel and indoor activities still in place.\n\nAnother 16 people have died in B.C. from COVID-19 related causes, for a total of 457. As of Tuesday, the number of hospitalized people went from 316 to 336, and the number in intensive care went from 75 to 76. Active cases stood at 8,796 with Tuesday’s additional totals.\n\nB.C. recorded more than 2,000 new cases over the weekend, 750 on Saturday, 731 on Sunday and 596 as of Monday, with 46 deaths over the weekend, the highest three-day total so far.\n\n#COVID19BC daily cases by health region up to Nov 30, Fraser in purple. pic.twitter.com/FIZIOV4Zvu — Tom Fletcher (@tomfletcherbc) December 1, 2020\n\n“Since we last reported, we have had 140 new cases of COVID-19 in the Vancouver Coastal Health region, 408 new cases in the Fraser Health region, 10 in the Island Health region, 83 in the Interior Health region, 15 in the Northern Health region and no new cases of people who reside outside of Canada,” provincial health officer Dr. Bonnie Henry said in a statement Dec. 1.\n\n“Remember that events, which refer to anything that gathers people together – whether on a one-time, regular or irregular basis – are not allowed for now. This includes religious, cultural or community events. Do not gather at home with anyone other than your household or core bubble.”\n\nRELATED: B.C.’s largest care home outbreak records 19 deaths\n\nRELATED: B.C. residents worried about huge COVID-19 deficits\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC legislatureCoronavirus",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-01 16:30:00-08:00",
    "title": "B.C.’s COVID-19 infection count climbs back up to 656 – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/news/b-c-s-covid-19-infection-count-climbs-back-up-to-656/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}