{
    "authors": [
        "The Canadian Press"
    ],
    "content": "This image released by ABC shows Ryan Phillippe in a scene from “Big Sky.” premiering on Tuesday. Several Indigenous groups are lambasting ABC’s “Big Sky” for a storyline about murdered women in Montana that fails to mention the crisis disproportionately involves Indigenous victims. (Sergei Bachlakov, ABC)\n\nIndigenous critics of ABC’s kidnapping drama “Big Sky” say it fails to acknowledge real-life missing and murdered Indigenous women and are extending their grievance to CTV for airing the series in Canada without added context.\n\nThe Union of British Columbia Indian Chiefs is among several Indigenous groups lambasting the Vancouver-shot series for a storyline about kidnapped women in Montana that skirts a real-life epidemic in that state, as well as B.C.\n\nThe B.C. group’s secretary-treasurer Kukpi7 (pronounced COOK’pee) Judy Wilson called it “imperative” that “ABC demonstrate some awareness and cultural competency” regarding systemic violence against Indigenous women and girls.\n\nBut she took issue Thursday with CTV, too, saying “they are equally responsible” for airing a series that appears to discount a painful reality that extends to Canada.\n\nHer union has joined several other Indigenous groups in asking ABC to append an information card to the end of future episodes that explains the MMIWG crisis.\n\nIf ABC won’t do it, Wilson said she’d like to see CTV do it themselves.\n\n“Anyone in the film industry and in the broadcast industry in Canada — especially with the National Inquiry (into Missing and Murdered Indigenous Women and Girls) — should have a social conscious if not a moral conscious and obligation to include this kind of information in their productions or at least an info card at the (end),” Wilson said when reached by phone near Vernon, B.C.\n\n“By omitting it and by not including any references … they’re adding to the issue of the genocide against Indigenous women and girls.”\n\nCTV did not provide comment by mid-afternoon Thursday.\n\nSimilar complaints against ABC have been raised by the Great Plains Tribal Chairmen’s Association representing members of tribes in North Dakota, South Dakota and Nebraska; and the Rocky Mountain Tribal Leaders Council, which represents Montana’s eight federally recognized tribes; and the international Global Indigenous Council, which said it’s not asking the network to pull or reshoot the series, but to insert an information card.\n\n“Big Sky” premiered Nov. 17 on ABC and CTV with Canadian stars Katheryn Winnick and Kylie Bunbury alongside Ryan Phillippe as detectives on the hunt for two sisters kidnapped on a remote Montana highway.\n\nIt’s based on C.J. Box’s novel “The Highway,” which the critics say also failed to address the disproportionate number of Indigenous missing and murdered women in Montana.\n\nWhile much MMIWG advocacy has been directed towards politicians and the justice system, Wilson said the entertainment industry must also address the way it portrays Indigenous issues. She said there are many Indigenous organizations willing to help film and television productions tackle these concerns responsibly.\n\n“A lot of it is social media or the messages that go to a lot of people on how we treat Indigenous women and girls, and social media can be a change-agent in what’s happening out there,” said Wilson.\n\n“We need to stand in the truth and we need to talk the truth and we need to experience it so we can move forward and find solutions that are truth-based.”\n\nThe Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nIndigenous",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-27 10:30:00-08:00",
    "title": "Indigenous groups criticize ABC series ‘Big Sky’ for insensitivity to MMIWG – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/entertainment/indigenous-groups-criticize-abc-series-big-sky-for-insensitivity-to-mmiwg/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}