{
    "authors": [
        "The Canadian Press"
    ],
    "content": "Kyle Charles says Indigenous women around the world have reached out\n\nKyle Charles poses for a photo in Edmonton on Friday, Nov. 20, 2020. Marvel Entertainment, the biggest comic book publisher in the world, hired the 34-year-old First Nations illustrator as one of the artists involved in Marvel Voice: Indigenous Voices #1 in August. THE CANADIAN PRESS/Jason Franson\n\nIndigenous illustrator Kyle Charles says hundreds of people have reached out to congratulate and thank him for his creations in a new Marvel anthology that tells the story of an Aboriginal mutant.\n\nMarvel Entertainment, the biggest comic book publisher in the world, hired the 34-year-old from Edmonton to be one of the artists for Marvel Voice: Indigenous Voices #1.\n\nSince its launch last week, people from around the world, including many Indigenous youth, have contacted him about how much they appreciate the content he has brought to a mainstream platform, Charles says.\n\n“I’ve even had young people reach out for advice,” Charles, surrounded by Marvel memorabilia and old comics, says in an interview in his home studio northwest of the city.\n\n“They tell me they’re working to get sober and … I just tell them, ‘Hey, like, we all deal with the same thing, so I want you to just trust yourself and know your own past and remain strong in that pursuit.’”\n\nNeeding to remain strong is something the member of the Whitefish Lake First Nation understands well. He had a difficult childhood, got caught up with the wrong crowd in his late teens, and spent almost a decade homeless.\n\nThe lessons he has learned help him understand the struggles Indigenous youth go through. He hopes the Aboriginal characters in the anthology will help create an understanding that anyone can be a hero despite human flaws.\n\n“It’s important for anybody living in Canada or the U.S. to have proper cultural representation. For a long time, native people didn’t have that, because they’re not in any kind of spotlight or on any kind of platform. They’re just in the background. I think something like this pushes us forward.”\n\nCharles illustrates a story in the anthology featuring Dani Moonstar, who possesses the psychic ability to telepathically create illusions of her opponents’ fears or wishes.\n\nMoonstar of the Cheyenne Nation “faces the crucial question of what her Indigenous heritage means in the new era of mutant-kind,” says Marvel’s official description.\n\nCharles says the strong and resilient Indigenous women in his life, including his girlfriend, his mother, and his ‘“Coco,” or grandmother, remind him of Moonstar.\n\n“My Coco is dying of cancer right now but she’s the strongest person I know,” he says.\n\n“Doctors say she should be in palliative care, but they can’t figure out why she has no pain … She should be struggling, and she’s not. She’s still going to dinner with my mom and showing up for bingo night,” he laughs.\n\nThat’s just how Indigenous women are — calm and capable of overcoming any obstacle — Charles says, and that’s what he hopes young women reading the story and looking at his illustrations take away from Moonstar’s tale.\n\n“Entertainment and creative fields have that power to inspire people, to maybe change the way they think about themselves, or help them understand the world around them.\n\n“I hope (women) get inspired or they feel empowered. I hope they get whatever they need out of it, even if it’s just to escape.\n\n“The most important thing to me is (them) … seeing this and saying, ‘That’s me. I am that character.’”\n\n__\n\nThis story was produced with the financial assistance of the Facebook and Canadian Press News Fellowship.\n\nFakiha Baig, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nIndigenousvideo",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-23 07:50:00-08:00",
    "title": "VIDEO: Indigenous illustrator of new Marvel comic hopes Aboriginal women feel inspired – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/entertainment/video-indigenous-illustrator-of-new-marvel-comic-hopes-aboriginal-women-feel-inspired/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}