{
    "authors": [
        "Associated Press"
    ],
    "content": "In this screen shot provided by ABC on Sunday, Nov. 22, 2020, Taylor Swift accepts the award for artist of the year at the American Music Awards at the Microsoft Theater in Los Angeles. (ABC via AP)\n\nTaylor Swift won her third consecutive artist of the year prize at the American Music Awards, but she missed the show for a good reason: She said she’s busy re-recording her early music after her catalogue was sold.\n\nIn a video that aired during Sunday’s awards show, the pop star said “the reason I’m not there tonight is I’m actually re-recording all of my old music in the studio where we originally recorded it. So it’s been amazing. And I can’t wait for you to hear it.”\n\nLast year music manager Scooter Braun — who manages Justin Bieber and Ariana Grande — announced that his Ithaca Holdings company had acquired Big Machine Label Group, the home to Swift’s first six albums. This month Braun said he has sold the master rights to Swift’s first six albums to an investment company; Swift acknowledged the sale on social media and said she would not work with the new buyers because Braun was still involved.\n\nInstead, she headed back to the studio.\n\nAre you ready for it? @taylorswift13 is #AMAs Artist of the Year! pic.twitter.com/3pcbLKSE6B — American Music Awards (@AMAs) November 23, 2020\n\nSwift beat out Bieber, Post Malone and Roddy Ricch to win the top award. She also won favourite music video and favourite pop/rock female artist, winning three honours and tying Bieber, Dan + Shay and the Weeknd for most wins Sunday.\n\nThe Weeknd lost artist of the year, but he still kicked off his all-star week as a big winner: Days before he’s expected to land multiple Grammy nominations, he won favourite soul/R&B male artist, favourite soul/R&B album for “After Hours” and favourite soul/R&B song for “Heartless” two days before the 2021 Grammy nominations are announced.\n\n“The last time I received this award it was given to me by the late, great Prince,” he said after winning favourite soul/R&B album. “And, you know, he’s the reason I get to constantly challenge the genre of R&B and yeah, I’d like to dedicate this to him.”\n\nThe Weeknd didn’t break character throughout the three-hour show with his gauze-wrapped face, which matched the vibe of his recent album and music videos where he appears blooded and bruised. He accepted his awards and performed with his face wrapped in gauze.\n\nKenny G joined the Weeknd for his performance, playing the sax in downtown Los Angeles as the Weeknd walked across a bridge singing “In Your Eyes.” He finished the performance singing “Save Your Tears.”\n\nThe Weeknd was one of several artists who appeared live at the Microsoft Theater in Los Angeles for the fan-voted awards show. Others recently taped their performances because of the coronavirus pandemic, though host Taraji P. Henson — who appeared live from the venue — said the few audience members sitting in the mezzanine practiced social distancing, wore masks and were tested for the virus.\n\nHenson joked that A-list celebrities were in the audience, including Beyoncé, though cardboard cut-out of the singer, Jay-Z and other stars appeared in seats.\n\nBut a good number of chart-toppers were in the building. Breakthrough singer-rapper Doja Cat performed and won new artist of the year and favourite soul/R&B female artist. Grammy-winning country duo Dan + Shay beautifully performed “I Should Probably Go to Bed” and won favourite country duo or group, collaboration of the year and favourite country song for “10,000 Hours,” the latter two shared with Bieber. And Megan Thee Stallion — won favourite rap/hip-hop songs for “WAP” with Cardi B — performed “Body” from her recently released debut album “Good News.”\n\nBieber and Shawn Mendes kicked off the AMAs with a pre-taped performance of their new duet “Monster,” marking the first time they performed the song together. It began with a stripped-down Bieber singing his recent hit “Lonely,” with songwriter-producer Benny Blanco on piano, and “Holy,” where background dancers wearing masks joined him.\n\nMendes, strumming his guitar, then appeared for “Monster,” which featured the twentysomethings singing lyrics about about fame and growing up as celebrities who attracted massive public attention. Mendes later sang his song “Wonder” during the show, which aired on ABC.\n\nKaty Perry, in her first performance since giving birth to her first child, gave a strong performance of the emotional and hopeful song “Only Love,” which featured a surprise guest appearance from Darius Rucker, who sang and played guitar. With flaming red lights glaring behind her, Billie Eilish sang her new song “Therefore I Am,” as her brother-songwriter-producer Finneas backed her on guitar. Jennifer Lopez and Maluma teamed up to perform their new songs “Pa’ Ti” and “Lonely” from the film “Marry Me,” which both of them star in, while Dua Lipa — who won favourite pop/rock song — floated in the air during her performance of “Levitating.”\n\n24kGoldn and Iann Dior — who currently have the country’s No. 1 song with the smash hit “Mood,” also performed. The multi-genre track is the rare song that has reached No. 1 on both the rap and rock charts.\n\nOther performers included BTS, Lewis Capaldi, Machine Gun Kelly, Lil Baby, Bell Biv DeVoe and Nelly, who performed hits from his diamond-certified debut album “Country Grammar,” which celebrates its 20th anniversary this year.\n\nThis year the AMAs, which typically awards one Latin honour, launched more categories in the genre. Becky G — who burst on the music scene in 2014 with the pop hit “Shower” but has recently had success singing in Spanish and launching hits on the Latin charts — won favourite Latin female artist.\n\nShe used her speech to honour immigrant families.\n\n“I proudly wave both flags, Mexican and American. And like many, many children and grandchildren of immigrants, no matter where they’re from, we have learned from the ones before us what sacrifice and hard work looks like,” she said. “And I dedicate this award to all of our immigrant workers in this pandemic; the students and immigrant families. It’s because of my family, my abuelitos, that I stand here today.”\n\nNominees for the AMAs were based on streaming, album and digital sales, radio airplay and social activity, and reflect the time period of Sept. 27, 2019, through Sept. 24, 2020.\n\nMesfin Fekadu, The Associated Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nMusic",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-11-23 07:45:00-08:00",
    "title": "Taylor Swift wins top prize at AMAs, says she’s re-recording music – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/entertainment/taylor-swift-wins-top-prize-at-amas-says-shes-re-recording-music/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}