{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "Business groups have been advocating for years that local approvals for construction in B.C. are too long and restricted, and that B.C.’s outdates sales tax deter business investment. (Black Press Media file photo)\n\nWith B.C.’s operating deficit heading past the $13 billion mark due to COVID-19, more than four out of five B.C. residents are concerned that tax increases and service cuts are coming, according to a new survey from the Business Council of B.C.\n\nThe business group commissioned a public opinion survey from Ipsos Public Affairs to test support for its “Stronger Tomorrow, Starting Today” recovery plan, to support businesses hit hardest by the pandemic and public health measures to contain it. The plan includes placing a time limit on municipal project approvals and restructuring B.C.’s sales tax to give the private sector a better chance to invest and recover.\n\nThe survey was conducted shortly after Premier John Horgan won a majority mandate in the Oct. 24 election. It found 81 per cent agreement that the B.C. government should do more to support businesses, and 79 per cent are concerned that the NDP’s election promises are going to lead to higher taxes or debt.\n\nBusiness council CEO Greg D’Avignon said a surprising result of the survey is the high level of concern among younger people as well as older people who have lived through Canada’s struggles with debt and deficits before.\n\n“They’re seeing this money fly around all over the place,” D’Avignon said in an interview with Black Press Media Dec. 1. “Everyone has a story about getting money they didn’t think they deserve. They know it’s coming from somewhere, and they know they’re going to have to pay it back at some point.”\n\nHorgan’s campaign promise of $1,000 payments to most B.C. households has no requirement to show lost income. It comes on top of federal relief spending that has been shown to have greatly exceeded income losses across Canada, with more deficit spending promised this week by federal Finance Minister Chrystia Freeland.\n\nVIDEO: Federal deficit nears $400B, more spending to come\n\nRELATED: B.C. legislature sits Dec. 7 for COVID-19 payments\n\nA recent analysis by CIBC found Canadians are saving money at unprecedented rates, due to what economists describe as poorly targeted and excessive federal relief payments that many people have banked because they didn’t need the money.\n\n“COVID-19 has triggered the largest cash accumulation in recorded history,” the bank’s economists found.\n\nAnd a recent report by the Organization for Economic Cooperation and Development showed household incomes in Canada rose 11 per cent in the second quarter of the fiscal year, despite a sharp contraction in the economy. The OECD calculated that Canadian labour income fell by more than $100 billion in the second quarter, but government transfers grew by $225 billion in the same period, leaving Canada with the largest deficit increase of any developed country.\n\n“With a new government in place and prospects of vaccines being available in 2021, now is the time to be thinking about how to get B.C. businesses back on their feet, how to recoup the 100,000 full-time jobs lost in the last year, and how to reinvigorate the private sector, which will drive the necessary government revenues to provide essential supports and address mounting public debt,” BCBC president Greg D’Avignon said.\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC politicsCoronavirus",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-01 11:40:00-08:00",
    "title": "B.C. residents worried about COVID-19 deficit, business survey finds – Houston Today",
    "url": [
        "https://www.houston-today.com/business/b-c-residents-worried-about-covid-19-deficit-business-survey-finds/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}