{
    "authors": [
        "Nanaimo News Staff"
    ],
    "content": "BC Ferries is asking people to avoid non-essential travel this holiday season. (News Bulletin file photo)\n\nBC Ferries’ Christmas wish is for passengers to avoid non-essential trips this holiday season.\n\nThe ferry corporation is asking customers to heed direction provided by the B.C. government and public health authorities and avoid travel unless it is necessary.\n\nFor travellers who need to make ferry trips, BC Ferries asks them to plan and book sailings, as “priority will be to keep essential goods, groceries, holiday letters and packages moving.”\n\nReservations can be made at www.bcferries.com.\n\nBC Ferries notes that foot passengers should arrive early and bundle up for the weather, as “crowding” is not permitted in foot passenger areas and travellers may be required to line up outside.\n\nCustomers are reminded of COVID-19 health and safety guidelines at BC Ferries terminals and on board vessels. Masks are required, and those who cannot wear a mask “may be asked to provide a medical certificate.” Those who refuse to mask up can be refused passage.\n\nTransport Canada regulations do not allow travellers to remain in vehicles on lower car decks during transit. Travellers parked on those decks must move to the passenger deck and maintain physical distancing there.\n\nAdditional cleaning is happening on vessels and at terminals and physical barriers have been erected to help prevent the spread of the virus.\n\n“The health and safety of employees and customers is BC Ferries’ top priority,” the release notes. “The company assures customers it continues to have many additional measures in place for their safety and to prevent the spread of illness.”\n\nThe ferry corporation added that it does not tolerate any verbal abuse of employees and other passengers and customers who are abusive may be denied service.\n\nREAD ALSO: Transport Canada probes 1,000+ reports of passengers refusing to leave vehicles on BC Ferries\n\nREAD ALSO: RCMP will board BC Ferries vessels to help enforce health and safety regulations\n\nB.C. Ferries informs customers of mask-wearing and physical distancing policies with loud-speaker announcements,… Posted by Nanaimo News Bulletin on Wednesday, December 9, 2020\n\n\n\neditor@nanaimobulletin.com\n\nLike us on Facebook and follow us on Twitter\n\nBCFerries",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-10 10:55:00-08:00",
    "title": "British Columbians asked to avoid non-essential ferry trips – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/news/british-columbians-asked-to-avoid-non-essential-ferry-trips/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}