{
    "authors": [
        "Clare Rayment",
        "Local Entertainment"
    ],
    "content": "Local mother-daughter duo from Terrace who starred in Monkey Beach, Tiyanee Stevens (left) and Erica Davis, at the premiere on Sept. 24. (Clare Rayment photo)\n\nAfter almost 20 years in the works, the film adaptation of Haisla author Eden Robinson’s Monkey Beach premiered at Tillicum Twin Theatres in Terrace last Thursday (Sept. 24) evening.\n\nOriginally published in 2000, Robinson’s novel focuses on a young Haisla girl named Lisa who returns to Kitamaat Village after several years away, when her younger brother goes missing at sea. Told through Lisa’s current explorations and past dreams and memories, Lisa reflects on the current situation and her life as she waits to hear news about her brother.\n\nThe premiere was part of the Vancouver International Film Festival (VIFF) and the theatre was given 17 screenings of the film in Terrace, with 50 people maximum at each screening. Tillicum Twin Theatres owner, Diane Robinson, said all the screenings sold out in advance.\n\nREAD MORE: ‘Monkey Beach’ supernatural film adaptation premiers at VIFF\n\nREAD MORE: Local Kitimat authors make Canadian bestsellers list\n\nEden Robinson, the book’s author, was present at the premiere and for a panel discussion after. Two of the film’s actors, local mother-daughter duo Erica Davis and Tiyanee Stevens from Terrace, were also on the panel.\n\nDavis said it was her first time acting in a film and she was incredibly nervous to work with some of the film’s big-name actors, including Adam Beach (Suicide Squad, Cowboys & Aliens) and Glen Gould (Cardinal, Murdoch Mysteries).\n\n“It was pretty overwhelming. I was super nervous. It was all very, very new to me,” Davis said. “Acting behind the camera is very, very different than being on stage in theatre. And then I noticed that, I did my best to learn the lines that were in the script and everybody else just sort of winged it.”\n\nStevens said the biggest difference for her between stage and film was the difference in one’s physical acting.\n\n“And also just acting on stage, it’s all dependent on where your audience is, because yes, you have audience members right up at the front, but you also have audience members way at the back,” Stevens said. “You sort of have to exaggerate your facial expressions and your movements, whereas on screen, the camera’s, like, right there in your face. So, you can be a lot more subtle and realistic.”\n\nThe movie was filmed on-site in Kitimat and Kitamaat Village in 2018 and Robinson said finally seeing her book come to life on the big screen was an absolutely surreal experience.\n\n“That was, I keep saying surreal, but I genuinely mean it,” Robinson said. “It’s like, when something is in the planning stages for so long, and then it’s alive in the world, it’s just beyond words.”\n\nRobinson said that, as an author, it’s always hard to have your book adapted for screen because they can never include everything, but that she understood why the changes had to be made.\n\n“From my really bad attempt at the first script, I could see why they had to make the structural changes that they did. And then there were more logistic changes they had to make just because any of the water scenes were going to be, like, super pricey.”\n\nHowever, she added that, “I think they hit all the main points. I mean, there were things that didn’t make it into book that I wished were still in there!”\n\nRobinson said one of the main differences between the book and the film was the ending, as the film’s ending was a lot more conclusive than the book’s.\n\n“I am a huge, huge fan of open endings, but I don’t think many others are,” Robinson said. “I think that the movie gives a lot more closure and it still manages to be ambiguous, and I don’t think movie audiences would be as tolerant of the kind of ending that I like.”\n\nRobinson said she always liked writing open endings because of how constricted most books endings are.\n\n“When I was coming up, a lot of the books that were geared towards our curriculum were heavily moralistic. They were, you know, ‘This is the moral. We’re going to hammer in the moral, and then we’re going to tell you exactly what everything means, and, you know, you don’t have to think. This is the ending, this is the only interpretation of the ending we will accept,’ ” Robinson said.\n\n“And that always annoyed me. So, when I started writing, I thought it would be more empowering if the reader could have more say in how the book ends.”\n\nRobinson’s favourite part about the open ending of Monkey Beach was seeing all the different endings that readers created for themselves.\n\n“When people tell me how they think the book ended, that just gives me a window into them,” she said. “For them, that is the ending.”\n\nAnd while the film’s ending was slightly more conclusive, Robinson said she still found the film very enjoyable, and found it especially nice that they were able to film on-site.\n\n“It was particularly powerful seeing the local areas in the film of Monkey Beach,” Robinson said. “It was one of those glorious, late-summer falls [when they were filming], where the weather was absolutely, just amazing. It was perfect, it was sunny. What I’m afraid of though, is that people will watch the movie and then come up expecting all this sunshine!”\n\nHer biggest regret was that she wasn’t able to be on set for most of the time filming because she was on tour for her book Trickster Drift, the second in her Trickster trilogy.\n\n“When I was here, I tried to be on set as much as possible, or in the background,” Robinson said, adding that the easiest part of the whole process was “watching just the wealth of talent that the North has. There were just so many people who came together to make that film.”\n\n“Watching their hard word come to fruition was just one of the biggest highlights for me,” Robinson said.\n\nGiven the cast was all Indigenous actors and that they filmed in Kitamaat Village and other local areas, Robinson said she felt the Haisla culture and supernatural traditions portrayed in the film were done well.\n\nAlong with Monkey Beach, the TV series Trickster, based on Robinson’s book trilogy, is set to air on CBC Gem on Oct. 7 and recently premiered the first two episodes at the Toronto International Film Festival (TIFF).\n\n“All of it coming in the craziest year of my existence, it’s just kind of [insane],” Robinson said. “I’m still stunned. That it would all come together this year, I’m hoping isn’t a sign that the world is ending. Like, ‘here’s your high point. Bye!’ I think if I win the lotto, the world is doomed.”\n\nRobinson said she doesn’t have any more book-to-film adaptations in the works at the moment, but has a few ideas about what she wants to write for her next book.\n\n“I know what I want to write next, but we’ll see what the muse does with, you know, what’s happening in the world, what’s happening with me.”\n\nRobinson added that many of her biggest supporters have been from the North, and she’s so thankful to everyone for all of their support throughout the entire process and for inspiring her stories throughout the years.\n\n“If there’s a takeaway here, it’s that your stories are important,” Robinson said. “The world needs more of your stories.”\n\n\n\nclare.rayment@northernsentinel.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-10-08 14:18:00-08:00",
    "title": "‘Monkey Beach’ a hit at VIFF premiere in Terrace – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/entertainment/monkey-beach-a-hit-at-viff-premiere-in-terrace/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}