{
    "authors": [
        "Rod Link",
        "Local News"
    ],
    "content": "First two locations to be in the lower mainland\n\nPublic health officials aren’t yet releasing details on how the northwest fits in with the plan to set up COVID-19 vaccine locations around the province now that the first shipments are scheduled to arrive.\n\nSpeaking Dec. 9, provincial health officer Dr. Bonnie Henry said two locations are now being set up in the lower mainland with an additional seven to be established in January.\n\n“The plan is to start where the need is most and where the most people are, but yes, we have plans by the early or middle of January to make sure that we have sites and they have been identified in all regions of the province,” she said.\n\nThose two first locations are within the Vancouver Coastal health region and the Fraser Health region. Both have experienced significant positive cases of COVID-19.\n\n“We’re not saying more than that at this point. We know that this is a really important thing, but we also know that we need to take all the precautions that we can to make sure that we can handle the vaccine and the packaging safely so we’re able to carry out the clinics in a safe and that people receive all the attention they need,” said Henry.\n\nVery limited amounts of the first vaccine approved by federal regulators, produced by Pfizer, will start arriving early next week, with shipments increasing in the months ahead and accelerating as other vaccines are approved.\n\nEventually 30 locations will be set up.\n\nA priority list, set out by national health care officials and agreed to by the provinces, places residents of long-term care facilities and the employees who work inside at the top.\n\nNext on the list are those treating COVID-19 patients in settings like intensive care units, COVID-19 wards and emergency departments.\n\nMills Memorial Hospital in Terrace is the northwest’s designated COVID-19 treatment centre but officials so far have not indicated when its workers might expect the vaccine.\n\nThe arrival of the first vaccine shipments comes as COVID-19 positive cases and exposure events are on the increase in the region.\n\nHealth care officials are acknowledging an increased strain on health care services, particularly in intensive care units.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-01 13:12:00-08:00",
    "title": "Officials mum on vaccine roll-out locations for the northwest – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/news/officials-mum-on-vaccine-roll-out-locations-for-the-northwest/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}