{
    "authors": [
        "Robert Barron"
    ],
    "content": "‘They are…discriminating against the smallest of B.C. businesses under the guise of protecting us’\n\nRobin Round, owner of the Valley’s Botanical Bliss Products, said the province’s decision to bar vendors selling non-food products from outdoor markets as a safety precaution during the COVID-19 pandemic is crushing her business, and others as well. (Robert Barron/Citizen)\n\nArtists, artisans and other non-food producing vendors are crying foul over the province’s decision on Dec. 2 to bar them from all farmers’ markets in B.C. as a safety measure during the ongoing spike in cases of COVID-19.\n\nMany rely on the markets for much of their annual income, with Christmas being their busiest season.\n\nRobin Round, president and owner of the Cowichan Valley’s Botanical Bliss Products that sells soap, hand sanitizer, disinfectant spray, immune system tonics, and personal health-care products, said that while she depends on online and other sales, the Duncan Farmers’ Market alone accounts for 40 per cent of her annual sales in a normal year, and has been far more this year.\n\n“For December 2020, the Duncan Market represents closer to 80 per cent of my income as all other markets and shows are shut, and people stop ordering online in mid-December for fear of not receiving items before Christmas,” she said.\n\nShe said members of the BC Farmer’s Market Association have been vigilant in meeting COVID-19 safety requirements at all times, and all businesses who attend the market are compliant.\n\nRELATED STORY: B.C. STRUGGLES WITH LOCAL FOOD PRODUCTION IN COVID-19 PANDEMIC\n\n“How and why they can single out small businesses in B.C. as a target for shutdown at the most critical point in the retail calendar, when all are compliant with their requirements, is beyond my comprehension,” Round said.\n\nRound said her business is suddenly considered non-essential, but it sells many of the same types of products as Shopper’s Drug Mart, Superstore, Thrifty’s, London Drugs, Costco and many other large retail outlets, and most of these stores are currently packed with shoppers, some elbow to elbow.\n\n“What they are doing is discriminating against the smallest of B.C. businesses under the guise of protecting us from COVID-19,” she said.\n\n“They are not protecting us, they are destroying us. My business is incorporated in B.C. and is my full-time vocation that pays all my living expenses, including my mortgage. My business supports local bookkeepers, accountants, lawyers, graphic designers and printers, so these actions have a much broader impact than just a number of vendors at a market.”\n\nRELATED STORY: B.C. RECORDS 619 NEW COVID CASES, 16 DEATHS AS B.C. UNVEILS VACCINE PLANS\n\nJoe Fortin, a wood carver who relies on farmers’ markets for sales in the critical Christmas and summer seasons, said being shut out of the markets at this time of year puts all vendors who are not food producing into an extremely stressful position.\n\n“Sales during the Christmas season keep vendors like me going until April or May when the tourist season begins,” he said. “If not for government handouts during the pandemic, I’d be in foreclosure right now and now Christmas is looking extremely bleak.”\n\nFortin said he recently walked through a crowded department store and found only half the people wearing masks, and the air was stale with no movement.\n\n“I then went for a walk down my farmers’ market in Duncan and the air was clean and fresh and everybody was being mindful of each other,” he said.\n\n“If they have to put down restrictions, they should think about where they put them. We are not great big hording crowds. We are mindful people in open-air markets.”\n\nRELATED STORY: FARMERS MARKET BACK ON AFTER CONSULTATION WITH HEALTH OFFICIALS\n\nBoth Round and Fortin sent letters expressing their concerns to multiple government officials, including Green Party leader Sonia Furstenau, their Cowichan Valley MLA.\n\nFurstenau said the Duncan Farmers’ Market, and other outdoor markets she’s attended, have very effective health procedures in place to help deal with COVID-19 and keep vendors and customers safe.\n\n“I think they are doing a great job and I wrote a letter to [Health Minister] Adrian Dix asking him to work with [Provincial Health Officer] Dr. Bonnie Henry and reconsider this decision,” she said.\n\n“Personally, I prefer shopping outdoors, especially at a time like this, and these markets support local arts and other businesses. I recognize that Adrian Dix and Dr. Henry have to make many complex decisions, but there’s always opportunities to reflect on how to do things better.”\n\nA statement from the Ministry of Health said, at this time, farmers’ markets must only sell food items.\n\n“Non-food items and personal services are restricted, except for on-line sales and pick-up orders,” the statement said.\n\n“The reason that food vendors are allowed is that farmers’ markets are essential food and agriculture service providers. It’s the product (food) that is considered essential, so that is why it is allowed.”\n\nThe statement went on to say that any store operating in B.C. has filed a COVID safety plan with WorkSafe BC to make sure they are providing a safe environment to shop in.\n\nFor more news from Vancouver Island and beyond delivered daily into your inbox, please click here.\n\n\n\nrobert.barron@cowichanvalleycitizen.com\n\nLike us on Facebook and follow us on Twitter\n\nCoronavirus",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 15:00:00-08:00",
    "title": "Non-food vendors ‘destroyed’ by banishment from B.C. farmers’ markets – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/business/non-food-vendors-destroyed-by-banishment-from-b-c-farmers-markets/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}