{
    "authors": [
        "The Canadian Press"
    ],
    "content": "As historic as the rebound was, it fell short of expectations\n\nA cleaner wipes a glass panel at Toronto’s Eaton Centre Shopping mall on Saturday, March 21, 2020. The national statistics office will say this morning how much the domestic economy bounced back in the third quarter of the year. The Canadian economy suffered its worst three-month stretch on record in the second quarter as the economy came to a near halt in April before starting to recover in May and June. THE CANADIAN PRESS/Chris Young\n\nStatistics Canada says the economy grew at a record annualized pace of 40.5 per cent in the third quarter as businesses came out of COVID-19 lockdowns.\n\nThe previous record for quarterly growth in real gross domestic product was 13.2 per cent in the first quarter 1965, the agency says.\n\nAs historic as the rebound was, it fell short of expectations.\n\nFinancial data firm Refinitiv says the average economist estimate was for an annualized growth rate of 47.6 per cent for the quarter.\n\nThe rebound over July, August and September was a sharp turnaround from the preceding three-month stretch which saw a record drop.\n\nDriving the bounce-back were the further rolling back of public health restrictions that allowed businesses to reopen.\n\nStatistics Canada also says there was a substantial increase in the housing market owing to low interest rates and household spending on goods like cars.\n\nDespite the overall increase, the national statistics office says real gross domestic product still remains shy of where it was before the pandemic.\n\nThe third quarter ended with the fifth consecutive monthly increase in real GDP after the steepest monthly drops on record in March and April when widespread lockdowns were instituted to slow the spread of COVID-19.\n\nSeptember saw a 0.8 per cent increase in real GDP, Statistics Canada says, a slight slowing from the 0.9 per cent recorded in August.\n\nThe agency also provided a preliminary estimate for October’s figures, saying early indicators point to a 0.2 per cent increase in the month. The figure will be finalized at the end of this month.\n\n“The fourth quarter of 2020 is still beginning with some growth, though less than we had anticipated,” CIBC senior economist Royce Mendes wrote in a note.\n\n“Looking ahead, the economy faces a December with harsh restrictions that will likely see another contraction in economic activity.”\n\nREAD MORE: B.C.’s economic recovery minister says getting through pandemic will be team approach\n\nThe Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronaviruseconomy",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-01 07:40:00-08:00",
    "title": "Statistics Canada says economy grew at a record pace in third quarter of 2020 – Houston Today",
    "url": [
        "https://www.houston-today.com/business/statistics-canada-says-economy-grew-at-a-record-pace-in-third-quarter-of-2020/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}