{
    "authors": [
        "Marisca Bakker",
        "Local News"
    ],
    "content": "Also: Kevin Christensen promoted to sergeant, will remain in Smithers another 3-4 years\n\nThere has been a bit of a shake up at the Smithers RCMP detachment with two new positions created this year.\n\nThe local detachment has hired two new faces and promoted another.\n\nCst. Shawn Baird is a new recuit who graduated from the RCMP training depot in Regina, Sask. Oct. 12 and has been patrolling the streets of Smithers for approximately two months.\n\nHe said it has been a big adjustment for him.\n\n“The transition going from training to the real thing, you definitely come to realize your training does come into effect, but you also learn to adapt to the actual reality that you’re dealing with, so you have to be able to flexible, to be able to improvise and also be able to work with your colleagues and get a feel the different dynamics,” he said. “It’s like you get educated, you come out and you get re-educated in the real world.”\n\nHe said the region is very busy for police work, but he is really enjoying the Bulkley Valley.\n\n“I come from southwestern Ontario,” he said. “This is my first time living in British Columbia so I’ve never seen a mountain landscape before, it’s definitely beautiful here. It’s been a lot to take in all at once, but it’s been a great experience nonetheless.”\n\nHe has also been very impressed with and the friendliness of the people.\n\n“It’s a very friendly community,” he said. “It’s rather nice to be able to walk into, like, a book store and you can have a very nice conversation with somebody and even with the social distancing that’s in effect, it hasn’t annihilated the social dynamic, people still communicate and talk.”\n\nSmithers detachment commander Staff Sgt. Terry Gillespie added they have also hired a new First Nations Policing officer in addition to the one they currently have.\n\nThe new constable is just trying secure housing before moving to Smithers from Kelowna and is a veteran of more than 10 years with the Mounties.\n\nWhile these posistions were newly created for 2020, it took an additional three months to hire them because of COVID concerns.\n\nAlso, Kevin Christensen has recently been promoted to sergeant in Smithers.\n\n“We were all very happy to find that out,” Gillespie said. “It has been working out very, very well.”\n\nChristensen has been with the force for over 20 years. He applied for the sergeant’s job when Darren Durnin was promoted to staff sergeant in New Hazelton. Gillespie is currently looking for a new corporal to fill the vacancy.\n\nChristensen is very happy for the opportunity to stay in Smithers for at least another three or four years.\n\n“To get the promotion and be able to affect more change within the community feels really good,” he said. “I know my family is very happy here, so we have no desire to move on, so having the promotion helps us stay in the community a little bit longer and enjoy it.”\n\n-with files from Thom Barker\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "Meet Smithers newest RCMP officer Cst. Shawn Baird – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/news/meet-smithers-newest-rcmp-officer-cst-shawn-baird/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}