{
    "authors": [
        "Ben Bogstie",
        "Local Journalism Initiative Reporter",
        "Local News"
    ],
    "content": "Drop in passengers from Oct. to Nov. consistent with 2019\n\nPassengers disembark from an Air Canada flight in 2018 at the Northwest Regional Airport (XYT) in Terrace. The number of passengers at the airport has declined by over 3,000 in November. (File photo)\n\nPassenger numbers at the Northwest Regional Airport dropped by just over 3,000 passengers in November.\n\nThe monthly total in November was 10,673, down from 13,856 in October. The statistics are similar to the decline in passengers between October and November 2019, when the total fell from 27,904 to 24,067 passengers.\n\nIn March, passenger numbers plummeted to historic lows because of the COVID-19 pandemic. Between March and September, the passenger count increased gradually, peaking at 14,676 in August.\n\nThe Northwest Regional Airport’s monthly statistics do not include passengers on chartered flights, so the actual number of people arriving and departing from the airport is actually higher. Charter passengers use a separate building for arrivals and departures.\n\nThe number of passengers has been dropping each month since then. The airport had been expecting the numbers could decline starting in September due to a second wave of the virus in Canada.\n\nThe airport continues to ask that people in the terminal building wear a mask. To ensure physical distancing, the airport has closed every second chair in the public seating area, security room and hold room. The eating area is at 40 per cent capacity and non-passengers are asked to stay outside the terminal building.\n\nCommon touch points like handrails, push buttons and chair arms are cleaned after each departure.\n\nREAD MORE: Northwest Regional Airport says ridership extremely low amid COVID-19\n\n@BenBogstie\n\nben.bogstie@terracestandard.com\n\nLike us on Facebook and follow us on Twitter.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-11 12:00:00-08:00",
    "title": "Northwest Regional Airport sees decline in passengers amidst second wave of pandemic – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/news/northwest-regional-airport-sees-decline-in-passengers-amidst-second-wave-of-pandemic/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}