{
    "authors": [
        "Ben Bogstie",
        "Local Journalism Initiative Reporter",
        "Local News"
    ],
    "content": "There have been reported COVID-19 exposures at six schools in Terrace\n\nCOVID-19 exposures have been reported at both Skeena Middle School and Veritas Catholic School in Terrace.\n\nThe exposure at Vertias occurred on Nov. 30, and the Northern Health lists COVID-19 exposures at Skeena Middle School on Dec. 4 and Dec. 7.\n\nNorthern Health does not publicly release details about school exposures, such as the number of cases associated with the exposure.\n\nSeveral other schools in Terrace have had COVID-19 exposures.\n\nThe first exposure took place between Nov. 23 and Nov. 26 at Centennial Christian School. The second exposure was at Suwilaawks Community School between Nov. 27 and Nov. 30. The third exposure happened between Nov. 30 and Dec. 1 at Uplands Elementary School. The fourth and fifth exposures took place Nov. 30, Dec. 1 and Dec. 2 at Caledonia Secondary School according to a letter on the the Coast Mountains School District 82 website.\n\nThere have been numerous school exposures elsewhere in the Northern Health Authority.\n\nThe Northern Health website outlines how the public health authority responds to school exposures. Public health officials perform contact tracing to determine who came into close contact with the infected person. Close contacts are then advised to self-isolate for 14 days.\n\nPublic health officials will directly contact parents of children who may be involved in a school exposure. Parents are not required to take any action unless directed by public health officials. Parents who are not contacted by public health officials should continue to send their children to school, the Northern Health website states.\n\nREAD MORE: Suwilaawks Community School in Terrace closes temporarily due to staffing shortage\n\n@BenBogstie\n\nben.bogstie@terracestandard.com\n\nLike us on Facebook and follow us on Twitter.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-11 09:10:00-08:00",
    "title": "COVID-19 exposure reported at Veritas Catholic School and Skeena Middle School in Terrace – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/news/covid-19-exposure-reported-at-veritas-catholic-school-and-skeena-middle-school-in-terrace/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}