{
    "authors": [
        "The Canadian Press"
    ],
    "content": "News this week that a vaccine is on its way means there is a light at the end of the tunnel\n\nICU nurse Sophie Gabiniewicz takes a rest in one of the staffing rooms during her shift at St. Paul’s hospital in downtown Vancouver, Friday, December 4, 2020. THE CANADIAN PRESS/Jonathan Hayward\n\nSophia Gabiniewicz is well accustomed to dealing with stress as a registered nurse in the intensive care unit at St. Paul’s Hospital in Vancouver.\n\nBut she says it rose to a new level as the second wave of the COVID-19 pandemic began to swell and she recognized a familiar face in the ICU.\n\nGabiniewicz once worked with the woman, a “vibrant” former health worker in her 70s, who told her she had never been hospitalized in her life and that the COVID-19 infection took her by surprise.\n\n“I worried for this person even more than I expected to,” she said. “I hoped she would be OK, but I never knew from day to day what to expect. When I went home, I would think about her.”\n\nThankfully, the woman’s story had a “happy ending,” but Gabiniewicz said it made her realize how stressed she has been.\n\nGabiniewicz is among many front-line workers feeling the effects of months of strain and is urging members of the public not to bend public health protocols.\n\nNews this week that a vaccine is on its way means there is a light at the end of the tunnel, but the risk isn’t gone yet.\n\n“I wish that people would really be careful and take it seriously because it’s unpredictable,” she said.\n\nB.C. Premier John Horgan said on Wednesday that when officials announced some vaccine would be in the province by next week, the news allowed for a brief celebration that the end is near.\n\n“But before we get to that place, as in any race when you see the finish line you don’t stop running, you focus, you dig down deep to find that extra resolve to get to the finish line. That’s where we are today.”\n\nChristine Sorensen, president of the B.C. Nurses Union, said she has heard from nurses across the province who are working extended hours, overtime and forgoing holidays.\n\nThe workload for some has been amplified by British Columbia’s surgical renewal program, which seeks to catch up on surgeries delayed at the beginning of the pandemic, she said.\n\n“Nurses struggle with moral distress. They want to help their patients, they want to be able to deliver good-quality health care, but they are also exhausted, showing signs of burnout and need time to rest and recover themselves,” Sorensen said.\n\n“Nurses haven’t really had that time to recover and we’re right back into a second wave.”\n\nA survey of union members in June found that 41 per cent reported severe depression and 60 per cent were emotionally exhausted, while 57 per cent reported high levels of burnout, Sorensen said.\n\nThe pandemic has only highlighted a pre-existing shortage of nurses and a retention problem in the profession, especially in northern B.C., she said. Sorensen pointed to a report by B.C.’s auditor general in 2018 that found more than one-quarter of rural and remote nurse practitioner positions were vacant.\n\nThe union wants to see a more fulsome human resources plan at the provincial level to beef up staffing levels, Sorensen said from Kamloops, B.C.\n\nThe Health Ministry did not respond to a request for comment in time for deadline.\n\nKathleen Ross, president of Doctors of BC, said physicians have also adapted to the added workload. But she emphasized that while health workers are under a lot of pressure, it remains vitally important that those who think they need medical care seek it.\n\n“My fear is that our patients’ responses will be, ‘Oh, I don’t want to bother my doctor because they’re burnt out,’ and let things slide,” said Ross, a family physician in Coquitlam, B.C.\n\n“It’s really critically important that we encourage patients to continue to contact their family doctors, especially if they’ve got a chronic illness, because we do not want underlying conditions left untreated.”\n\nLevi Elijah is taking a break from working as a mental health aide to support fellow workers as chairperson of the Hospital Employees’ Union local at Vancouver General Hospital.\n\nWorking at the hospital every day comes with some worry about contracting the virus, said Elijah, who uses the pronouns they and them.\n\nAfter the initial fear when COVID-19 patients first began arriving at health centres, things slowed down during the summer, but the stresses rose again with the second wave, Elijah said.\n\n“What I have noticed throughout is the ability to cope and our resiliency gets reduced, especially now with the second wave starting and the numbers increasing. We are noticing a higher increase in mental health issues and anxiety,” Elijah said.\n\nMike Old, a spokesman for the union, also said the surgical renewal program and second wave are highlighting staffing challenges.\n\nThe union, which represents about 20,000 long-term care and assisted living workers, supported the government’s move to limit workers to a single site as a disease control measure, but they’re now facing pressure with a second wave and flu season underway, he said.\n\nThe government is training more medical device processing technicians and the union is also working with government to fast-track programs to train more health-care assistants, but it takes time, he said.\n\n“That’s why it’s just so important that people pay attention to public health orders,” Old said.\n\nAmy Smart, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nCoronavirus",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-11 09:30:00-08:00",
    "title": "Health workers report burnout amid second wave, ask public to obey health rules – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/news/health-workers-report-burnout-amid-second-wave-ask-public-to-obey-health-rules/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}