{
    "authors": [
        "Clare Rayment",
        "Local News"
    ],
    "content": "The Terrace DFO is asking for information about several large, filled oil containers that were dumped in a creek in a residential area of Kitimat on Tuesday (Dec. 8). (Department of Fisheries and Oceans photo)\n\nOfficers found five, five-gallon buckets of used oil and fluids dumped into the wetland area\n\nThe Department of Fisheries and Oceans (DFO) in Terrace are asking for any information about a recent dumping of oil containers in Kitimat.\n\nOn Tuesday (Dec. 8), officers at the Terrace DFO were informed by a Kitimat resident of several large containers of oil that have been dumped into a ditched wetland area between Third and Ninth Streets in Kitimat, an area commonly referred to as the Saunders Haul Road area.\n\nWhen the fishery officers arrived, they found five, five-gallon buckets of used motor oil, transmission fluid, and hydraulic fluid dumped into the wetland area. The officers noticed that the water in the area was also severely contaminated with oil residue.\n\nThis wetland area flows towards Kentron Creek and eventually into the Kitimat River. The creek is known Coho spawning and rearing habitat.\n\nThe DFO said this incident is a possible violation of the Fisheries Act, which prohibits the deposit of harmful substances into fish habitat and the Environmental Management Act, which prohibits the introduction of waste and pollution into the environment.\n\nFishery officers are currently working with the District of Kitimat to have the remaining oil residue removed from the area, and the DFO wants to remind people that salmon use many small creeks and wetlands in city areas for spawning and rearing habitat. They said it’s crucial that these areas are protected and not left to become dumping sites for garbage or other waste.\n\nIf anyone has any information about this incident or other potential fish or fish habitat violations, they are asked to please contact the confidential DFO Observe Record Report 24-hour hotline at 1-800-465-4336, email the details to DFO.ORR-ONS.MPO@dfo-mpo.gc.ca, or call the DFO Terrace Detachment at 250-615-5350.\n\n\n\nclare.rayment@northernsentinel.com\n\nLike us on Facebook and follow us on Twitter\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-10 16:40:00-08:00",
    "title": "DFO seeking information about dumping of oil containers in Kitimat creek – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/news/dfo-seeking-information-about-dumping-of-oil-containers-in-kitimat-creek/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}