{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "Const. Alex Dunn, 34, was convicted in the assault of Dalia Kafi at an arrest processing unit in 201\n\nA Calgary police officer has been found guilty of assault causing bodily harm for slamming a woman into a floor face-first while she was in custody.\n\nConst. Alex Dunn, 34, was convicted in the assault of Dalia Kafi at an arrest processing unit in 2017.\n\nShe was handcuffed with her hands behind her back.\n\nDunn said as part of his defence that he thought Kafi had slipped from her cuffs, which is why he slammed her to the floor.\n\nProvincial court Judge Michelle Christopher says she didn’t find that plausible.\n\nThe Calgary Police Service responded to his conviction with a statement that says Dunn’s status as an officer is under review in light of the judge’s ruling and that penalties up to and including dismissal are possible.\n\n“Concerns about this incident were initially raised by a supervisor who witnessed the incident and, after an investigation, we laid the charge against the officer,” the police service said in a release.\n\n“Constable Dunn is also the subject of an internal investigation which will measure his actions against the expectations of our Service and the community. This process will take into account the criminal conviction, as well as the evidence presented in the case and the judge’s reasons for the conviction.”\n\nThe service noted that police officers are trained and expected to de-escalate conflict where possible.\n\n“When they must use force, they are expected to use the least amount of force necessary to safely resolve a situation.”\n\nDunn has been performing police administrative work pending the conclusion of the trial and his lawyer, Cory Wilson, says an appeal is likely.\n\nThe Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nRCMP",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-11 09:40:00-08:00",
    "title": "Calgary police officer guilty of slamming handcuffed woman face-first into floor – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/news/calgary-police-officer-guilty-of-slamming-handcuffed-woman-face-first-into-floor/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}