{
    "authors": [
        "Tom Zytaruk"
    ],
    "content": "Provincial health officer Dr. Bonnie Henry and Health Minister Adrian Dix responded Thursday to what appears to be a growing gulf between themselves and some members of the faith community concerning the messaging coming out of their COVID-19 briefings.\n\nReverend Aaron Dyck, of Gateway Baptist Church, has written an open letter to Dix in which he wrote he feels “compelled as a faith leader to request that people of faith be given the respect that is so overtly presented to every other particular group in this great province.\n\n“The constant condescension by Dr. Henry, purporting to tell us ‘what faith is’ and the endless patronization – as if the government ‘understands’ anything at all about what constitutes faith itself, let alone its practice – has long past worn thin,” the reverend wrote.\n\nHenry’s response to this Thursday was that she thinks people sometimes “take what I say and twist it to make their own ideas about it.\n\n“I have repeatedly said that I have taken advice and have had the privilege of speaking to many faith leaders in the last few months and I appreciate their advice immensely,” she told the Now-Leader.\n\nHenry said she’s learned a “tremendous amount” from faith leaders and has said on occasion what she’s been told about beliefs and about faith. “And I do absolutely believe that we need our faith leaders in crises like these, more than ever before, and I really want to give my thanks and praise to the many, many leaders out there who have sent me their advice, their thinking, their thoughts, and the fact that they do understand we need to take measures to protect those that we care most about in our community right now.”\n\nREAD ALSO: Celebrating Easter in Surrey, during COVID-19\n\nREAD ALSO LETTER: Please, some respect for what you have taken\n\nHenry said she doesn’t purport to know everybody’s ideas about faith, but knows there are “great leaders” in that community who are “stepping up every day and supporting the people they care about in their congregations and doing it in a safe way, and I just want salute them – they have my gratitude, and my admiration.”\n\nIn his letter to Dix, the reverend wrote, “Good sir, I beg you: at the risk of alienating permanently the approximately two million British Columbians who practise religion, at least stop pretending that there is somehow a virtual replacement for thousands of years of physical, incarnational ministry. Tell us this is wrong. Tell us this is not OK. Tell us this is, in fact, an evil, however necessary, and stop with the platitudes. We are in your corner, but cannot for much longer be told this “isn’t a big deal” when it comes to practising a faith more than a dozen times older than the nation of Canada itself.”\n\nWhat faith leaders would appreciate, Dyck told Dix, is “some respect for what you have taken from us, the cost to our people, and an acknowledgment that nothing replaces what we have laid down in order to support you and your efforts.”\n\nThe health minister’s response to the reverend is that the provincial government, since the outset of the pandemic, has listened to and reached out to hundreds of faith leaders across B.C. He admitted his idea of faith is not necessarily shared by everyone, but added that “I can tell Reverend Dyck that at our church, that we’ve lost a lot of loved ones this year, including our minister, and the loss of being able to come together on Sunday has been profound for members of that congregation just as they have been for congregations around B.C.”\n\nDix said he’s “overwhelmingly” inspired by the work done by faith communities of all faiths and all denominations to support people in their communities during this difficult time.\n\n“All I can say is it’s not condescension, it’s gratitude that we feel for the support we get in our community, wherever we find it,” Dix told the Now-Leader. “And for many people, that’s in communities of faith. So, we’re with you and we’re asking you to join us in helping in this period to help heal, heal ourselves physically, and protect ourselves and our good health, and also stay healed and stay better as a community.\n\n“I think Dr. Henry has been unbelievably respectful,” Dix said in her defence. “I so admire her approach when she talks about kindness, which is at the core I think of many faiths’ views as well. She lives that every day and I’m so, so proud to stand with her and I just so disagree with the criticism that came in the letter.”\n\n\n\ntom.zytaruk@surreynowleader.com\n\nLike us on Facebook and follow Tom on Twitter\n\nCoronavirusSurrey",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-11 08:38:00-08:00",
    "title": "Dr. Bonnie Henry denies ‘constant condescension’ to faith community – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/news/dr-bonnie-henry-denies-constant-condescension-to-faith-community/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}