{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "Real results only for those who register with health number\n\nThere have been text message scams trying to get bank information with promises of COVID-19 relief payments and other money-making tricks, and now there are reports of fake text messages claiming to report positive virus test results.\n\nB.C. Health Minister Adrian Dix said Thursday he has heard reports of phone text messages purporting to give coronavirus test results. People awaiting results should be contacted only by public health staff with test results, he said. Positive test results are given priority by contact tracing staff.\n\nThe B.C. Centre for Disease Control does deliver results by text message as well as by voice phone, but users have to register for the text service with their personal health number from a health card or driver’s licence.\n\n“You can also confirm your positive test result and by signing up for the health gateway,” Dix said. “This is a trusted and secure source for your lab result. Instructions to sign up for the health gateway are on the BCCDC website.”\n\nThe gateway also requires registration, using the B.C. government’s mobile B.C. Services Card that can be added to a smartphone. Instructions for setting it up are here.\n\nFor results by phone, the BCCDC has a negative test result line at 1-833-707-2792, open from 8:30 a.m. to 4:30 p.m. daily. B.C. public health has conducted 1.25 million COVID-19 tests since the pandemic began, the vast majority coming back negative. There were 12,958 tests completed in the 24 hours to Dec. 9 alone, with 619 coming back positive.\n\nRELATED: 28 COVID-19 deaths reported Dec. 10, highest so far\n\nRELATED: B.C.’s earliest vaccines go to health care workers\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC legislatureCoronavirus",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-10 16:00:00-08:00",
    "title": "Beware fake text messages claiming COVID-19 test results – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/news/beware-fake-text-messages-claiming-covid-19-test-results/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}