{
    "authors": [
        "Jake Wray",
        "Local News"
    ],
    "content": "News of the exposure comes one day after first exposure announced\n\nThere has been a second COVID-19 exposure at Caledonia Secondary School in Terrace, according to Northern Health. The school is seen here Aug. 28, 2020. (Jake Wray/ Terrace Standard)\n\nThere has been an additional COVID-19 exposure at Caledonia Secondary School in Terrace, just one day after Northern Health initially said there had been an exposure at the school.\n\nThe first exposure at the school was announced Dec. 9 and occurred on Dec. 1 and Dec. 2. The exposure announced today (Dec. 10) occurred on Nov. 30, Dec. 1 and Dec. 2, according to a letter posted on the Coast Mountains School District 82 website.\n\nNorthern Health does not publicly release details about school exposures, such as the number of cases associated with the exposure.\n\nThree other schools in Terrace have had COVID-19 exposures.\n\nThe first exposure took place between Nov. 23 and Nov. 26 at Centennial Christian School. The second exposure was at Suwilaawks Community School between Nov. 27 and Nov. 30. The third exposure happened between Nov. 30 and Dec. 1 at Uplands Elementary School.\n\nThere have been numerous school exposures elsewhere in the Northern Health Authority.\n\nThe Northern Health website outlines how the public health authority responds to school exposures. Public health officials perform contact tracing to determine who came into close contact with the infected person. Close contacts are then advised to self-isolate for 14 days.\n\nPublic health officials will directly contact parents of children who may be involved in a school exposure. Parents are not required to take any action unless directed by public health officials. Parents who are not contacted by public health officials should continue to send their children to school, the Northern Health website states.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-10 15:40:00-08:00",
    "title": "Additional COVID-19 exposure detected at Caledonia Secondary School in Terrace – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/news/additional-covid-19-exposure-detected-at-caledonia-secondary-school-in-terrace/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}