{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "The Raptors said the three individuals are self-isolating away from the rest of the team\n\nA shopper shows off his Toronto Raptors protective mask outside Vaughan Mills Shopping Centre in Vaughan, Ont., Sunday, Nov. 29, 2020. The Toronto Raptors say three members of the organization have tested positive for COVID-19. THE CANADIAN PRESS/ Cole Burston\n\nThe Toronto Raptors say three members of the organization have tested positive for COVID-19.\n\nThe Raptors didn’t disclose who received the positive tests, or whether or not they were players. The news comes five days before the Raptors are scheduled to tip off their three-game pre-season schedule.\n\nA day earlier, coach Nick Nurse had talked about how potentially devastating COVID-19 could be to the team and the season.\n\n“My role is to just constantly be on (players) and be a reminder constantly of our actions and our behaviour, and how impactful it is not only themselves, their families, our team, the organization, there’s lots on the line if you’re not doing the best you can with the COVID-19 protocols,” Nurse said.\n\nThe team said in a release that the positive results came during the NBA-mandated testing period prior to training camp. The league announced last week that 48 players — about nine per cent — had tested positive in pre-camp testing.\n\nOn Sunday, the Portland Trail Blazers shut down their practice facility due to three positive cases within their organization.\n\nThe Raptors said the three individuals are self-isolating away from the rest of the team.\n\nThe Raptors opened training camp last week at their temporary home of Tampa, Fla., with Sunday marking the first day they could train together as a team. They’re playing their “home” games, for at part of the season, at Tampa’s Amalie Arena due to Canada’s travel regulations around the global pandemic.\n\nThey are scheduled to play their first pre-season game Saturday at Charlotte and open the 2020-21 season Dec. 23 against the visiting New Orleans Pelicans.\n\nREAD MORE: Raptors’ unique trait is ‘togetherness,’ Ujiri says Toronto will adapt to Tampa\n\nLori Ewing, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirusNBAraptors",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-07 11:00:00-08:00",
    "title": "Raptors say three members of organization have tested positive for COVID-19 – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/sports/raptors-say-three-members-of-organization-have-tested-positive-for-covid-19/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}