{
    "authors": [
        "Mike Chouinard"
    ],
    "content": "A Comox Valley man who wrote about his experiences with prostate cancer will now be sharing his story with many more men.\n\nGogs Gagnon has learned that his book, Prostate Cancer Strikes: Navigating the Storm, is going to be distributed along with other information by the Prostate Cancer Foundation BC, to new prostate cancer patients throughout the province.\n\nHe was diagnosed a few years, at age 57, only after an MRI pointed to warning signs that he might have cancer. In his case, he was able to treat the disease before it escaped the prostate.\n\nRELATED STORY: Prostate cancer prompts Comox Valley man to write story\n\nRecently, he was contacted by the foundation, and he and his publisher, Granville Island Publishing, worked out a deal to provide Prostate Cancer Foundation BC with a large supply of copies for a reduced cost.\n\n“I really just occurred out of the blue,” he says.\n\nSince its release in 2019, the book has won awards among cancer books and was the number one best-seller among prostate disease books on Amazon Canada. He has received multiple testimonials and was aware it was making in-roads in the health community.\n\n“I knew my book was slowly getting around to different doctors,” he says.\n\nGagnon also spoke with one doctor, an advisor for the foundation, who had read the book.\n\n“He also agreed it was great book from a patient point of view and something that all patients should read,” he says. “Also, the director of the Prostate Cancer Foundation felt the same way.”\n\nThe foundation was hoping to find new material to distribute, as its current book has been around for a while. The catch was they wanted a physician’s perspective too, so the search began. Finally, they found a book called Prostate Cancer: Understand the Disease and Its Treatment, written by a couple of Quebec doctors, which together with Gagnon’s personal story, will make up the new “Reef Knot Kit” for every newly diagnosed man.\n\n“It’s a little package that Prostate Cancer Foundation has put together over the last 20 years,” he says. “They’ve been giving this away free.”\n\nGagnon has been busy since his book was published. He was contacted by the Bayer company to take part in a recent Movember online panel discussion about prostate cancer.\n\n“We just went on Zoom and talked,” he says. “I think there was three or four thousand people watching from, they told me, 60 different countries.”\n\nAt a time when even local support groups can be limited from meeting due to COVID-19 restrictions, the online technology has allowed people like Gagnon and others to gather and share ideas, experiences and information.\n\nAs well, since the book has come out, an online health group called Health Union, which shares information about multiple types of cancer, has him writing articles whenever he wants for their site, ProstateCancer.net.\n\n“I’ve got a few published already, and I’ve got lots of ideas,” he says. “They said I could write as little, or as many articles as I like.”\n\nFor more information, see gogsgagnon.com.\n\n\n\nmike.chouinard@comoxvalleyrecord.com\n\nLike us on Facebook and follow us on Twitter.\n\nBooksCancer",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-06 12:30:00-08:00",
    "title": "B.C. man’s book will be distributed to new prostate cancer patients throughout the province – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/community/b-c-mans-book-will-be-distributed-to-new-prostate-cancer-patients-throughout-the-province/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}