{
    "authors": [],
    "content": "August 13, 1940 – November 21, 2020\n\nMary “Gail” Ellen Sears, aged 80, passed away peacefully in her home of Terrace, BC on Saturday, November 21, 2020 after a lengthy illness.\n\nBest known as Gail to all who loved her, she was born on August 13, 1940 in Nelson, BC to Bernard and Mary Dodd. Her childhood was spent in Whiterock with her parents and three siblings, sister Roberta “Bobbé” and brothers Elza and John “JP”.\n\nIn 1960 her family moved to Terrace and in the following year of 1961 she married her first husband Thomas “Tom” J.S. Turner, with whom she raised three sons.\n\nGail spent many years dedicated to caring for her community through her work and art. Much of her early career was focused on programming self-help and improvement programs for mothers and children at risk, teaching them important life skills and introspection.\n\nFurther to this, she moved into setting up infrastructure for mental health awareness in various communities until they became self- sufficient. She desired for everyone to feel supported in their dreams and encouraged making them a reality.\n\nGardening held a special place in her life, and Gail preferred allowing her flowers to flourish naturally rather than manicuring them. She was known well for her beautiful abundantly overgrown flower pots and yard.\n\nAs the years progressed, her husband Tom fell terminally ill, passing on in 1986. Throughout her life, Gail’s primary passion was painting and art, and when her husband became sick she found her comfort in her watercolours, acrylics, and oils. They became a huge influence in the remaining path of her life, driving her to see the beauty in moments of stillness and the duality of nature.\n\nShe married Francis Sears in 1989 and were separated in 1995.\n\nIn 1996, Gail committed herself wholly to her love of art, selling her home in Terrace and moving to pursue her own dreams at Kwantlen University Art College in Vancouver, graduating in 1999 with her Fine Arts Diploma. While she considered art to be a ‘harsh taskmaster’, there was nothing more in her life that brought her more joy and rejuvenation.\n\nMuch of her late life was spent doing what she loves in a litany of colours, mediums, and canvas sizes. Over the years she had plenty of art exhibitions and was gifted with numerous awards and professional recognition of her skills. But Gail was never one for idle hands, and giving back to her community had become integral to her life.\n\nTo supplement the time between her pieces, she became a wholly encouraging and enthusiastic art teacher, whose deep-seated passion for her work went onward to inspire many adults and children through the years. Her teachings brought a great many people into the fold of her life and love.\n\nSecond only to her art was Gail’s love of her children and grandchildren, with whom she dedicated much of her free time to attend soccer practices, hockey games, and family gatherings.\n\nShe rarely had a negative thing to say and inspired her loved ones to pursue whatever would make them happiest, regardless of the hurdles they may face. Her laughter could be heard clear as a bell over the din of voices at Christmas Eve parties and sport gatherings and was as contagious as the seasonal cold.\n\nEveryone who knew her has been gifted with a piece of sound advice over a hot cup of tea.\n\nShe was preceded in death by her father Bernard, mother Mary, sister Roberta “Bobbé”, brother Elza, and husbands Thomas (1986) and Francis (2018). Her memory will live on in paintings and photographs, and she will be wholly missed and survived by brother John “JP”; three sons and their spouses, Tom (Laura), Stephen (Adrian), Joey; nine grandchildren, eight great-grandchildren, and numerous in- laws, cousins, nieces, and nephews.\n\nAll who loved her dearly will never forget her wit, compassion, charm and unending love for all those she has left behind.\n\nThere is no scheduled service due to current pandemic conditions, though a gathering is in the works for next August 13, 2021.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-21 00:00:00-08:00",
    "title": "Mary Ellen ‘Gail’ Sears (nee Turner) – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/obituaries/mary-ellen-gail-sears-nee-turner/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}