{
    "authors": [
        "Tracy Holmes"
    ],
    "content": "To say Lacey was in rough shape when she was rescued from a Surrey property five years ago would be an understatement.\n\nThe blue-eyed palomino paint yearling was gaunt, with skinny limbs, overgrown hooves and a fear of everything, even a blanket.\n\nFortunately, to say she’s doing alright these days is also an understatement.\n\n“She looks amazing now, it’s hard to believe that it’s the same pony,” said Lacey’s ‘mom,’ Kathy Gilleran.\n\n“She’s the most loving and affectionate and trusting pony you could imagine. That’s kind of what blew my mind with her.”\n\nLacey was among nearly five dozen animals that were seized by the SPCA during a cruelty investigation in August of 2015.\n\nREAD MORE: 57 animals seized in ‘disgusting’ case of neglect\n\nUnfortunately, the seizure was not the first that the BC SPCA has dealt with involving horses, nor was it the last. Most recently, 27 horses were among nearly 100 animals seized by cruelty-investigation officers in late September from a farm near Princeton.\n\nIn each case, extensive – and expensive – efforts are taken to treat, rehabilitate and rehome all of them.\n\nAnd while for some, the story does not have a happy ending despite best efforts, many others, matched with the love and attention every creature deserves, go on to thrive.\n\nIt is these stories of hope, perseverance and survival that inspired Kamloops photographer Leanne Peniuk to do what she could to help.\n\nPeniuk began a quest last spring to capture the “happily-ever-after stories” for a book that would be sold to raise funds for the BC SPCA’s equine division.\n\n“Every horse is given a second chance and I just kind of wanted to showcase that and tell their stories,” Peniuk said.\n\nRescue Me – published in November – is a coffee-table-style book that shares the stories of 25 horses, including Lacey, that have been rescued by the BC SPCA and successfully rehomed.\n\nThe goal, said Peniuk, is threefold, including inspiring people to consider adopting or fostering a rescue horse.\n\n“And if one person drives by a field and sees horses that maybe don’t have water, food or shelter, or maybe don’t look the best … they take action and place a phone call to the SPCA, then it serves its purpose.”\n\nLacey, a palomino paint, is in “amazing” shape now, compared to when she was rescued in August 2015. (Leanne Peniuk photo)\n\nEvery year, the BC SPCA seizes between 50 and 100 horses from unhealthy situations, and in her five years as manager of the BC SPCA’s equine division, Leiki Salumets has seen it all.\n\nSalumets remembers that Lacey was a recent arrival when she started at the society’s Good Shepherd barn in Surrey that August.\n\nKnowing how far Lacey has come offsets the heartache side of the job, she said.\n\nSalumets’ personal experience with a rescue horse is also shared in Rescue Me. That horse, she said, “taught me kind of the most.”\n\n“She’s a big part of the reason I do what I do.”\n\nLacey as she is now, in one of several photographs featured in Rescue Me. (Leanne Peniuk photo)\n\nProceeds from the sale of Rescue Me are earmarked to support the care and rehabilitation of the Princeton rescues.\n\nTypically, the BC SPCA relies “heavily” on donor support to provide the care such animals need, said Salumets, describing the effort behind Rescue Me as “just incredible.”\n\nPublisher Jill Veitch – who grew up in South Surrey but now calls Kelowna home – described it as “heartwarming.”\n\nVeitch said she learned of Peniuk’s quest through social media, and “instantly” messaged Peniuk, “because I have (a rescue horse) and it’s been an absolute life-changer for my family.”\n\n…\n\nThe foreword in Rescue Me is written by self-described rescuer, horseman and philosopher Kevan Garecki.\n\nThe book also include insights from Salumets and a prominent foster caregiver, as well as some information on the process that surrounds an SPCA seizure.\n\nPeniuk said even though the book is finished, there is another chapter yet to come.\n\n“Next year, I want to work… on horses saving humans,” she said.\n\nFor more information or to order Rescue Me ($55) visit www.leannepeniukphotography.ca/rescue-me\n\ntholmes@peacearchnews.com\n\nBCSPCASurreywhite rock",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-28 06:45:00-08:00",
    "title": "BC SPCA’s horse-rescue program offers equine intervention – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/community/bc-spcas-horse-rescue-program-offers-equine-intervention/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}