{
    "authors": [],
    "content": "May 10, 1952 – November 14, 2020\n\nLinda was born May 10, 1952 in Oakville ON to Ronald and Emma King. The King family moved to Terrace in 1957 where Linda grew up and married Brian Turner in 1969. Linda was mother to three sons: Dean, Leslie, and Troy.\n\nLinda was known in the community as a school bus driver, transit driver and drove the handy dart. In 2000 Brian and Linda moved to Vancouver Island. Campbell River became their new home. Linda retrained to become a residential care aide where she worked until her retirement in 2017.\n\nLinda loved to camp, quad, garden, cook and spend time with her family and her friends. In her younger years she snowmobiled and drove stock cars at the Terrace Speedway. Linda has three grandchildren: Brittany, Kolton, and Victoria (Tori). She is great grandma to Kane and Jordan. They were all the loves of her life.\n\nLinda is predeceased by her son Leslie Turner, her mother Emma King and her father Ronald King.\n\nLinda leaves behind her husband Brian of 51 years, her children Dean (Nadine) and Troy (Lesa). Her grandchildren Brittany, Kolton (Megan) and Tori (Terrance) Van Horlick. Her two great grandchildren Kane and Jordan Welder. Her brothers Ken (Cheryl) King and Ron Jr (Anna) King. Her sister Barb King (Bob). Along with her stepmother Ursula King, brothers in law, sisters in law and many nieces and nephews. Linda truly will be missed.\n\nAfter battling a courageous battle with cancer Linda died peacefully surrounded by her family.\n\nA memorial will be held in 2021 in Terrace BC. Donations may be made to the charity of your choice.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-14 00:00:00-08:00",
    "title": "Linda Emma Diane Turner (nee King) – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/obituaries/linda-emma-diane-turner-nee-king/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}