{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "Pair take over from Ed Hervey, who stepped down in October\n\nB.C. Lions general manager Ed Hervey, left, introduces Rick Campbell during a news conference at the team’s training facility in Surrey, B.C., Monday, Dec. 2, 2019. Campbell and football-operations director Neil McEvoy will be taking over as co-GM’s from Hervey, who stepped down from the post in October. THE CANADIAN PRESS/Jonathan Hayward\n\nRick Campbell’s list of job duties grew once again on Monday as the B.C. Lions named the head coach and defensive coordinator a co-general manager.\n\nCampbell will share the role with the club’s longtime football operations director Neil McEvoy.\n\nIt’s a split that Campbell believes will work well.\n\n“I’ve always found on a football team that when the personnel department and the coaches are really working hand in hand, that’s a good thing,” he said on a video call. “And that’s going to naturally happen with the way we’re set up.”\n\nThe duo take over from Ed Hervey, who stepped down from the post for “personal reasons” in October.\n\nThe Lions missed the playoffs last year and responded by dismissing rookie head coach DeVone Claybrooks.\n\n\"Starting today, we're working on getting all of those guys retained that we feel are going to help us.\" From the @TELUS Media Centre | Rick Campbell and Neil McEvoy on GM tandem and process of re-signing some pending free agents 🏈 FULL PRESSER 🎥 | https://t.co/XMcHo9Y4MY pic.twitter.com/CaEJVFfIyO — BC LIONS (@BCLions) December 7, 2020\n\nCampbell was named B.C.’s head coach in December 2019 after six seasons with the Ottawa Redblacks. He has yet to call a play for the Lions, however, because the CFL scrapped plans for an abreviated 2020 season in August due to the COVID-19 pandemic.\n\nCampbell was named the CFL’s top coach in 2015 and the following year led Ottawa to a Grey Cup title.\n\nMcEvoy has served as B.C.’s director of football operations since 2014, and brings a lot of practical experience to the GM position, Cambell said.\n\n“Neil knows this league inside and out, and he knows the B.C. Lions and this community inside and out,” he said. “He understands everything from contracts and negotiation lists and all that type of stuff. It’s not a learning process, it’s something he knows how to do.”\n\nMcEvoy started working for the Lions in ticket sales in 1995, but was a fan of the club long before, starting when he went to games as a kid. That history makes the promotion to general manager extra special.\n\n“Words can’t describe how excited I am for this opportunity and to be in this position,” he said.\n\n“I found out real quick early on in my football career that becoming a professional athlete is probably not going to happen, but there are other jobs with the B.C. Lions and in the professional sports landscape. This is position that I’ve wanted for a long time.”\n\nREAD MORE: Edmonton’s CFL team drops ‘Eskimos’ name, will begin search for new name\n\nCampbell and McEvoy are already at work on preparing for a potential 2021 season, and announced Monday that the eight members of the Lions coaching staff hired in 2020 will return. They include: Jordan Maksymic (offensive co-ordinator); Dan Yanowsky (special teams); Kelly Bates (offensive line); Jason Tucker (receivers); Danny O’Brien (running backs); Leroy Blugh (defensive line); Ryan Phillips (defensive backs) and Travis Brown (linebackers).\n\nLast month, Ryan Rigmaiden was named director of U.S. scouting. Bob Ralph (director of Canadian scouting) and Geroy Simon (director of global scouting and U.S. regional scout in charge of evaluating the top international prospects for the global draft) will both return and work closely with Rigmaiden.\n\nBut there’s still a lot of business ahead for the newly appointed GMs.\n\nA question mark hangs over B.C.’s marquee quarterback Mike Reilly, who has filed a grievance against the Lions, reportedly over the nonpayment of guaranteed money.\n\nClub president Rick LeLacheur told season ticket holders in a virtual town hall last month that he’s confident the former Grey Cup MVP will be back with the Lions when the CFL returns.\n\nThe Lions also have 38 players on expiring contracts, including star wide receiver Bryan Burnham.\n\nCampbell said the club is looking to lock up a number of the players before the league’s free agency period begins on Feb. 9.\n\n“We’re going to work really hard to retain and fit as many guys as we can on our roster,” he said. “That’s going to be the next big step for the Lions.”\n\nGemma Karstens-Smith, The Canadian Press\n\nLike us on Facebook and follow us on Twitter\n\nBC LionsCFLFootball",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-07 20:30:00-08:00",
    "title": "B.C. Lions name coach Rick Campbell, football operations director Neil McEvoy co-GMs – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/sports/b-c-lions-name-coach-rick-campbell-football-operations-director-neil-mcevoy-co-gms/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}