{
    "authors": [
        "Tom Zillich"
    ],
    "content": "Former NHL player has become a game analyst on Sportsnet\n\nKevin Bieksa during his days playing with the Vancouver Canucks. (Photo: commons.wikimedia.org)\n\nFormer NHLer Kevin Bieksa is doing an hour-long “Virtual Hot Stove” organized by Vancouver Canucks Alumni, along with old buddies Ryan Kesler and Alex Burrows.\n\nThe “exclusive” event on Friday, Dec. 11 will be hosted by Sportsnet’s Dan Murphy starting at noon Pacific time, on the Zoom conference app.\n\nBieksa, known as “Juice” in hockey circles, never shied from a microphone during his playing days, and became a star analyst during NHL playoff games over the summer. Kesler and Burrows played with Bieksa on the 2011 Canucks team that went to the Stanley Cup Final.\n\nThe Rogers-presented “virtual hockey experience” on Dec. 11 will have Murphy encouraging the three former teammates “with hockey stories and memorable moments,” according to the event link on sidedooraccess.com.\n\nRegistration is free for the trial-run “Hot Stove,” a first for the Canucks Alumni organization.\n\nEvent host Side Door is described as “a platform matching performers with spaces to create shows anytime, anywhere, including ticketed online shows. Our philosophy is that absolutely anybody should be able to present arts and culture locally in their community in whatever space they have available. Living rooms, back yards, bookstores, galleries, offices, community halls, you get the picture.”\n\n(Story continues below)\n\nVancouver Canucks Alumni recently found a new home at Surrey’s newest rink.\n\nThis fall, close to 30 former NHL players and other alumni association members began scrimmaging weekly at North Surrey Sport & Ice Complex, on Monday nights, in blue-versus-white action.\n\nCanucks Alumni colours, including logo and jerseys through the years, have been painted on walls of the Surrey Knights players’ lounge, thanks to the efforts of the junior hockey team’s owner, John Craighead, an alumni member.\n\nThe year-old Surrey arena now serves as something of a home base for the alumni association, which involves a long list of former Canucks players in addition to former NHLers and other pros, hockey managers, entertainers, media and others.\n\n• READ MORE: Canucks alumni players move their weekly scrimmages to Surrey’s newest hockey rink\n\nCanuckshockeyvancouver canucks",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-28 17:58:00-08:00",
    "title": "Bieksa, Kesler, Burrows to guest on free Canucks Alumni ‘Hot Stove’ on Zoom – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/sports/bieksa-to-guest-on-free-canucks-alumni-hot-stove-on-zoom-app/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}