{
    "authors": [
        "Associated Press",
        "Trending Now"
    ],
    "content": "Vice-President Mike Pence introduced the astronauts Wednesday at the close of his final meeting as chairman of the National Space Council\n\nVice President Mike Pence speaks during the eighth meeting of the National Space Council at the Kennedy Space Center Wednesday, Dec. 9, 2020, in Cape Canaveral , Fla. (AP Photo/John Raoux)\n\nNASA has named the 18 astronauts — half of them women — who will train for its Artemis moon-landing program.\n\nThe first woman and next man on the moon will come from this elite group.\n\nVice-President Mike Pence introduced the astronauts Wednesday at the close of his final meeting as chairman of the National Space Council. The announcement was made at Florida’s Kennedy Space Center, beneath one of only three remaining Saturn V moon rockets from the 1960s and 1970s Apollo program.\n\nPence noted that the last of the 12 men to walk on the moon, the late Apollo 17 commander Gene Cernan, wanted nothing more than to remove “last” from his title. Cernan’s final lunar footsteps were on Dec. 14, 1972.\n\n“He spent the rest of his natural life advocating for America to go back to the moon, and we are going to honour Gene Cernan’s memory,” Pence told the small crowd, seated several feet apart from one another.\n\nFive of the astronauts — the only ones in attendance — walked onto the stage, waving and wearing masks.\n\nNASA Administrator Jim Bridenstine stressed there would be more astronauts joining the group. NASA has 47 active astronauts.\n\nThe space agency is aiming for a moon landing by 2024, although the chances of that happening are growing increasingly dim. The upcoming change in administration also adds uncertainty.\n\nHalf of the NASA astronauts have spaceflight experience. Two are at the International Space Station right now: Kate Rubins and Victor Glover.\n\nThe two astronauts who performed the world’s first all-female spacewalk last year made the cut: Christina Koch and Jessica Meir.\n\nIt’s a fairly young group, with most in their 30s or 40s. The oldest is 55, the youngest 32. Only two — Joe Acaba and Stephanie Wilson — flew on NASA’s old space shuttles.\n\nThe other experienced members on the list include Kjell Lindgren, Anne McClain and Scott Tingle, all former space station residents.\n\nAmong those yet to rocket into space: Kayla Barron, Raja Chari, Matthew Dominick, Woody Hoburg, Jonny Kim, Nicole Mann, Jasmin Moghbeli, Frank Rubio and Jessica Watkins.\n\nMarcia Dunn, The Associated Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-09 13:50:00-08:00",
    "title": "1st woman, next man on moon will come from these NASA 18 – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/trending-now/1st-woman-next-man-on-moon-will-come-from-these-nasa-18/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}