{
    "authors": [],
    "content": "Toby Tannas\n\nPhotos: Lia Crowe\n\nIf you want to maintain passion for your life’s work, make it a sexy project. That’s the advice from Kelowna’s Joe Mahovlich, founder of The Vaults. Joe is tapping into the high-end storage-condominium market with a concept that’s been done before—but never quite like this.\n\nHis concept is a mesh between storage and lifestyle. Each bay in The Vaults—located in Kelowna at the Airport Business Park—has space for cars, boats, RVs and also a mezzanine level for an office, entertaining or just relaxing among your toys. What sets The Vaults apart from the competition, according to Joe, is the unprecedented level of security and style.\n\n“A fence doesn’t offer enough protection or privacy for this type of project. At The Vaults, the building ‘is’ the fence. Instead of a six-foot fence, we’ve got a 28-foot concrete wall as a barrier.”\n\nWith clients storing their prized possessions inside The Vaults, Joe knew security had to be at the top of the necessity list.\n\n“We’ve got a concrete and steel building with a giant, fully-enclosed overhead door. It opens with a coded transmitter and closes behind you. You can drive to your unit with complete privacy and anonymity.”\n\nAlmost as important to Joe is the design and style of the project. The Vaults caters to an exclusive clientele and the exterior needed to reflect that.\n\n“When you pull up to one of our buildings at night, they’re dark grey with black and all you see is this glowing 20-foot glass overhead door. It just looks amazing.”\n\nIf you’re thinking James Bond, so was Joe when he put pen to paper to design the first and now flagship location in Calgary.\n\n“I love the spy movies,” he chuckles. “There’s always a common thread. They pull into a warehouse where they have their cars, but also an area where they can lounge. There’s a bar to have a drink and a kitchenette to entertain.”\n\nEach private bay at The Vaults is completely customizable. Ranging from 1,600 to about 5,000 square feet, the sky is the limit when it comes to design. It’s not just car collectors that purchase units. You’ll find everything from art to scotch collections in The Vaults.\n\n“These are spectacular units. We’re very intimately involved with the design of the bays. It turns into such a deep relationship with our clients. We’ve made a lot of great friends in the process and now we have great ambassadors.”\n\nSatisfied customers are what you need when your plans are as grand as Joe’s. With two locations already up, running and sold out, he’s ready to take The Vaults across the country and the continent.\n\n“We would like to get to the point where we’re doing three to five starts a year. That’s very achievable as long as we set how the construction is being done.”\n\nJoe describes Calgary as the working model. It’s got the 46-bay flagship location, complete with clubhouse and wash facility, in the north. A second location in south Calgary is coming soon. For Joe, location is just as important to the business model as security and design.\n\n“Our goal is always to be 20 minutes to the downtown core. We never go on the outskirts of a city, we want to be in an architecturally controlled newer area so that our building, that looks great, is around other buildings that look really good.”\n\nThe next project will bring Joe back to his roots. Born and raised in Vernon, he’s excited about breaking ground on The Vaults Vernon before the end of the year.\n\n“The Kelowna project sold out in 14 months, so we know there’s a demand here.”\n\nThe Vernon project incorporates a new business avenue. The six-acre site in the heart of the city will include a second set of buildings called The Commerce. Same design, same quality, same dimensions as The Vaults, but designed specifically for small business.\n\n“There is a demand for smaller bays. Warehouse space is often out of reach for smaller businesses—either financially or the space is just too big. This really fills a gap in the market,” says Joe. “If we want to see our cities evolve, you need businesses to be able to come in and support the growth.”\n\nJoe’s family now calls Kelowna home. Each of his three children plays hockey; they ski and golf and fully embrace the Okanagan lifestyle. Joe has embraced his creative side with The Vaults, constantly working to make a great concept even better.\n\n“We’re still tweaking, still learning. After 65 units, we’re making it way more efficient from a building standpoint.”\n\nAs he looks back at the past few years, it can be a bit heady for Joe: a university science major turned developer turned visionary. What started as a search for an office/storage space for his own use turned into a career and perhaps more importantly a passion project.\n\n“I’m really excited to build these things because each one is different. We’re doing it different and better than anyone else in North America,” he says with pride. “It’s a very sexy project.”\n\nThere’s that word again! It definitely gets your attention, just like The Vaults themselves: the mysterious buildings with the glowing doors that leave you longing to be a part of the beautiful world locked away inside.\n\nFor more information on The Vaults visit thevaults.ca.\n\nLike us on Facebook and follow us on Twitter.\n\ncars",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-19 16:50:00-08:00",
    "title": "The Vaults: For your eyes only – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/life/the-vaults-for-your-eyes-only/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}