{
    "authors": [],
    "content": "Northcoast Home Medical Equipment brings everything from first-aid equipment to wheelchairs and lifts to residents of Northwest BC.\n\nYou’ve completed Step One: you know you need medical equipment.\n\nMaybe your doctor prescribed a walker to steady your stride, or a custom brace to help you return to sports. Maybe the brakes are broken on your wheelchair or your stair lift stopped working, and you’d like to get it repaired.\n\nYou know you need it; what’s stopping you from getting it?\n\nI don’t know where to get the medical equipment I need\n\n“We have everything from first-aid supplies to elevators!” says Tracy Kinney, store manager at Northcoast Home Medical Equipment. If you’ve been prescribed a unique piece of medical equipment and you don’t know where to get it, call Northcoast Home Medical Equipment — chances are they have it. “We have certified compression fitters, mastectomy fitters, and bracing fitters,” Kinney says.\n\nNorthcoast Home Medical Equipment has a wide range of equipment, including:\n\nMobility aids such as wheelchairs and walkers, including pediatric options\n\nLifting devices\n\nHome safety equipment like security rails and bathroom assistants\n\nDisposable products such as first-aid, incontinence and ostomy\n\nSupport pillows, therapeutic mattresses and aids to daily living\n\nCall 1-866-638-1301 to find out how they can help you.\n\nMy remote community doesn’t have medical equipment services\n\nNorthcoast Home Medical Equipment serves the Northwest Northern Health Region from their home base in Terrace. They make regular delivery trips to Smithers and Kitimat, and can arrange delivery to smaller communities too. “It’s a free service that we provide. We bring your equipment right to you,” Kinney says.\n\nThey also provide free in-home assessments for those who can’t make it to the store and will install and service equipment so it’s ready to use.\n\nAll staff follow strict COVID-19 protocols to keep you and your home safe.\n\nMy medical equipment is too expensive\n\nNorthcoast Home Medical Equipment works closely with healthcare professionals to help their clients access the supports they need. They’re on contract with many funding agencies including the Ministry of Social Development, WorkSafeBC, ICBC and the Provincial Health Authority, so if you qualify for financial assistance they can help you access it. “We can provide information to help our clients understand what is required by each funder to request approval, and complete the funding paperwork to help obtain the approval,” Kinney says.\n\nIf funding programs aren’t available to you, Northcoast Home Medical Equipment offers financing and monthly payment plans. They also have a team of certified repair technicians to repair and service your existing equipment to keep it running at optimal condition.\n\nCall Northcoast Home Medical Equipment at 866-638-1301 to see how they can help you with equipment purchases and rentals, or email northcoast@nchme.ca. Visit the store at 4712 Keith Ave. in Terrace, or give them a call to find out when they’ll be visiting your community.\n\nHealth and wellnessHealthcare and Medicine",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-23 06:00:00-08:00",
    "title": "No excuses! If you need medical equipment, they’ll help you get it – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/marketplace/no-excuses-if-you-need-medical-equipment-theyll-help-you-get-it/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}