{
    "authors": [
        "Carleen Nugent"
    ],
    "content": "The entrance to the new Sunshine Inn Terrace!\n\nWhile COVID might be putting a pause on our Caribbean getaways, it’s not stopping us from planning our own escape close to home!\n\nWith the grand opening of Sunshine Inn Terrace planning the perfect trip has become that much easier for Terrace locals and visitors alike.\n\nThe modern hotel opened its doors to the public in early October and their updated and upgraded amenities are making the stay enjoyable for everyone!\n\n“Our hotel is here for anyone coming to town – families and singles, young and young-at-heart, and whether you’re staying for one night or a year, we’ve got you covered,” notes Sunshine Inn Kim Tran. “We’re giving people the convenience of being right downtown, with the comfort they need for a great stay. It’s our mission to make sure every guest has a good night’s sleep!”\n\nTheir cozy beds make for a perfect nights sleep.\n\nWhether you’re welcoming guests to Terrace for the holidays, or looking for short-term accommodation options, here are three reasons to book your stay with Sunshine Inn Terrace:\n\nEnvironmentally conscious Located near Skeema River and surrounded by provincial parks and nature, Tran and his team recognize the importance of limiting their environmental impact. Their strong eco-friendly commitment includes LED lights, virtually paperless operation – they’ve even replaced paper ‘Do Not Disturb’ signs with LED light displays – low-energy heating and cooling systems, and non-toxic materials. Even before they broke ground, the building engineer prioritized minimal energy consumption, so the green initiative was alive and well even in the blue prints! Convenient location Conveniently located in the heart of downtown Terrace, with easy access from the Trans Canada Highway, shopping dining and all the necessities are close at hand. Short- and long-term rentals Whether you’re on the hunt for nightly, weekly or monthly accommodation, Sunshine Inn has you covered! With 107 rooms and 11 apartment suites, there’s plenty to choose from. Room styles vary and include the Standard Room, the Deluxe Kitchenette, the Premier Executive Studio, the Deluxe Apartments, and coming soon are the Premier Penthouse Apartments.\n\nComplimentary parking is included in your visit.\n\nCOVID safe protocols include physical distancing between hotel guests and staff, and extra cleaning and sanitizing procedures across the entire property.\n\nTake advantage of Sunshine Terrace Inn’s quiet and cozy rooms, perfect for your next mountain adventure! Reserve a room online, via email, or by making a quick call for your booking needs today!",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-16 06:00:00-08:00",
    "title": "Terrace’s newest hotel and suites welcomes guests downtown! – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/marketplace/terraces-newest-hotel-and-suites-welcomes-guests-downtown/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}