{
    "authors": [],
    "content": "At Coastal GasLink, we recognize that water is a highly valued resource and how we navigate water crossings matters to local and Indigenous communities. The project’s 670-kilometre route crosses several bodies of water and we approach each one with the highest environmental and safety standards to prevent adverse impacts on the environment.\n\n“We are held to what I would consider a platinum standard. Health and safety and environment are our two major targets out here,” says Colby Smith, an Assistant Construction Manager working at the Kitimat River crossing, where pipe was successfully installed this summer.\n\nOur approach to water body crossings is a multi-faceted process that involves rigorous evaluation of the best available crossing methods to ensure each water body and habitat receives the appropriate protections. Prior to construction at any water crossing, environmental assessments take place including studies of the aquatic environment – such as water flow, bank stability, the quantity and quality of fish habitat, wildlife and vegetation. Information gathered through the assessments, along with regulatory requirements and constructability allows for the selection of the most appropriate pipeline installation method.\n\nTwo of the methods Coastal GasLink uses along our route are called Direct Pipe Installation (DPI) and Horizontal Directional Drilling (HDD) which are both forms of trenchless crossings.\n\nHorizontal Directional Drilling (HDD) is one of the ways Coastal GasLink safely crosses water bodies by going deep beneath it.\n\nHDD uses a specialized drilling rig to bore a path under the water body, progressively enlarging the bore hole until the pipeline is pulled through to the other side. DPI is a recent addition to the trenchless crossing industry and involves both digging the tunnel and installing the pipe at the same time which minimizes disruption to instream activities, the surrounding environment, fish habitat and the riverbank.\n\nWe recognize the importance of fish and fish habitat to the communities upstream and downstream of where we conduct water crossings. That’s why we have implemented stringent measures such as avoiding disturbance of important habitats during key times, such as spawning.\n\nDuring construction, we monitor rivers and streams to make sure our plans are effective. This means monitoring both the stream and the surrounding riverbanks to understand if the measures we’ve put in place to reduce impacts are working, and to determine if changes are needed. If the monitoring shows any unusual results, we’ll address it immediately. This could mean installing erosion/sediment control barriers; temporarily stopping work until the water quality returns to acceptable levels; or re-scheduling work until conditions are more favourable.\n\n“It’s about doing things safe, with quality and being really proud of it when you’re done. Something you can talk about with your friends and colleagues that we did it right,” says M.J. Zimmerman, Construction Manager.\n\nVisit CoastalGasLink.com to learn more about water crossings how Coastal GasLink is taking extreme care to protect our rivers and streams.\n\nenergy sector",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-02 06:00:00-08:00",
    "title": "How Coastal GasLink protects the environment when crossing waterways – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/marketplace/how-coastal-gaslink-protects-the-environment-when-crossing-waterways/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}