{
    "authors": [],
    "content": "Often asked about the best method for repaying debts, many find the Snowball Method offers motivation from seeing smaller success accumulate, says Leah Drewcock, senior vice-president, MNP Ltd.\n\nRepaying smallest debt first, then moving on to the next one can build motivation and momentum\n\nFall is in the air; the weather is starting to get colder and the next thing we know we’ll be throwing snowballs again.\n\nAlong with winter will come holiday shopping and increased heating bills. Winter may not be a welcome change for many Canadians who are still trying to recover from the debts they’ve acquired during COVID. For those of us in the Insolvency field, we are often asked what the best method is for repaying debts. The thought of winter and debt brings to mind the Snowball Method of debt repayment.\n\nSNOWBALL METHOD*\n\nThe snowball method of debt repayment is essentially paying the smallest debts first to build momentum towards paying all debts in full. Here are basic steps to the snowball method of debt repayment:\n\n1. Before you set a repayment plan you first need to look closely at your budget.\n\nWhat is your net monthly income?\n\nWhat are your average monthly expenses?\n\nMany people are already tracking their income and expenses on a monthly basis, but it is also important to allow for irregular or annual expenses by averaging them over a year to get an estimated monthly cost.\n\nWe recommend including savings as an expense item, to allow for yearly and unexpected expenses like vehicle repairs or annual dental appointments. Having funds available for when an emergency comes up or for an expense that isn’t there every month, will help you stay on track with your repayment plan.\n\nIf you need help figuring out your income and expenses you can check out the MNP Budget Tracker Spreadsheet to get some assistance in preparing your budget.\n\n2. Make a list of your debts, from smallest to biggest balance owing\n\nWho do you owe (the creditor)?\n\nHow much to you owe?\n\nNow that you have the details of your budget and have summarized your debts you’re ready to work on your plan to “Fall out of Debt.\n\n3. Every month:\n\nPay your living expenses, put the budgeted amount in savings, and continue to make minimum payments on all your debts, except the debt with the smallest balance!\n\nPut the remaining balance in your budget towards paying down the smallest debt.\n\nRinse and repeat – keep paying the smallest debt until it is paid in full, then move on to the next smallest debt and so on until all your debts are paid in full.\n\nAs the snowball (debt repayment) gains momentum downhill you’ll feel the positive energy that comes from seeing the results (your debt volume is shrinking)!\n\n4. Check-in:\n\nIt is important to check in with your plan. If your snowball isn’t gaining momentum and the debt repayment plan isn’t working for you, it is important to recognize that you’re struggling and there are other ways to get your finances back on track.\n\nYou are not alone, there are professionals who can help. Many people have found relief through MNP Ltd. – Licensed Insolvency Trustees who will take the time to understand your current situation and provide personalized solutions to meet your exact needs.\n\n*A study at the Boston University found this method has a great success rate. It may not make sense from a financial point of view, but the psychology of small wins helps build the momentum, motivation and consistency required to keep moving forward.\n\nFinances",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-10-05 06:00:00-08:00",
    "title": "‘Fall’ out of debt using the Snowball Method – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/marketplace/fall-out-of-debt-using-the-snowball-method/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}