{
    "authors": [
        "Barry Coulter"
    ],
    "content": "48 % of players are 19 or older, which means nearly half of the BCHL’s players are ineligible to practice with their team\n\nThe British Columbia Hockey League (BCHL) announced late Monday, Dec. 7, that the regular season will now be delayed until the New Year.\n\nThe fledging season got underway earlier this fall with some exhibition play among teams, including the Cranbrook Bucks, who are in their inaugural year.\n\nHowever, pandemic conditions meant the cancellation of the balance of pre-season play, and the postponement of the start of the regular season itself.\n\n“The recent order that was extended [Monday] by the Provincial Health Office (PHO) means that, as of now, BCHL players age 19 or older are not permitted to engage in any team activities, while players 18 or younger may participate in team activities under Phase 2 of viaSPORT BC’s return to play,” the BCHL said in a press release.\n\n“As a result, the league has decided to delay the start of their 2020-21 regular season to the new year.”\n\nGraham Fraser, Chairman of the Board of Governors of the BCHL, said for the past nine months the league had “done everything possible to do right by our players and the public.”\n\n“Under our PHO-approved COVID-19 Safety Plan, we successfully trained and played exhibition games from September to November, completing 90 games without a transmission, but the current restrictions will not allow us to start our regular season in December.”\n\n“We remain committed to exploring every option available to us to start our season safely and as soon as possible, including presenting the concept of a BCHL hub. We look forward to getting things going again in January with all of our players back on the ice.”\n\nAlmost 50 per cent of the league is currently made up of players 19 or older, which means nearly half of the BCHL’s players are currently ineligible to practice with their team under the order.\n\nThe BCHL has adhered to all travel restrictions imposed by the PHO and none of its players are traveling anywhere outside of their home arena. Despite that, the PHO has restricted 19 and 20-year-old players from practicing with their teams.\n\n“We are disappointed that our 19 and 20-year-old players are not able to join their teammates in on-ice activities,” said BCHL Commissioner Chris Hebb. “We are working diligently with BC Hockey, viaSPORT BC and the PHO to get our older players on the ice, but at the moment we must follow the PHO’s order as written.”\n\n“While the current restrictions only directly affect athletes age 19 and up, there are unintended consequences for our younger players as well,” said BCHL Executive Director Steven Cocker. “Although they are still allowed on the ice, the fact remains that half of their teammates are not, which essentially means their teams and the league are forced to pause operations until restrictions are lifted.”\n\nIf current restrictions are extended beyond midnight on Jan. 8, the league will come together and make a decision on when play can resume.\n\nThe BCHL consists of 18 teams throughout B.C., and one in Washington State. That team, the Wenatchee Wild, opted out of the whole season.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-08 09:10:00-08:00",
    "title": "BCHL postpones regular season until new year – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/sports/bchl-postpones-regular-season-until-new-year/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}