{
    "authors": [],
    "content": "-Kamloops This Week\n\nIndigenous hockey legend Fred Sasakamoose died on Tuesday (Nov. 24) in a Saskatchewan hospital from complications of COVID-19.\n\nHe was 86.\n\n“Fred Sasakamoose survived the residential school system, became the National Hockey League’s first-ever Indigenous player and inspired many with his stories of suffering and success,” Prime Minister Justin Trudeau said in a tribute on Twitter. “He leaves behind an incredible legacy. My condolences to all who are mourning his passing today.”\n\nSasakamoose, from Ahtahkakoop Cree Nation in Saskatchewan, played 11 games for the Chicago Blackhawks during the 1953-1954 season and, after bouncing around the minor leagues for a few seasons, landed with the Kamloops Chiefs in 1956.\n\nSasakamoose, who played in Kamloops until 1960, went on to become chief of his First Nation and served his community for decades.\n\n“Thank you for being a leader and paving the way for all of us Indigenous hockey players and helping us dream big,” former Calgary Flames’ star Theoren Fleury wrote on Twitter.\n\nSasakamoose worked for the last five decades to give Indigenous youth opportunities to participate in sports, helping establish the Northern Indian Hockey League, the Saskatchewan Indian Summer and Winter Games, Saskatoon’s All Nations Hockey School and a hockey camp.\n\nHe was among 125 appointees to the Order of Canada in 2017.\n\nSolaine Sasakamoose, Fred’s great-grand niece, played last season for the TRU WolfPack women’s soccer team. Members of the Sasakamoose family reside in the Kamloops area.\n\nREAD MORE: Argentine soccer great Diego Maradona dies at 60\n\nREAD MORE: Former KIJHL president dies after cancer battle\n\nLike us on Facebook and follow us on Twitter.\n\nCoronavirushockey",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-26 11:34:00-08:00",
    "title": "B.C. Indigenous hockey legend dies following COVID-19 complications – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/sports/b-c-indigenous-hockey-legend-dies-following-covid-19-complications/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}