{
    "authors": [
        "Twila Amato",
        "Trending Now"
    ],
    "content": "Victoria and Kelowna top the list of most generous Canadian cities in 2020\n\nFundraising platform GoFundMe has released its Year in Giving Report, naming Victoria and Kelowna as two of the most generous cities in Canada throughout 2020.\n\nThe list is topped by Victoria, followed by Kelowna, Kingston, Ont., Saskatoon, Sask., and Calgary, Alta.. Last year, Kelowna earned third place.\n\nSince GoFundMe launched in Canada in 2010, over half a billion dollars have been raised on the platform. According to GoFundMe, one in seven Canadians give generously on the platform.\n\n“Kelowna has moved up in the ranking from last year to the second most generous city in Canada with more donations per capita than most other cities in Canada,” GoFundMe said in a statement.\n\n“Kelowna continues to prove its generosity from everesting Knox Mountain to supporting migrant workers.”\n\nDespite a difficult year, GoFundMe said Canadians still managed to help their neighbours and support important causes throughout 2020.\n\nThe most notable fundraising campaigns in Canada include Indigenous allies fundraising to protest against the Coastal GasLink pipeline through Wet’suwet’en territory, a fundraiser for a Vancouver baby’s gene therapy treatment, and a fundraiser for the Sheikh family after their father Kashif drowned in Kelowna on Father’s Day.\n\nREAD: Fundraiser launched for expatriated migrant workers fired from West Kelowna farm\n\nTwila Amato\n\nVideo journalist, Black Press Okanagan\n\nEmail me at twila.amato@blackpress.ca\n\nFollow me on Twitter\n\nBest of 2020",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-08 09:00:00-08:00",
    "title": "Victoria, Kelowna top most generous cities in Canada: GoFundMe – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/trending-now/victoria-kelowna-top-most-generous-cities-in-canada-gofundme/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}