{
    "authors": [
        "Associated Press",
        "Canada"
    ],
    "content": "Maradona struggled with substance use and doping accusations throughout his career\n\nFILE - In this March 26, 2006 file photo, former soccer player Diego Maradona smokes a cigar as he watches Argentina’s first division soccer match between Boca Juniors and River Plate in Buenos Aires, Argentina. The Argentine soccer great who was among the best players ever and who led his country to the 1986 World Cup title before later struggling with cocaine use and obesity, died from a heart attack on Wednesday, Nov. 25, 2020, at his home in Buenos Aires. He was 60. (AP Photo/Natacha Pisarenko, File)\n\nDiego Maradona, the Argentine soccer great who scored the “Hand of God” goal in 1986 and led his country to that year’s World Cup title before later struggling with cocaine use and obesity, has died. He was 60.\n\nA person close to Maradona said he died Wednesday of a heart attack. The person spoke to The Associated Press on the condition of anonymity because he was not authorized to speak publicly.\n\nMaradona died two weeks after being released from a Buenos Aires hospital following brain surgery.\n\nThe office of Argentina’s president said it will decree three days of national mourning, and the Argentine soccer association expressed its sorrow on Twitter.\n\nOne of the most famous moments in the history of the sport, the “Hand of God” goal, came when Maradona punched the ball into England’s net during the 1986 World Cup quarterfinals. He also captivated fans around the world over a two-decade career with a bewitching style of play that was all his own.\n\nAlthough his reputation was tarnished by his addictions and an ill-fated spell in charge of the national team, he remained idolized in soccer-mad Argentina as the “Pibe de Oro” or “Golden Boy.”\n\n“You took us to the top of the world,” Argentine President Alfredo Fernández said on social media. “You made us incredibly happy. You were the greatest of all.”\n\nThe No. 10 he wore on his jersey became synonymous with him, as it also had with Pele, the Brazilian great with whom Maradona was regularly paired as the best of all time.\n\nThe Brazilian said in a statement he had lost “a dear friend.”\n\n“There is much more to say, but for now may God give his family strength,” Pelé said. “One day, I hope, we will play soccer together in the sky.”\n\nBold, fast and utterly unpredictable, Maradona was a master of attack, juggling the ball easily from one foot to the other as he raced upfield. Dodging and weaving with his low centre of gravity, he shrugged off countless rivals and often scored with a devastating left foot, his most powerful weapon.\n\n“Everything he was thinking in his head, he made it happen with his feet,” said Salvatore Bagni, who played with Maradona at Italian club Napoli.\n\nA ballooning waistline slowed Maradona’s explosive speed later in his career and by 1991 he was snared in his first doping scandal when he admitted to a cocaine habit that haunted him until he retired in 1997, at 37.\n\nHospitalized near death in 2000 and again in ’04 for heart problems blamed on cocaine, he later said he overcame the drug problem. Cocaine, he once said famously, had proven to be his “toughest rival.”\n\nBut more health problems followed, despite a 2005 gastric bypass that greatly trimmed his weight. Maradona was hospitalized in early 2007 for acute hepatitis that his doctor blamed on excessive drinking and eating.\n\nHe made an unlikely return to the national team in 2008 when he was appointed Argentina coach, but after a quarterfinal exit at the 2010 World Cup in South Africa, he was ousted — ultimately picking up another coaching job with the United Arab Emirates club Al Wasl.\n\nMaradona was the fifth of eight children who grew up in a poor, gritty barrio on the Buenos Aires outskirts where he played a kind of dirt-patch soccer that launched many Argentines to international stardom.\n\nNone of them approached Maradona’s fame. In 2001, FIFA named Maradona one of the two greatest in the sport’s history, alongside Pele.\n\n“Maradona inspires us,” said then-Argentina striker Carlos Tevez, explaining his country’s everyman fascination with Maradona at the 2006 World Cup in Germany. “He’s our idol, and an idol for the people.”\n\nMaradona reaped titles at home and abroad, playing in the early 1980s for Argentinos Juniors and Boca Juniors before moving on to Spanish and Italian clubs. His crowning achievement came at the 1986 World Cup, captaining Argentina in its 3-2 win over West Germany in the final and decisive in a 2-1 victory against England in a feisty quarterfinal match.\n\nOver the protests of England goalkeeper Peter Shilton, the referee let stand a goal by Maradona in which, as he admitted years later, he intentionally hit the ball with his hand in “a bit of mischief.”\n\nBut Maradona’s impact wouldn’t be confined to cheating. Four minutes later, he spectacularly weaved past four opponents from midfield to beat Shilton for what FIFA later declared the greatest goal in World Cup history.\n\nMany Argentines saw the match as revenge for their country’s loss to Britain in the 1982 war over the Falkland Islands, which Argentines still claim as “Las Malvinas.”\n\n“It was our way of recovering ‘Las Malvinas,’” Maradona wrote in his 2000 autobiography “I am Diego.”\n\n“It was more than trying to win a game. We said the game had nothing to do with the war. But we knew that Argentines had died there, that they had killed them like birds. And this was our revenge. It was something bigger than us: We were defending our flag.”\n\nIt also was vindication for Maradona, who in what he later called “the greatest tragedy” of his career was cut from the squad of the 1978 World Cup — which Argentina won at home — because he was only 17.\n\nMaradona said he was given a soccer ball soon after he could run.\n\n“I was 3 years old and I slept hugging that ball all night,” he said.\n\nAt 10, Maradona gained fame by performing at halftime of professional matches, wowing crowds by keeping the ball airborne for minutes with his feet, chest and head. He also made his playing debut with the Argentinos Juniors youth team, leading a squad of mostly 14-year-olds through 136 unbeaten matches.\n\n“To see him play was pure bliss, true stardom,” teammate Carlos Beltran said.\n\nMaradona played from 1976-81 for first division club Argentinos Juniors, then went to Boca Juniors for a year before heading to Barcelona for a world-record $8 million.\n\nIn 1984, Barcelona sold him to Napoli, in Italy. He remade its fortunes almost single-handedly, taking it to the 1987 Italian league championship for its first title in 60 years.\n\nA year after losing the 1990 World Cup final to West Germany, Maradona moved to Spanish club Sevilla, but his career was on the decline. He played five matches at Argentine club Newell’s Old Boys in 1994 before returning to Boca from 1995-97 — his final club and closest to his heart.\n\nDrug problems overshadowed his final playing years.\n\nMaradona failed a doping test in 1991 and was banned for 15 months, acknowledging his longtime cocaine addiction. He failed another doping test for stimulants and was thrown out of the 1994 World Cup in the United States.\n\nIn retirement, Maradona frequented Boca matches as a raucous one-man cheering section and took part in worldwide charity, sporting and exhibition events. But the already stocky forward quickly gained weight and was clearly short of breath as he huffed through friendly matches.\n\nIn 2000, in what doctors said was a brush with death, he was hospitalized in the Uruguayan resort of Punta del Este with a heart that doctors said was pumping at less than half its capacity. Blood and urine samples turned up traces of cocaine.\n\nAfter another emergency hospitalization in 2004, Maradona was counselled for drug abuse and in September of that year travelled to Cuba for treatment at Havana’s Center for Mental Health. There he was visited by his friend, Cuban President Fidel Castro.\n\nIn Cuba, Maradona took to playing golf and smoking cigars. He frequently praised Castro and Argentine-born revolutionary “Che” Guevara, who fought with Castro in the Cuban revolution — even sporting a tattoo of Guevara on his right arm.\n\nMaradona said he got clean from drugs there and started a new chapter.\n\nIn 2005, he underwent gastric bypass in Colombia, shedding nearly 50 kilograms (more than 100 pounds) before appearing as host of a wildly popular Argentine television talk show. On “10’s Night,” Maradona headed around a ball with Pele, interviewed boxer Mike Tyson and Hollywood celebrities, and taped a lengthy conversation with Castro in Cuba.\n\nIn retirement, Maradona also became more outspoken. He sniped frequently at former coaches, players — including Pele — and the pope. He joined a left-wing protest train outside the Summit of the Americas in 2005, standing alongside Venezuelan President Hugo Chavez to denounce the presence of then-President George W. Bush.\n\nHis outsider status made it all the more surprising when he was chosen as Argentina coach following Alfio Basile’s resignation.\n\nHe won his first three matches but his tactics, selection and attention to detail were all questioned after a 6-1 loss to Bolivia in World Cup qualifying equaled Argentina’s worst-ever margin of defeat.\n\nVictor Hugo Morales, Argentina’s most popular soccer broadcaster, said Maradona will ultimately be remembered for a thrilling style of play that has never been duplicated.\n\n“He has been one of the great artists of my time. Like great masters of music and painting, he has defied our intellect and enriched the human spirit,” Morales said. “Nobody has thrilled me more and left me in such awe as Diego.”\n\n___\n\nDebora Rey, The Associated Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nsoccer",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-25 09:30:00-08:00",
    "title": "Argentine soccer great Diego Maradona dies at 60 – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/sports/argentine-soccer-great-diego-maradona-dies-at-60/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}