{
    "authors": [
        "Ben Bogstie",
        "Local Journalism Initiative Reporter",
        "Local News"
    ],
    "content": "Traffic controllers Hayley Stevens (left) and Hector Blackwater (right) have been recognized by drivers for their friendly waves, smiles and dance moves while working south of Terrace. (Ben Bogstie/Terrace Standard)\n\nA pair of exuberant traffic flaggers are drawing attention on Terrace social media.\n\n“They absolutely make my day every time I drive by them,” commented Katherine Rezanson on the Terrace Community Bulletin Facebook page.\n\n“Nothing but respect for those two. I’d never be able to handle that job and rain or shine they show up and stay happy and positive all day. I don’t think they know how tough they really are. I hope their boss knows how good they are and takes care of them,” Brian Kendel commented.\n\nColin Chase McKay added “best flaggers ever! One would hope to achieve that level of character on their job-site.”\n\nThose are just a few of the many positive online comments from people driving past traffic controllers Hector Blackwater and Hayley Stevens at the Gruchy’s Beach turn off south of Terrace.\n\nThe couple’s waves, smiles and dance moves have not gone unnoticed by drivers.\n\n“I started waving at people just as one of the rules that we learned at the [two-day traffic control personnel] course is to be kind and courteous and respectful and I thought just acknowledging people, like ‘hey you got through the work zone safe, I see that you are there, you are doing the correct thing, good job,’ so I thought about doing that and people drive past you and they feel comfortable,” said Hayley, who is 23 years-old.\n\n“I just like seeing all the individuality because everybody is so different out there, you get to see a little bit of their personality as they are going by,” said Hector, 27.\n\nHector is from Gitaxt’aamiks in the Nass Valley. He started flagging in high school when he needed an after-school job with flexible hours. Around that time he met Hayley on Facebook, who is from Kitselas. Now they live together in Gitaus and work for Gitxsan Safety Services.\n\nHayley is newer to the job. She said that the past few months have made her happy because she’s had the ability to make people smile and make connections with drivers, many of whom pass by daily or weekly and drop off coffee or food.\n\n“One day I got like four coffees, I was so wired on caffeine,” Hayley said with a laugh.\n\n“Someone saw me shivering and they put a jacket out their window and gave that to me, it was raining and I forgot my gear, yeah they’ve been really nice and whenever people do give you coffees and neck warmers, whatever they feel like giving they’ll say ‘you really make our day, we love how you smile at us, it really brightens up our day when we are going by,’” she said.\n\nHector describes himself as a go-getter — he likes to “get it done” and stay busy. Hayley said she is more easygoing but likes to persevere through things and work hard.\n\nSometimes shifts can be 14 hours-long in bad weather conditions, but Hector said that he sees staying positive as just a part of the job. He also pointed to the income gap between non-Indigenous and Indigenous people.\n\n“Everybody is asking why I’m so happy and all that. [It’s] because I’m Native and I’m employed,” Hector said. “Through this job I’m finally able to save up to be poor, I’m finally poor.”\n\nIndigenous Canadians’ median income is around 30 per cent less than the median income of non-Indigenous Canadians according to Statistics Canada.\n\n“I’ve never really seen that much money growing up, where I worked, I wouldn’t make that much,” Hayley said.\n\n“But with flagging the harder you are willing to work the more money you are able to make, the more you are able to say ‘I can do this job, I’m ready, you can depend on me,’ you make some pretty decent money, you can live happier.”\n\nThe couple is saving up for college and to eventually buy a house.\n\n“What we are doing at this job is we are going to make money, save it up, get established ourselves and go to school,” Hayley said.\n\nHector is in his first year of the criminology program at Coast Mountain College and plans on becoming a lawyer.\n\n“My favourite class out of there that I would recommend everybody to take just for the hell of it really would be ‘Women in Crime’. It changed my perspective on women and in the workplace women are just treated so badly,” Hector said.\n\n“Women, they do commit the same crimes but just they do it for different reasons, like mainly for self preservation like they feel threatened so they are going to protect themselves and if they are criminals it’s more likely for profit.”\n\nHayley has her sights set on psychology after taking a few college courses.\n\n“I did really well in the psychology course and that helped me learn emotional control, how to stay positive, managing yourself better and I think that honestly if I did not go do that course I would not be able to be so happy as I am at my job,” she said.\n\n“I believe in it, I believe it can help people, I think it’s important, it’s interesting.”\n\nHector is also a mixed martial artist. He has trained in the sport for ten years and has a couple amateur fights under his belt. He is planning to return to the sport after getting surgery and taking a hiatus following his longtime trainer Tony Rutledge’s disappearance in 2017, after the small fishing vessel he was in capsized in the Douglas Channel.\n\nHe has helped Hayley learn self-defense and the couple does some training together, but Hayley said she doesn’t see competitive fighting in her future.\n\n“You have to sign a death waiver so no I’m not willing to sign that, he’s the brave one,” she said.\n\nThe couple’s last day working by Gruchy’s Beach was November 18, and now the job is shifting to avalanche control and flagging at automobile accidents during the winter. Both Hayley and Hector said that their work crew played a big part in keeping them positive over the past few months.\n\n“They’re one of the best, I’m not going to say the best because that would probably make other people feel bad but they are one of the best crews I’ve ever worked with, they are super hardworking and the unity of it was beautiful to see, it was like clockwork,” Hector said.\n\nHayley said that friendly drivers made a difference too.\n\n“It makes me feel happy knowing that I help in some way in making somebody else smile, that’s always a nice thing to do for somebody,” she said.\n\n“But I also let them know that ‘hey you guys make me feel happy too’ because a lot of people will do their best to be funny and make you giggle and that makes it so much easier to stay positive.”\n\n@BenBogstie\n\nben.bogstie@terracestandard.com\n\nLike us on Facebook and follow us on Twitter.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-30 14:30:00-08:00",
    "title": "Positivity is just part of being a flagger – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/community/skeena-voices-positivity-is-just-part-of-being-a-flagger/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}