{
    "authors": [
        "Jake Wray"
    ],
    "content": "Kendra Willems, seen here Nov. 5, created a Facebook page to help facilitate social supports such as clothing donations in an informal manner that supplements existing supports and charities. (Jake Wray/Terrace Standard)\n\nKendra Willems is pretty new to the Terrace area, but that didn’t stop her from rolling up her sleeves and helping out in the community.\n\nShe moved here about a year ago with her husband and their 11-year-old daughter. The family is from Whitehorse, and they spent some time moving around other small B.C. towns before Willems’ husband found industrial work in Kitimat.\n\nWillems recently created a Facebook page called Terrace, BC Community Help and Helpers, which serves as a platform for donations such as clothing or snow-shoveling, as well as a forum for discussion about social services in the area.\n\nThe page has nearly 200 members so far and has already been used to facilitate several donations of clothing and there is plenty of passionate discussion about how to help more.\n\nThe page is not intended to overlap existing services, Willems said. It’s meant to be an informal supplement to established, more structured social supports and charities.\n\n“I’m really interested to see where it goes, because the whole point of it is to be community driven, right, to have it not be this hugely organized thing,” she said. “It’s just for people to come together and ask for help where they may need it, or give help when and where they can without any big commitment behind that help.”\n\n“It’s not meant to overlap anything and it’s not organized in a way that it could. It’s just a gap-filler.”\n\nThe idea to start the page began when she went to the bank on the first day of snow Terrace saw this winter, and she found a whole bunch of people huddled in the bank trying to keep warm\n\n“I noticed there was about 15 to 20 people shoved into that bank,” she said. “I mean it was packed like sardines in there, which from a community health standpoint, that’s not great with COVID, so if people need a reason to want to help with that, it will affect all of us.”\n\nThat experience sparked a desire in Willems to learn more about what social services were available in her new hometown. She wanted to know what she could do to help ensure everyone had a safe, warm place to rest.\n\nAs she reached out and began to learn more about the services that exist, she realized she wanted to contribute and also foster a discussion on social media, because it isn’t always easy to understand the ins and outs of those services.\n\n“I’ve definitely had a hard time understanding what’s being offered, so I imagine for someone looking to access those services, they probably have a hard time as well,” she said. “[The Facebook page] is a place for people to come together and talk about these things, find where those gaps are, identify them.”\n\nPlus, her job as an office co-ordinator for design firm Stantec has been slow because of the pandemic, so she had extra time to donate.\n\nShe said she has been involved in volunteering and community work since around the time she was 18. One of her first jobs was with the Yukon Council on Disability, which involved a lot of outreach work.\n\nShe also sat on the board of White Ribbon Yukon, a men’s group dedicated to stopping violence against women. She said it was good to see men facing that issue. At one point, she organized a men’s slam poetry night themed around consent.\n\n“That was not something that you often see and so to see a bunch of men in the community come together happily to do poetry on consent was a nice change of pace,” she said.\n\nShe acknowledged that some women would not be comfortable participating in such a group.\n\n“That’s just my way of dealing with some of the trauma of being a woman, which it has come with trauma, and I think, for me, being active and speaking out is healing,” she said. “Everyone deals with it differently but for me it’s empowering to talk about it and do things about it.”\n\nShe said her family loves being in Terrace, though it has been tough to socialize and integrate fully with all the pandemic precautions — something many newcomers to Terrace have dealt with this year.\n\nWillems’ daughter is settling in just fine and just the other day was asking to have a sleepover with a school friend (on a school night, no less.) The little one has been helping out with facilitating donations through the Facebook page.\n\n“She’s really excited to be involved in that and thinks it’s a great thing to be doing so, it’s nice to see her think that way,” Willems said. “She’s offering up bits of her stuff all the time that she wants to give to somebody.”\n\nWillems said her main hobbies are all outdoors, and she hasn’t had a chance to do much of that this year. She’s an avid whitewater kayaker, but her kayak hasn’t made it to Terrace yet so she’s stuck mostly to running (and the weather hasn’t been tremendous this year).\n\nShe’s looking forward to learning more about social services in the area and how she can help out, and she hopes more people become involved with the Facebook page.\n\n“It’s beneficial even to those that are helping,” she said. “It feels good to help, and I think we could all use that kind of goodness right now.”",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-26 16:00:00-08:00",
    "title": "‘We could all use that kind of goodness’ – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/community/skeena-voices-we-could-all-use-that-kind-of-goodness/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}