{
    "authors": [
        "Ronan O Doherty"
    ],
    "content": "Dwight Ballantyne poses with young members of the George Gordon First Nation in Saskatchewan. (Special to The News)\n\nDwight Ballantyne was sitting on a flight back to Canada in March 2019 when he decided he needed to dedicate himself to helping remote indigenous communities like the one he grew up in.\n\nIt was his first trip overseas, and against some high odds he had just represented Team Canada at an international hockey tournament in the Netherlands.\n\nThis lead to him reminiscing on how far he had come – both in a literal sense, and a figurative one.\n\nBefore moving to B.C. to pursue school in 2016, he spent the first 21 years of his life in Montreal Lake, Saskatchewan.\n\n“I was thinking about how drastically my life had changed in three years time,” he said. “I found myself thinking about how stuck I was in a community, and how difficult it was for me to tap into resources, or find opportunities.\n\n“From then on, I wanted to find a way to give back to my people in any way possible.”\n\nREAD MORE: Maple Ridge group gives back to northern places\n\nWithin a month, he founded The Ballantyne Project with an aim to bring awareness to a segment of the Canadian population that, he said, rarely makes it into textbooks, popular media or social conversation: youth and young adults living in remote Indigenous communities.\n\nHe gave inspirational speeches to youth in places like George Gordon First Nation, and Peter Ballantyne Cree Nation Southend in Saskatchewan, and Tootinaowaziibeeng Treaty Reserve in Manitoba.\n\nThat lead to him being approached by some Lower Mainland schools, starting with Garibaldi Secondary in Maple Ridge, to discuss what it was like growing up in a place without many of the advantages those in urban settings possess.\n\nThe latest campaign in his effort to aid those he believes are invisible to their fellow Canadians is #WeSeeYou.\n\n“My girlfriend came up with [the slogan],” he said. “I like it because it fits so perfectly with what I wanted to do – shed light on on what’s going on in remote reserves to those in more of an urban setting.”\n\nFor the first #WeSeeYou Day (January 11, 2021) The Ballantyne Group is calling on schools across the country to join in to let the thousands of youth and young adults living in remote indigenous communities know they are no longer an invisible segment of the population.\n\nOne of the many ways schools can participate is to start a collection of activity supplies (pencil crayons, felt markers, colouring and activity books, beading kits, etc.).\n\n“Those items are a big deal in remote communities, especially now that they’re having a rough time with COVID-19,” Ballantyne said, before drawing attention to Peter Ballantyne Cree Nation Southend, a community in the far north of Saskatchewan.\n\nFollowing an outbreak in October, three young adults committed suicide, and the band is taking it very hard, Ballantyne said.\n\nI want to give everyone a clearer picture of the impact boxes that are filled with activities can have in a remote First… Posted by The Ballantyne Project on Monday, November 16, 2020\n\n“People have to isolate and they aren’t allowed to visit each other. But before the virus, spending time with each other was all people did,” he said.\n\n“How do you think it’s going to be when you have 10 to 15 people living in a two bedroom house with no internet and nothing to do?”\n\nHis initial plan was to draw attention to, and support the single community, but after some social media posts about the campaign drew attention, the program is now planning to help some other remote bands too.\n\n“We’ve got a bunch of people reaching out to us, so it’s quite overwhelming now,” Ballantyne said.\n\n“We have people in B.C., people in Saskatchewan, and people in Ontario who are getting involved and wanting to help.”\n\nA few have already signed up to participate including St. Johns K-12 School (Vancouver), Toronto District School Boards Indigenous Graduating Students, Walnut Grove Secondary (Langley) Indigenous Awareness Student Club (Brampton), Kwayhquitlum Middle School (Port Coquitlam), and the Indigenous Student Leadership Team at Maple Ridge Secondary.\n\nBallantyne said giving back to communities like the one he still calls home makes him happy.\n\n“It does require a lot of work, but at the end of the day it makes me feel good and I know I’m doing anything I can to help the communities that are considered invisible.”\n\n\n\nronan.p.odoherty@blackpress.ca\n\nLike us on Facebook and follow us on Twitter\n\ncharityFirst NationsMaple Ridge",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-20 06:00:00-08:00",
    "title": "B.C. man aims to bridge gap between remote communities and rest of Canada – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/community/b-c-man-aims-to-bridge-gap-between-remote-communities-and-rest-of-canada/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}