{
    "authors": [],
    "content": "Brenda reflects on the joy her rescues have brought her over the years\n\nCats!\n\nYou either love them or hate them. Either way I would be pleased if you did not drop your cat off here. I could be wrong that the cat wandering along my trails looking for a bird snack could be lost.\n\nIn all my years having cats rescued they all have been great companions. All have fit into our critter family and most have lived a long time. Charles Dickens said it well.”What greater gift than the love of a cat.”\n\nI think about that every night when I get into my cat hair covered bed how much I enjoy talking to old Scruffy who came here many years ago. He was a newborn thrown out with the garbage at the dump. Scruffy is seldom seen by people but he does like to go for good walks with the dog.\n\nMORE SPICE OF LIFE: Nasty act ill-informed or racist\n\nMark Twain said: “If man could be crossed with the cat, it would improve the man but deteriorate the cat.”\n\nI most often tell you about my dogs and how much I enjoy them. Just this very day I looked at the cats and kittens looking for a forever home through the Northwest Animal Shelter. So many beauties that have been rescued from some situation. They have names like Oliver, Ma, Fiona, Spitfire, Chicky and the one I was fascinated about was 17-year-old Boots, who is facing major health problems and would love a forever place to end her life.\n\nI was reading this quote: “There are two means of refuge from the misery of life — music and cats.” Albert Schweitzer.\n\nSo, if you have room in your hearts and home, maybe a lovely cat could make your life better.\n\nMORE SPICE OF LIFE: Respect for U.S. Supreme Court Justice Ruth Bader Ginsburg\n\n“Time with a cat is never wasted.”\n\nIn the past little while, I have learned of two older folks I knew well that have passed on. Bill Lopaschuk, aged 93, and Margaret Goodacre, aged 94. Great lives lived well.\n\nI was about to talk about their lives and then I said to the cat there are so many elders in the Indigenous community that have made a difference for their nation or clan. I should be more sensitive to the memories of elders who leave this earth at a grand old age.\n\nSo, for those who have lost someone, I hope their memories are a blessing.\n\nIf you feel like it you could call 250-846-5095 or email to mallory@bulkley.net.\n\n\n\neditor@interior-news.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-10-29 01:30:00-08:00",
    "title": "Cats: A refuge from the misery of life – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/opinion/cats-a-refuge-from-the-misery-of-life/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}