{
    "authors": [
        "Local Journalism Initiative"
    ],
    "content": "‘I think what’s helped us is that we had to understand our past and move forward’\n\nDanielle Saddleman and Shane Miller OKIB business owners are reclaiming their family and hope to see more people choose the same path. (Kelsie Kilawna, Local Journalism Initiative Reporter)\n\nBy Kelsie Kilawna, Local Journalism Initiative Reporter, The Discourse\n\nIt’s a sunny morning as cars whiz by at the Okanagan Indian Band (OKIB) community just outside of Vernon.\n\nShane Miller and Danielle Saddlemen are busy setting up their food truck to open later in the day. Once they’re set, we sit down at a picnic table and instantly laughter and jokes start to fly across the table.\n\nTheir story is a love story. The two met and started dating in 1999.\n\n“We had this natural attraction to each other…he was funny and made me laugh all the time even before we got together,” says Saddleman.\n\nBut their journey together hasn’t always been easy, it took a lot of healing to get to where they are today.\n\nAddictions is something that has plagued Indigenous communities for generations — often used as a coping mechanism in the face of colonization, residential school, the 60’s Scoop and continued systemic discrimination.\n\nIn light of this, many Indigenous Peoples have also made powerful and consistent efforts to revive, reclaim, and create a resurgence of the old ways to survive.\n\nSaddleman and Miller are part of that revival, choosing to reclaim culture and language as a means to fight back against systems of oppression that have impacted them directly.\n\nIt’s been just over seven years since the couple decided to become sober and commit to making for a brighter future for their family. Miller says he hopes to see more people make the same choice.\n\n“I want to see more of the cycles being broken, seeing our families staying together, building a foundation that all our children need to grow and succeed,” he says.\n\nFrom different worlds\n\nSaddleman grew up much differently from Miller. She was raised by many strong parental figures in the (OKIB) community. That helped to shape her into who she is today, she says, and in turn has supported her in sharing that same connection with Miller.\n\n“I kind of have to show him what family is to me and this is how family was for me growing up,” says Saddleman.\n\nMiller is a 60’s Scoop survivor. He was taken from his home when he was an infant and placed into government care. He describes being bounced around from home to home and living his life in survival mode.\n\n“When you grow up in survival mode, anything outside that survival mode you just don’t care about, and that means you’re hurting people, hurting your loved ones, families” he says.\n\n“(Learning these lessons) took me trial and error and I think back about it and it’s all because of her.”\n\n‘There was so much I didn’t know’\n\nMiller credits Saddleman for the healing he has experienced as a result of the infectious love she has shared with him.\n\n“I’ve never known love, I’ve never known family,” Miller shares.\n\nGrowing up in an unstable environment, he says he was frequently left having to fight for his basic needs.\n\n“I used to have to sneak upstairs, we lived in a basement suite, and I had to always sneak upstairs and steal food. That’s all I’ve ever known,” he says.\n\nDuring his youth Miller lived on the streets and describes stealing food to survive. After aging out of the foster care system, Miller became a young parent at 20 years old.\n\nMiller shares that it was his upbringing that left him unequipped to raise his oldest daughter and that he caught himself continuing a cycle he never wanted for his family.\n\n“I go around life and don’t know what a family is, and trying to have kids at a young age and all you know how to do is run. I did it to my first kid.”\n\nWhen Miller met Saddleman, he says that her love of family was infectious and it is one of the many reasons he became the man he is today. Saddleman says that when she met Miller, it was love at first sight and his sense of humour drew her in.\n\n“That’s what attracted me to him and I always thought he was handsome, and I still have those feelings I first did from when we first got together to today,” says Saddleman.\n\nFor Miller, identifying that love was more difficult.\n\n“How can I say I ever loved her in the beginning if I was disrespecting her for so many years?” he says.\n\n“I didn’t understand it. It took me a long time to understand what love was, and it took me so long to even know what she was giving me.”\n\nIn their early years together, Saddleman and Miller spent most weekends drinking and as they drank together Miller shares they fought often. He says that he was ignorant and disrespectful towards Saddleman and that it was her love and patience that brought him to this place of self-discovery today.\n\n“It took stupidity and ignorance on my part, and took hurt on her part,” he says. “I’m not proud of that.”\n\nThe family grows\n\nAfter years of promising one another they didn’t want children, in 2004, the couple fell pregnant with their first daughter together. It was a blessing they didn’t expect.\n\n“I love her so much, we loved her, that’s all she wanted was me or Shane,” Saddleman says.\n\nWith their new baby, things shifted for the couple and the expectations of their relationship began to change. After a few years of continuing to drink alcohol together while parenting, Saddleman decided it was time to change things.\n\n“I said we’re done, you can go live with your mom and he did,” she says.\n\n“The more he drank it would annoy me more, and I grew to hate the person Shane was then. I was just like we can’t show our kids that.”\n\nFor Miller, it was this ultimatum that led him to make the choice to be sober.\n\n“I had to make a choice, and she said go ahead if you want to do drugs and party then like go ahead just not around the kids or me no more,” he says.\n\nAfter Miller made the choice to be sober, he said that it was time for Saddleman to make the same choice.\n\n“We worked on it and did a couple of counselling sessions together,” Saddleman says. “For me I was like well I’m not going to quit drinking then… he threw the ball back in my court and said, `well, nope, if that’s the life you’re going to choose then we’re not going to work.”’\n\nA journey of self-discovery\n\nWhen the couple decided to take the road to sobriety, that’s when they say life really began.\n\n“When you look at it that’s half the reason Indigenous relationships fail if you take out the alcohol factor and the majority of those relationships would’ve worked,” says Miller.\n\n“Selfishness is a big part too, she taught me not to be selfish because that’s what you have to be when you’re in survival to live.”\n\nIt was the love for the culture and language that was instilled in Saddleman that helped heal their family.\n\n“I always had a spark in me that really connected to language and culture and it wasn’t until after I sobered up and went to school and started to learn all these things from a Sqilxw loosely translated as person Indigenous to the land perspective,” she says.\n\n“Once our people connect back to the land and culture they find pieces of themselves and it heals them and then they can have healthy relationships. And I feel like I’ve had a taste of that and I know what culture has done for me and for Shane.”\n\nFor Miller, culture was not something he was brought up with and credits his partner for all she has done for not only him by introducing the culture but also what she’s done for the community.\n\n“You’re Saddleman the one putting it all together and for me, that means a lot. It helps me in my healing now that piece of the pie that was missing is whole. Now that addictions piece that was pulled out has been put back in. Breaking that cycle filled that hole,” he says.\n\n“The circle is now complete again and culture was that last piece.”\n\nAdvice for others\n\nMiller and Saddleman have now been together for 20 years. After having their daughter, they also welcomed a second child in 2006. Their advice to other families? It’s important to confront your past so that it doesn’t impact your ability to heal.\n\n“Before it was really hard because alcohol blocked all of that and turned it into anger, now when I talk like this I get emotional and it’s a release, it’s a part of that healing,” Miller says.\n\n“If you don’t you carry it around, and it eats you, and if you don’t deal with that you turn to things that numb that pain.”\n\nSaddleman says that it’s always good to remember to laugh together.\n\n“Humour, it’s one of those things that keeps our relationship alive. He is just so funny and I kind of bounce off of it, we’re always teasing each other,” she says.\n\nAs the two continue to move forward in their relationship, they are now running three businesses: a food truck, catering company and co-owning a cannabis dispensary.\n\nIn their life, community and culture are the priorities.\n\n“Coming together as a community and reviving culture and get that sense of Kn’Sqlixw, of what is it? What is a good relationship? With our ties to the land, our ties to the culture, that’s what I really want,” says Saddleman.\n\nMiller shares the same sentiment, that it’s time to break the cycles that have taken so many Indigenous Peoples from their paths.\n\n“If you look at us as a whole and you look at the mental illnesses that we have, it’s like our soul is gone, the spirit doesn’t know what to do with our minds. Our minds have been mined, and now our minds have been affected by it,” he says.\n\n“We’re still fighting to keep our culture, we sing our songs, we put our energy into the air.”\n\nSaddleman says it’s important for them and others in their community to return to the land to learn what it means to be Sqilxw.\n\n“It’s all about having a positive wellbeing, spirit and soul and to be able to experience that together,” says Miller.\n\nSaddleman adds that it’s important to also remember to not be ashamed by the colonial circumstances that Indigenous Peoples often find themselves dealing with.\n\n“I think what’s helped us is that we had to understand our past and move forward. It was colonization and residential school and all of the wrongs done to our people…it’s not our parents or grandparents’ fault to what happened.”\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nIndigenous peoples",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-10-03 11:30:00-08:00",
    "title": "Confronting their addictions to make way for healing — a B.C. love story – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/community/confronting-their-addictions-to-make-way-for-healing-a-b-c-love-story/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}