{
    "authors": [],
    "content": "Hotel Eldorado chef Oliver Kaiser. (Lia Crowe) Hotel Eldorado chef Oliver Kaiser. (Lia Crowe) Hotel Eldorado chef Oliver Kaiser. (Lia Crowe) Hotel Eldorado. (Lia Crowe)\n\nA Q&A with Hotel Eldorado chef Oliver Kaiser\n\nQuick Facts:\n\n• Born and raised in Schaffhausen, Switzerland, until the age of 36.\n\n• Has worked at Hotel Eldorado for four years.\n\n• His previous experience includes Sun Peaks Resort and UBCO.\n\nWhy Lakeside Dining at Hotel Eldorado?\n\nIt’s the place to be in Kelowna. It’s Kelowna’s home for locals and tourists.\n\nWhy did you decide to become a chef?\n\nWhen I was little, I loved hotels and restaurants. I was always running into the kitchen of the hotels to see what they were making.\n\nWhat is the specialty at Lakeside Dining?\n\nI love to give a classic touch while using local ingredients. I aim to create a classic food experience with a local twist.\n\nHow does the restaurant’s cuisine fit with the decor or ambience?\n\nHotel Eldorado is a classic boutique hotel with vast history. I aim to match this with my classical approach to cooking.\n\nWhat’s the one ingredient you can’t live without?\n\nBeef.\n\nWhat is your go-to meal when you’re low on time?\n\nBread and cheese.\n\nWhat would your last meal be?\n\nLobster and beef.\n\nWhat is the best recent food trend?\n\nClassic, seasonal-inspired local cuisine is still the trend — and it’s one I like to deliver on.\n\nWhat is a good simple piece of advice for pairing wine and food?\n\nNever overpower the food or the wine. They need to complement each other. But it also comes down to personal preference of the guest as well.\n\nWhat is your favourite cuisine to cook?\n\nItalian cuisine.\n\nWhat is your favourite cuisine to eat?\n\nFrench cuisine.\n\nWhen are you happiest at work?\n\nWhen my team receives excellent feedback from our guests on the food, and my employees are happy.\n\nWhen are you happiest outside of work?\n\nWhen I play golf with my friends: it is like yoga to me.\n\nLifestyle",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-10-16 12:00:00-08:00",
    "title": "Good taste at Hotel Eldorado with chef Oliver Kaiser – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/life/good-taste-at-hotel-eldorado-with-chef-oliver-kaiser/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}