{
    "authors": [],
    "content": "A wild turkey can run up to 19 kilometres per hour\n\nWild turkey tom. Jill Hayward photographer (bobjillh@gmail.com) Photo can be used by Black Press Media only\n\nThis weekend marks Thanksgiving in Canada. The first official, annual Canadian Thanksgiving took place on November 6, 1879.\n\nOne species that you might know that has now become so common that we rarely think of, unless it’s on our dinner table, is the humble turkey.\n\nThe shining star of Thanksgiving spreads, this native North American gobbler wasn’t always in abundance. In the early 1900s, wild turkeys had all but disappeared from some parts of Canada due to unregulated logging and hunting.\n\nNow, wild turkeys are found in seven Canadian provinces. Their range is southern and western New Brunswick, southern Quebec, Ontario and Manitoba, southeast Saskatchewan, southwest Alberta and the British Columbia southern interior.\n\nIn honour of Thanksgiving, here are 11 facts to gobble up about wild turkeys, a species that has been documented on Nature Conservancy of Canada properties in different parts of the country.\n\n1. Male wild turkeys are called toms, while females are called hens.\n\n2. At the start of spring, male wild turkeys get together in clearings to perform courtship displays. They puff up their feathers, lower their wings, fan out their tails and slowly strut, while making their famous gobble sounds.\n\n3. Believe it or not, wild turkeys can fly. At nighttime, they fly up into trees to roost.\n\n4. Wild turkeys were extirpated (locally extinct) from Ontario as a result of habitat loss and over-hunting. Reintroduction efforts began in 1984. Turkeys are now a common sight in that province and they are continuing to expand their range.\n\n5. An adult turkey can have more than 6,000 feathers.\n\n6. In 2019, the New Brunswick Bird Records Committee added wild turkeys to the province’s official bird list. The province has an established population of approximately 5,000 wild turkeys, many concentrated close to communities along the Canada-United States border.\n\n7. Wild turkeys mostly inhabit forests but often wander into open fields and grasslands to feed, nest and reproduce successfully.\n\n8. Wild turkeys are not fussy eaters. They feed on seeds, hazelnuts, oak nuts, hickory nuts, beech nuts, acorns, apples, fruit, snails, worms and amphibians all year long.\n\n9. Wild turkeys can run at speeds of up to 19 kilometres per hour.\n\n10. Certain characteristics of wild turkey droppings, such as their shape and size, reveal the turkey’s gender and age. Female droppings are spiral shaped, while male droppings are J-shaped. The larger the diameter, the older the bird.\n\nSubmitted by Andrew Holland, National Media Relations Director with the Nature Conservancy of Canada.\n\n\n\neditor@interior-news.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-10-12 06:30:00-08:00",
    "title": "HAPPY THANKSGIVING: 10 fun facts about turkeys – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/community/happy-thanksgiving-10-fun-facts-about-turkeys/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}