{
    "authors": [],
    "content": "~David Wylie~\n\nStruck by sudden inspiration, Alana Archer quickly turned her house upside down, gathering the hodgepodge of items she needed to re-create an image of artist Frida Kahlo’s 1941 painting Me and My Parrot.\n\nInstead of four brightly plumed birds, Alana posed with neon-green household products—including a jug of laundry detergent and a tub of dishwasher pods—perched on her shoulders and embraced in her arms. She substituted the cigarette between Kahlo’s fingers with a thermometer.\n\nArcher posted her photo to Instagram and on the popular website Reddit, where it fast became one of the day’s top posts, viewed by hundreds of thousands of people.\n\n“I was hoping to just make people laugh for a little bit. The symbolism was there and colour was there,” Alana said. “The response was incredible. It just took off like wildfire.”\n\nThe Kelowna artist’s image was inspired by the Getty Museum Challenge, an online callout to re-create art using a small number of objects lying around the home. The challenge went viral during the first couple weeks of pandemic isolation, and social media feeds were populated with creative and funny interpretations.\n\nPeople commenting on Alana’s posting quickly pointed out the reproduction was missing the original artist’s distinct unibrow.\n\n“There was so much controversy about the eyebrows, and it was interesting how people were interpreting it,” said Alana. “Some people were taking personal digs at me and saying I completely missed the mark. I took it all with a grain of salt. It was fascinating seeing people’s spectrum of reaction.”\n\nInspired, Alana delved deeper into Kahlo’s art and re-created another piece, Self-Portrait with Braid. She included the unibrow this time and incorporated a PlayStation controller as the necklace. Alana’s play on that portrait was printed in People Magazine. Her re-creations were also featured through PBS NewsHour.\n\nThe exposure helped her pick up more fans and followers on social media at an important time in her art career—one that has involved going through her own transformation. The COVID-19 pandemic resulted in her being laid off from her job in interior design. As a result, she switched her focus to her own art.\n\nREAD MORE: Brewing Success\n\n“I’m keeping up with my personal projects. I’ve been running a separate art and painting company on the side for a few years. It’s been a bit of a hobby, but now it’s getting my full attention,” she said. “I think there’s lots of opportunity right now for people to just jump in and be a little bit entrepreneurial and make opportunities for themselves. And I think now, more than ever, people are wanting art to feel connected, and for things to be exciting again.”\n\nShe’s stayed busy on Instagram and her website, getting updates done that she had previously put off.\n\n“Everyone’s getting really creative in different ways.”\n\nAlana tries to express a humanitarian message through her work.\n\nHer dad is from the Republic of Chad, in central Africa, and her mom is Canadian. They were “pretty nomadic,” she said.\n\n“I was back and forth quite a bit throughout my childhood.”\n\nAlana has spent time in France, Spain and Portugal—connecting with family and exploring. She said experiencing different places and cultures, especially Third World countries, has helped her appreciate things more.\n\nHer dad worked in construction and she spent time around the different trades. Her mom enjoyed experimenting with artistic pursuits, switching up mediums often—from pastels to sewing.\n\n“I got the best of both of their worlds, I think,” she said.\n\nAlana pursued interior design after high school, studying at the Centre for Arts and Technology in Kelowna. Still, as much as she loved interior design, she found it incredibly fast-paced and detail-oriented. The construction side of the business also has its own inherent challenges.\n\n“Having my layoff now, I’ve been given the opportunity to just dive full force into my own artwork,” she said. “I’ve been diving into a lot of resin art recently. It’s one of my more exciting mediums to play with because it has a mind of its own and it will not be controlled. It’s like watching a story unfold right in front of your eyes.”\n\nArt using resin is a big investment of time and materials. There are multiple layers on top of each other that can be manipulated, or left to level out.\n\n“It’s a material that you have to listen to. It’s definitely interactive. There are times it co-operates and times that it doesn’t. I’m still learning how to tame it. Everything has a lot of energy, a lot of colour.”\n\nIt’s also a delicate material; resin reacts to chemicals in the air and to temperature.\n\nOne of her more complex pieces is a round, abstract work with six materials creating cohesion in chaos. It plays together and reacts. Another piece, called Extraneous, was displayed recently as part of the Kelowna Art Gallery’s exhibition for local artists.\n\nShe’s recently been working on a 30-inch round birch canvas, layering it with resin and also incorporating mirrored glass.\n\nAll of the proceeds from this year’s sales of Alana’s art will be donated to the Kelowna General Hospital Foundation.\n\nFor more information, visit alanaarcher.net.\n\nLike us on Facebook and follow us on Twitter.\n\nLifestyle",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-09-02 15:06:00-08:00",
    "title": "In studio with Alana Archer: Cohesion in Chaos – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/life/in-studio-with-alana-archer-cohesion-in-chaos/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}