{
    "authors": [],
    "content": "~Angela Cowan~\n\nIn her fourth year of real estate, Amber Kronyk embraces a positive, heart-centred approach to finding perfect homes for her clients.\n\n“I love it because I can use my creativity and passions for writing and design all in one place. I really enjoy the people I get to meet, and the diversity of the job,” she says. “I always put 100 per cent into everything I do, and real estate is one of those careers where if you want to succeed, you have to be willing to put in the time and the hard work.”\n\nWorking in the health and fitness industry for much of her career, she had been considering a change for quite a while.\n\n“With my husband in the building and development industry, [real estate] seemed to make sense,” she says. “I’ve learned a lot from him, and it has definitely increased my knowledge base on home construction for working with my clients.”\n\nAmber grew up in Williams Lake on a hobby farm surrounded by animals, and was thrilled to get her first horse at five years old. She spent her childhood exploring the land on horseback, and then shortly after high school embarked on a year of travel overseas. University in Victoria followed before she moved to the Okanagan, and she and her husband have been in McKinley Beach for about three years now.\n\n“It’s such a beautiful spot,” she says. “I can hike from my back door, walk to the lake and boat. And the neighbours here are awesome! I actually felt very lucky to be isolated here during COVID.”\n\nOutside the office, she takes advantage of everything the Okanagan has to offer.\n\n“I love water sports, biking, hiking and exploring local wineries and restaurants,” she says. “And hopefully, I’ll be able to get back to some travelling soon.”\n\nAbove all, Amber is a lifelong learner.\n\n“I want to continue growing, both in a broader sense of travel and exploring other cultures, and also in a career sense,” she says. “I am passionate about the earth, and want to learn more about sustainability in home construction and renovations, and to be able to utilize that knowledge for my real estate clients.”\n\nThe 7 Sins\n\nEnvy:\n\nWhose shoes would you like to walk in?\n\nI’m a big fan of the scientist Sylvia Earle. Not only has she explored some of the ocean’s most untouched places and seen firsthand the changes over time, but she has used her knowledge to become a voice of change for the oceans. To be able to use your time on earth to actually make a difference like she has is so inspiring.\n\nGluttony:\n\nWhat is the food you could eat over and over again?\n\nPickles, Greek food, Indian food, tacos. Was I supposed to only pick one?\n\nGreed:\n\nYou’re given $1 million that you have to spend selfishly. What would you spend it on?\n\nEasy. A large property in a tropical place where I can take in rescue animals.\n\nWrath:\n\nPet peeves?\n\nNegativity. Life is too short to dwell on the rough parts. Live in the now, focus on gratitude and your mindset will shift to positive thoughts.\n\nSloth:\n\nWhere would you spend a long time doing nothing?\n\nI’m not very good at doing “nothing,” so it would have to be somewhere with good exploring and fun outdoor activities, like hiking, biking, scuba diving and surfing.\n\nPride:\n\nWhat is the one thing you’re secretly proud of?\n\nMy husband, who is the hardest worker I have ever met, and is always pushing me to improve my business and be the best version of myself. And my amazing circle of friends and their ability to stick together through some of the hardest things life can throw at you, and still come out with smiles on their faces.\n\nLust:\n\nWhat makes your heart beat faster?\n\nWhen my clients get an offer on their home, I get very excited for them! Or when my buyers find that perfect home that gives them goosebumps; I have been known to tear up occasionally, haha!\n\nLike us on Facebook and follow us on Twitter.\n\nLifestyle",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-08-28 10:30:00-08:00",
    "title": "Secrets and Lives: The 7 Sins – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/life/secrets-and-lives-the-7-sins/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}