{
    "authors": [],
    "content": "~ Lia Crowe ~\n\n“It was different,” Peter Wood says with a smile and a shrug when asked about opening a cafe in the thick of a global pandemic. “In some ways our timing wasn’t the worst. For a long time I was thinking, ‘this is going to be a disaster!’ We were finally at the point when we were ready to open and then a pandemic hits. It was a bit of a kick in the teeth.”\n\nBut like any good entrepreneur, Peter quickly pivoted to a pared-down menu focused on takeout and says he’s been pretty “chuffed” by the positive response.\n\nOfficially open since early May, Bear and Joey Cafe, where I meet owner Peter to chat life and style, is a beautiful space. It’s like nothing I’ve seen in Victoria before: gleaming in gold, green and pastels, playful and fresh and idly waiting to delight this city.\n\nREAD MORE: Growing passion\n\nAs we sit inside the cafe on one of the days it’s closed, Peter has to smile and wave his apologies to a steady stream of would-be customers coming up to the door and hoping for a flat white or perhaps Bear and Joey’s incredible granola bowl.\n\nPeter grew up in Sydney, Australia (more specifically, in the northern beaches), where he met his now wife who is originally from Vancouver Island.\n\n“In Sydney, I had two cafes and a pizzeria with a few partners. I studied business and property and worked in residential sales, commercial property management, as well as for a property developer. But I had an awakening, and realized that hospitality is my true passion. I started looking to do a restaurant overseas and when I came to Canada to meet my girlfriend’s parents, I saw Victoria and thought, this is a no-brainer. So we started putting the wheels in motion to move here.”\n\nNow after three years in Victoria, Peter’s vision has become a reality with Bear and Joey. Asked to describe how his approach is different, Peter says, “We’re not trying to reinvent the wheel, but our food program is about light, balanced, healthy and colourful dishes, paying attention to gluten free, vegan and vegetarian. Australian cafe culture is coffee every morning and a simple breakfast grab-and-go, so you can eat off our menu many times a week and feel good about it.”\n\nAnd what inspired the style of the cafe? “We were always going to go with pastels, perhaps a bit mid-century modern. We wanted something youthful, not formal, something inviting. We really want to delight the few and that was our thought process behind everything.”\n\nLike every business owner, I assume, Peter must wear many hats, and I wonder what specific aspect of his work gets him fired up the most?\n\n“Service,” he says. “Front row centre, service: seeing people delighted, choosing us and walking away happy. I have a thought process about what people will enjoy and then I get all the moving parts together. Like the staff we have now, they are super friendly, enthusiastic, all-round lovely people. Team them up with skilled chefs, and then there’s the room…and when people walk away happy I think, ‘We did it; job done!’ That’s what gives me goosebumps. It’s not an ego thing; it’s being confident in what you’re doing and confident that you can please people, and then delivering an all-round experience. That’s what service front row centre is and it’s a great feeling.”\n\nREAD MORE: Flight Attendant to Kelowna’s Plumbing Queen\n\nLike us on Facebook and follow us on Twitter.\n\nLifestyle",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-08-05 09:05:00-08:00",
    "title": "A sit down with Peter Wood, of Bear and Joey Cafe – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/life/a-sit-down-with-peter-wood-of-bear-and-joey-cafe/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}