{
    "authors": [
        "The Canadian Press",
        "Trending Now"
    ],
    "content": "Many will send tokens of appreciation to workers or offer time off or cash\n\nMelissa Velden and her chef-husband Chris Velden, stand in their dining room at the Flying Apron Inn and Cookery in Summerville, N.S. on Friday, Nov. 20, 2020. The couple is hosting holiday parties with appropriate distancing and other COVID-19 health protocols in place at their restaurant. THE CANADIAN PRESS/Andrew Vaughan\n\nWhen the December holiday season rolls around, Rogers Communication Inc. staff usually work as efficiently as elves to transform the Rogers Centre into a carnival.\n\nThey arrange for midway rides to sit in the Toronto ballpark and hire face painters and entertainers to thank more than 8,000 employees and their families for a year of hard work.\n\nWhile the ballpark will sit empty this year, the elves haven’t hung up their hats. Instead, they’re offering personalized Santa phone calls and staging an online variety show with appearances from the jolly man at the North Pole, Inuit throat singers Piqsiq and a slew of celebrities they’re keeping under wraps until the big day.\n\nThe reimagined holiday party comes as COVID-19 has forced companies to rethink their usual December festivities.\n\nIn pandemic hot spots that means bringing the razzle dazzle to virtual gatherings, while others in locations with fewer cases of the virus are opting to host parties but strictly enforce social distancing and masks.\n\nMany will send tokens of appreciation to workers or offer time off or cash, but some will forgo any kind of celebration to tighten spending and acknowledge a tough year.\n\nRogers hatched its new plan almost as soon as the pandemic started to cause shutdowns in March, said director of corporate events Emma Shaw.\n\n“With this year being so tumultuous…having something that provides a bit of normalcy and consistency…we thought was a win-win for everyone,” she said.\n\nRoyal Bank of Canada is using a similar playbook. It is hosting 150 virtual galas for each stream of the business and a company-wide, family-friendly video experience — a departure from leaving holiday events to divisions and branches to plan themselves.\n\nThe hour-long, pre-recorded presentation will include celebrities — the bank didn’t want to spoil the surprise and name any of the musicians, chefs or dancers it has planned — and be capped with a message from chief executive Dave McKay.\n\n“Not recognizing our people was not on the table,” said Curtis Hitsman, RBC’s senior director of recognition programs.\n\n“If there was a year to recognize the efforts of employees, this is it.”\n\nBut some companies still feel the holiday spirit can safety be celebrated without a screen.\n\nFlying Apron Inn and Cookery in Summerville, N.S. received three bookings for corporate holiday parties by mid-November.\n\n“There is a dental office doing a private cooking class in our space. They are with each other all day anyway, so they are not going to do something virtually,” said co-owner Melissa Velden.\n\n“With this other group, this will be the third year that they have come to us for their Christmas party and this is actually the most people they are ever going to have.”\n\nIndoor dining is still allowed in several regions of Atlantic Canada, but Velden will limit the number of guests, scrap buffets and require masks when not eating.\n\nShe’s heard of other businesses shipping local food baskets to staff, footing the bill for each worker to treat their family to dinner out or cancelling holiday festivities altogether.\n\n“People are so tired of Zoom meetings that they don’t want to have a virtual Christmas party and they would rather have something in-person later,” Velden said.\n\nSome, like OpenText Corp. and TC Energy Corp. are cancelling altogether. The Waterloo, Ont.-based tech company and Calgary oil and gas firm said they would each donate at least $1 million to local charities in lieu of holding parties.\n\nManulife Financial Corp. announced it will give all 35,000 staff money to commit acts of kindness like helping neighbours in need or donating to good causes.\n\nOthers are relying on at-home offerings — meal kits, wine tastings and wine club memberships — from Stephen Beckta’s Ottawa fine dining restaurants.\n\nFor $100 a person, Beckta will deliver charcuterie and at least four wines to the homes of employees, clients or donors. Over video later, a sommelier will walk them through what they are sipping and noshing on.\n\nBeckta can tailor the packages to meet specific tastes or higher budgets, like he did recently for a client wanting to focus on B.C.\n\n“We are doing a lot of these,” he said, noting companies like the arrangement because they can give something tactile and don’t just have to settle for another video call.\n\nCineplex Inc., Canada’s largest movie theatre operator, knows that sentiment well.\n\nThe company recently began offering auditorium rentals for as low as $125 for 20 guests that can easily distance in a big theatre.\n\nCineplex received more than 2,500 inquiries in the two days after it launched and many came from law, real estate, grocery and automotive businesses thinking about holiday gatherings, said spokesperson Sarah Van Lange in an email.\n\nBut not every business is seeing a boom.\n\nCarla Smith of Vancouver’s Rolla Skate Club can usually count on a flurry of bookings, but COVID-19 restrictions put a chill on holiday reservations this year.\n\n“Our capacity in our huge space is limited to 15 people including staff, making the viability of even trying to offer a private event very limited,” she said.\n\n“The juice isn’t worth the squeeze for us this year.”\n\nTara Deschamps, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nCoronavirus",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-04 09:00:00-08:00",
    "title": "Celebrities, Santa and Zoom part of office holiday parties being held amid COVID-19 – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/trending-now/celebrities-santa-and-zoom-part-of-office-holiday-parties-being-held-amid-covid-19/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}