{
    "authors": [
        "Aaron Hinks",
        "Trending Now"
    ],
    "content": "While COVID-19 has kept advice-adhering British Columbians inside the country, a White Rock family is offering to bring the experience of international travel to their front door.\n\nColin Sprake, his wife Gabi and their daughter Ruby launched ‘Staycation Boxes’ about two months ago.\n\nFor a cost of about $400, the company will ship a box containing a “unique luxury experience” that will play to the theme of Mexico, France, Italy, Hawaii or India.\n\nIt’s not a gift box, Sprake stressed, but an experience.\n\n“That’s the most important part.”\n\nVIDEO: Top 11 Fraser Valley staycation ideas\n\nA Hawaiian Staycation Box, for example, is intended to start in the evening, with fine cheese and Muay Thai drinks and finish in the morning with Hawaiian coffee and pancakes. The box includes a step-by-step guide on how to enjoy the experience and includes access to recipes, guides, and a music play-list with a Hawaiian theme.\n\nSprake, who owns seven businesses, said he got the idea for the Staycation Boxes after talking to a travel agent.\n\nHe said the agent, who he was mentoring as part of his business coaching service, was at a loss due to the number of trip cancellations caused by the global pandemic. He said she was sending videos to clients of different vacation spots they could possibly go once the virus passed.\n\n“Why don’t we just bring the vacation to peoples homes?” Sprake thought.\n\nSprake said the company has been an instant success, with an unexpected client base accounting for a majority of sales.\n\n“Employers want to say thank you to their employees, realtors, mortgage brokers want to say thank you to their clients when they buy a property or financial planners want to say thank you to their customers,” Sprake said.\n\n“In the last month, I really started to look at it and go, ‘We’ve got two markets we need to focus on.”\n\nHe said the boxes are designed to be gifts of gratitude, and they include a financial contribution to the food bank.\n\nHe said whenever someone orders a box, whether they reside in White Rock or Aurora, Ont., Staycation Box will send a percentage of the proceeds to the food bank that serves the recipient’s hometown.\n\n“Once these boxes are done, once a month we sit down and write cheques to all the different food banks, and we ship them out across the country.”\n\nFor his own part, Sprake says his family strives to collect 5,000 pieces of food and make a $5,000 donation to the South Surrey White Rock Food Bank ever year.\n\nTo learn more about Staycation Boxes, visit staycationboxes.com\n\n\n\naaron.hinks@peacearchnews.com\n\nLike us on Facebook and follow us on Twitter\n\nCoronavirusLocal Businesstravel",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-01 05:50:00-08:00",
    "title": "B.C. company aims to bring international vacation experience to front door – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/trending-now/b-c-company-aims-to-bring-international-vacation-experience-to-front-door/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}