{
    "authors": [
        "Jenna Hauck",
        "Trending Now"
    ],
    "content": "Square Dancing Day, Disability Day and International Ninja Day are all coming up this week\n\nMary Cox and Jack Plant dance in their pyjamas and slippers at the morning pyjama dance during the Rhythm Reelers’ 25 Annual Rally in the Valley Square Dance Festival in Chilliwack on June 4, 2011. Sunday, Nov. 29, 2020 is Square Dancing Day. (Jenna Hauck/ Chilliwack Progress file)\n\nEvery day of the year there are unofficial (and often weird and entertaining) holidays celebrated by groups and individuals around the world.\n\nAnd it’s not just one unique thing to celebrate each day. On any given day of the year, there are several to choose from.\n\nThere are also weekly and monthly celebrations. In December, for example, folks all over the globe are celebrating Human Rights Month and Tie Month.\n\nHere are some of the unofficial holidays for the coming week:\n\nSunday, Nov. 29: Chocolates Day, Square Dancing Day, Electronic Greeting Card Day, Throw Out Your Leftovers Day.\n\nMonday, Nov. 30: Computer Security Day, Mousse Day, Cyber Monday.\n\nTuesday, Dec. 1: Eat a Red Apple Day, Giving Tuesday, Day Without Art Day.\n\nWednesday, Dec. 2: Fritters Day, National Mutt Day.\n\nThursday, Dec. 3: Make a Gift Day, Disability Day, Roof Over Your Head Day.\n\nFriday, Dec. 4: Cookie Day, Wear Brown Shoes Day, Bartender Appreciation Day, Cab Franc Day.\n\nSaturday, Dec. 5: International Ninja Day, Bathtub Party Day, World Soil Day.\n\nCheck back regularly for upcoming lists of international unofficial holidays.\n\nREAD MORE: Unofficial holidays: the weird and wonderful things people celebrate around the world\n\nDo you have something to add to this story, or something else we should report on?\n\nEmail: jenna.hauck@theprogress.com\n\nTwitter: @PhotoJennalism\n\nLike us on Facebook and follow us on Twitter.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-28 05:30:00-08:00",
    "title": "Unofficial holidays: Here’s what people are celebrating for the week of Nov. 29 to Dec. 5 – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/trending-now/unofficial-holidays-heres-what-people-are-celebrating-for-the-week-of-nov-29-to-dec-5/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}