{
    "authors": [
        "The Canadian Press",
        "Trending Now"
    ],
    "content": "Anticipated demand for Christmas trees has sparked a rush by some to purchase more trees wholesale\n\nCanadians planning to buy a live Christmas tree this season should start shopping now and expect to pay more, the Canadian Christmas Tree Growers Association says.\n\nFarmers anticipate 2020 will be a record sales year. Association head Larry Downey says it’s simple supply and demand: a shortage of trees coupled with a greater appetite from people hoping to liven up their living spaces amid widespread stay-at-home orders.\n\n“Personally, we don’t see COVID affecting us,” says Downey, whose family farm in Hatley, Que. sells up to 30,000 Christmas trees each year.\n\nMost wholesale farmers Downey has spoken this year with have already reached sales records, he added, with much of the demand coming from vendors in the United States. Retailers typically place their orders for trees as early as June, Downey says.\n\nThe Christmas tree market is still feeling the effects of the Great Recession, which put many U.S. growers out of business and led others to reduce planting. Since saplings take eight to 10 years to reach the size of a typical Christmas tree, the effects of the lower supply have only recently emerged.\n\nIn turn, the shortage has pushed prices upward. Downey says Christmas trees are retailing for about $5 more this year, continuing a trend that has been ongoing for several years. The average price of a tree rose 123 per cent to US$78 in 2018 from US$35 in 2013, according to the U.S. National Christmas Tree Association.\n\nPrices are on the rise in Canada as well. Stephane Bernier, who runs Plantation Bernier in Lac-Brome, Que., and Bronwyn Harper, who co-owns the Hillcrest Tree Farm near Ottawa, both say they have raised prices for Christmas trees this year.\n\nOn top of the shortage, tree sellers say they are expecting strong demand from consumers looking for an outdoor, physically distanced activity and who want to add some holiday cheer to their homes, where people are spending more time amid a second wave of Covid-19 cases. The pandemic has already led to some greater-than-expected spending in the home improvement market, a trend that could bode well for Christmas tree sales.\n\nSome tree varieties such as Fraser firs, prized for their pleasant fragrance and excellent needle retention, are even more sought after. Harper says she is selling Fraser firs for around $85 — or $20 more than last year — after her supplier raised prices. (Fraser firs can’t grow on her property because of the terrain, Harper says.)\n\nREAD MORE: Christmas will be different even if Santa is ‘probably’ immune to COVID, says B.C. top doctor\n\nThe anticipated demand for Christmas trees has sparked a rush by some retailers to purchase more trees wholesale.\n\nPhil Quinn, the co-owner of Quinn Farm near Montreal, says he had to buy additional trees from wholesalers to sell at his farm since he didn’t grow enough on his own property to meet the demand he expects this year. And Harper says she’s received many calls from people looking for wholesale trees, although she only sells to retail customers.\n\n“Everyone wants a tree and they want it now,” says Quinn, who expects to be sold out of trees by the second week of December.\n\nBut while demand for trees is expected to be strong, the pandemic has created its own set of challenges for tree vendors. Most sellers will not be able to offering the same set of attractions this year, with physical distancing requirements forcing farms to scrap additional draws such as wagon rides and fire pits.\n\nHarper says her biggest challenge this year will be developing clear distancing guidelines for people picking up trees. The farm’s owners won’t allow people to bring their dogs, for example, nor will they offer horse-drawn sleigh or wagon rides. Rather than serving hot apple cider, Hillcrest Tree Farm will be giving people treats to take away when they leave.\n\n“What might have been a one-hour visit will be a shorter visit this year,” Harper says.\n\nSimilarly, Serge Lapointe, the owner of Plantation JLS in Sainte-Angele-de-Monnoir, Que., says his farm won’t have anywhere for Christmas tree buyers to congregate this year, unlike in previous years when it offered visitors rides and the chance to take a photo with Santa Claus.\n\nOne aspect of the Christmas tree market to watch this year will be how lockdown orders affect how people buy trees, including whether they go in person to pick them up or order them online, says Paul Quinn (no relation to Phil Quinn), an analyst at RBC Dominion Securities who studies Christmas tree sales from year to year.\n\nRetail tree vendors could face some competition from large online players: On their websites, Home Depot and Walmart both list natural Fraser Fir trees for sale, available for delivery before Christmas. A search on Amazon’s website revealed no results for natural Christmas trees, although the company offers a variety of artificial trees for sale.\n\nBut Phil Quinn says people are looking to take advantage of the chance to pick out their own tree in person, noting his farm is seeing greater interest in its choose-and-cut option, even with Quebec at its highest COVID-19 alert level.\n\n“People are just asking for some kind of normalcy,” Quinn says.\n\nJon Victor, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nChristmasChristmas treeCoronavirus",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-01 12:10:00-08:00",
    "title": "‘Everyone wants a tree and they want it now’: Christmas tree sales on pace for record – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/trending-now/everyone-wants-a-tree-and-they-want-it-now-christmas-tree-sales-on-pace-for-record/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}