{
    "authors": [],
    "content": "When Muheim Elementary school took a procession to the Meadows for Remembrance Day to honour their Big Buddies they also brought them a letter with a picture and stories about themselves: their Little Buddies.\n\nLiliana Pesce, their teacher was told the residents gathered around the bulletin board, a board that they often ignore, drawing out and savouring the visit. Although they couldn’t party together a division that brainstormed found a way of caring and bringing excitement.\n\nTo support Brooke Richmond and Payton Ferguson’s Passion Project food-hamper-drive we can give a student going to that school some food to donate.\n\nLAST WEEK: Walnut Park Grade 6 students find their passions\n\nEach classroom will have a box for students to fill and send to the Salvation Army.They’ll join in the sorting of food under the guidance of the Salvation Army team.Brooke and Payton are also going to be part of the kettle program, ringing the bell and encouraging passersby to drop in some Christmas cash.\n\nKathy Ismond and I took a trip to Vancouver for a doctor appointment a few years ago.We stayed with friends, Pat and Sharon McGinnes in Langley.\n\nPat has been a lifelong member of the Lions Club and the night we arrived they were packing up an amazing box of Christmas gifts.They had been given a family to help out.\n\nMORE HARD COPY: Don’t stand under a heavily snow-burdened tree and swing a hammer at it\n\nThere were toys very specific to the age of the children along with an entire Christmas meal preparation.A gift certificate for a turkey, ham and fresh produce.A Christmas tablecloth with napkins and candles.Kathy and I had just done a Costco shop and were excited as we raced to our car: we knew we had something of value to contribute too, chocolates and candies.\n\nPerhaps the children of the parents given the hamper will remember a table set with pride and joy and with candles glowing.\n\nWith thoughts to share to help us through a Christmas in a COVID-19 pandemic please call me at 250-847-4414 or e-mail Sonja.lester.b.c@gmail.comThe deadlines for the 24th and 31st papers will be the 16th and 22nd respectively.\n\n\n\neditor@interior-news.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "Smithers finds ways to spread Christmas cheer amid pandemic – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/smithers-finds-ways-to-spread-christmas-cheer-amid-pandemic/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}