{
    "authors": [
        "The Canadian Press"
    ],
    "content": "The data from Royal LePage comes amid an overall uptick in home prices this year,\n\nA real estate sold sign is shown outside a house in Vancouver, Tuesday, Jan. 3, 2017. nbsp;Real estate brokerage Royal LePage says home prices are increasing in Canada’s cottage country, as more buyers look to move there full-time. THE CANADIAN PRESS/Jonathan Hayward\n\nHome prices are increasing in Canada’s cottage country as more buyers look to move there full-time, according to a report released Monday by Royal LePage.\n\nPrices of single-family recreational homes rose 11.5 per cent to an aggregate of $453,046 in the first nine months of the year, the real estate brokerage said.\n\nThe data from Royal LePage comes amid an overall uptick in home prices this year, after COVID-19 lockdowns stymied the spring buying season. A rush of demand and a limited supply as the economy reopened this summer and fall meant that home prices were up 15.2 per cent last month in Canada compared to a year ago, according to the Canadian Real Estate Association.\n\nRoyal LePage chief executive Phil Soper says the number of cottages, cabins, chalets and farmhouses on the market have also dwindled amid the increased demand, at least through September.\n\n“Inventory levels are the lowest I’ve seen in 15 years,” said Heather FitzGerald, a Royal LePage agent in Moncton, NB, in the report. While local buyers have moved away from cities and closer to nature, FitzGerald also noted an increase in buyers from Ontario and Quebec. Corey Huskilson, another Royal LePage agent quoted in the report and based in Halifax, said buyers from outside of the Maritimes, “who expect to be working remotely for the foreseeable future, are flocking to the area.”\n\nReal estate agents in 54 per cent of regions told the brokerage that there was a significant increase in buyers looking to work remotely at a cottage as a primary residence.\n\nEric Leger, a Laurentians-based agent, said in the report that Quebec’s lockdown periods “sparked an urgent desire for many city dwellers, in need of more living space, to relocate to the suburbs and cottage country.”\n\nAgents in other provinces noted similar trends, with one agent noting that Alberta-based buyers are competing with people across the country for properties in Canmore.\n\n“Highway developments have reduced the drive from Saskatoon to 1.5 hours, which makes working remotely more possible for those who still have to go into the office a few days a week,” said broker Lou Doderai in the report.\n\nThe report says retirees have also bid up cottage prices, with agents in 68 per cent of regions saying more retirees are buying cottages this year compared to last year.\n\n“Retiring baby boomers have been putting upward pressure on prices and reducing inventory for the last few years. Retirees are now finding themselves competing against remote workers,” said Bob Clarke, an agent in Ontario’s Muskoka region, in the report.\n\n“The most common question used to be ‘is the property West-facing?’ Now my clients’ biggest concern is internet quality.”\n\nREAD MORE: Calling all eccentric millionaires: ‘Schitt’s Creek’ motel up for sale for $2 million\n\nAnita Balakrishnan, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirusReal estate",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-30 12:05:00-08:00",
    "title": "Home prices rise in cottage country amid demand from remote workers, retirees – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/business/home-prices-rise-in-cottage-country-amid-demand-from-remote-workers-retirees/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}