{
    "authors": [
        "Thom Barker"
    ],
    "content": "Facebook event hopes to generate acts of kindness throughout the valley from Dec. 14 to 25\n\nNew Facebook group hopes to promote acts of kindness in the days leading up to Christmas. (Facebook graphic)\n\nThe organizers behind a new Smithers Facebook group and event is hoping their initiative will generate random acts of kindness throughout the Bulkley Valley in the days leading up to Christmas.\n\nAcasia Preston, who created the group, said a number of valley residents got together to promote the 12 Days of Kindness within the community to try to spread some joy over the holiday.\n\n“We’re living in a time where good news is hard to find and it’s so uplifting to see positivity within our community,” she said. “As cliché as it may sound, one act of kindness can truly make a difference.”\n\nEDITORIAL: Follow the golden rule\n\nThey are encouraging people of all ages to engage in acts of kindness and share them on Facebook (Smithers 12 Days of Kindness) and/or Instagram (Smithers_kindness).\n\nThe concept of the 12 days of Christmas kindness is not a new one. Events like this have been around for many years in numerous countries. In fact, there are learning aids for teachers and many downloadable materials including calendars available on the internet.\n\nPreston really wanted to bring it home, though, particularly this year.\n\n“I was inspired to create this initiative after feeling the heaviness of COVID-19, especially amid recent restrictions over the holidays,” she said. “It has been a challenging year for most of us but I know how powerful a simple act of kindness can be for those struggling — and let’s face it, we’re all struggling in some capacity this year.”\n\nShe said she has participated in random acts of kindness events before and found them to be very powerful.\n\n“I can remember times in my life when I have been struggling and a simple smile or compliment from a stranger truly brightened my day,” she said. “I think we all need brighter days right now. We all strive to be seen and heard, which is an especially difficult task during this pandemic.”\n\n\n\neditor@interior-news.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-11 10:05:00-08:00",
    "title": "Local group promotes 12 Days of Christmas Kindness – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/community/local-group-promotes-12-days-of-christmas-kindness/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}