{
    "authors": [],
    "content": "Need help getting moving? This service brings mobility aids and medical equipment to your door\n\nNorth Coast Home Medical Equipment in Terrace can help with funding paperwork, fittings and repair. They offer home delivery too!\n\nWhat’s stopping you from getting the medical equipment you need?\n\nIs it too expensive? Too complicated to get a referral? Too far to travel to find good service?\n\nNorthcoast Home Medical Equipment can help.\n\n“We provide services across Northwest Northern Health Region and deliver to our local First Nations communities on a weekly basis at no additional cost to our clients,” says Tracy Kinney, Store Manager at Northcoast Home Medical Equipment.\n\nIf you or a loved one needs a mobility aid, bathroom safety equipment, or a hospital bed, Kinney and the team at Northcoast Home Medical Equipment can help. This spring they also started selling personal protective equipment like masks and gloves, connecting remote community health stations to a secure supply to help prevent the spread of COVID-19.\n\n3 ways Northcoast Home Medical Equipment makes life easy\n\nHome visits and free delivery: Northcoast Home Medical Equipment delivers from Houston to Haida Gwaii, and that’s not all. “We provide services within the Northwest Northern Health Region, including our local First Nations Health Centres on a weekly basis,” Kinney says. Need to purchase crutches in Kispiox? Installing a bathroom grab bar in Gitanyow? Servicing a scooter in Haisla Nation? Northcoast can deliver weekly to most communities, and visits more remote communities on Haida Gwaii as required.\n\nNorthcoast Home Medical Equipment delivers from Houston to Haida Gwaii, and that’s not all. “We provide services within the Northwest Northern Health Region, including our local First Nations Health Centres on a weekly basis,” Kinney says. Need to purchase crutches in Kispiox? Installing a bathroom grab bar in Gitanyow? Servicing a scooter in Haisla Nation? Northcoast can deliver weekly to most communities, and visits more remote communities on Haida Gwaii as required. Funding Paperwork: “We work closely with our local health professionals to obtain the correct documentation for our clients, we submit all the paperwork to achieve approval and bill the funding agencies directly. This helps limit what clients have to pay up front to obtain their equipment,” Kinney says. It can be complicated to navigate prescriptions and paperwork for First Nations Health, ICBC, WorkSafe, Veteran Affairs Canada and other agencies, but Northcoast Home Medical Equipment can take care of it all. Don’t qualify for coverage? They also offer financing, so you can pay for supports in manageable instalments.\n\n“We work closely with our local health professionals to obtain the correct documentation for our clients, we submit all the paperwork to achieve approval and bill the funding agencies directly. This helps limit what clients have to pay up front to obtain their equipment,” Kinney says. It can be complicated to navigate prescriptions and paperwork for First Nations Health, ICBC, WorkSafe, Veteran Affairs Canada and other agencies, but Northcoast Home Medical Equipment can take care of it all. Don’t qualify for coverage? They also offer financing, so you can pay for supports in manageable instalments. Fitting, repairs, and trials: “We have certified sales and service technicians who will travel to your community for repairs, trailing and fitting, at no additional cost,” Kinney says. The shop has certified compression fitters, mastectomy fitters and bracing fitters who will measure you for a perfect fit and work with your physical therapist or health care worker to find a solution that works for you. Have an issue with your walker, home hospital bed or lifting device? Northcoast Home Medical Equipment offers repairs to get your equipment back in service.\n\nCall Northcoast Home Medical Equipment at 866-638-1301 to see how they can help you with equipment purchases and rentals, or email northcoast@nchme.ca. Visit the store at 4712 Keith Ave. in Terrace, or give them a call to find out when they’ll be visiting your village.\n\nBC HealthHealth and wellnessmedical devices",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-09-14 06:00:00-08:00",
    "title": "From Skidegate to Kispiox: FREE home assessments and deliveries for medical equipment – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/marketplace/from-skidegate-to-kispiox-free-home-assessments-and-deliveries-for-medical-equipment/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}