{
    "authors": [],
    "content": "Coastal GasLink has implemented a first-of-its-kind program to enhance the experience of workers – one that places respect for workers, communities and the surrounding environment as a fundamental way of life.\n\nCoastal GasLink’s approach to workforce lodges has always been to provide a healthy and safe home-away-from-home for its workers. But equally important has been the relationship between the project, its workers and neighbouring communities. That is why Coastal GasLink recently implemented the unique program within its lodges.\n\nKnown as the Community Workforce Accommodation Advisor (CWAA) Program, the program is employing members from neighbouring Indigenous communities as advisors to lead programming that promotes inclusion and fosters a deeper understanding of the rich cultures and traditions of Indigenous communities.\n\nLorisha Desjarlais, a Saulteau First Nation member and one of the program’s coordinators, shared its significance to her. “So often our Indigenous communities have been excluded from big projects. In my dad’s generation, Indigenous communities were seen as just the labourers for the project, never the manager or leaders. Coastal GasLink is different. Our advisors get to bring their cultural experience to a project. This a really different approach for a major project to take.”\n\nSimilarly, Denine Gosselin, another one of the program’s coordinators, knows firsthand the opportunities and challenges that come with large-scale projects like Coastal GasLink. For her, she sees the program as a way to leave a positive legacy by fostering respectful and inclusive relationships between workers and the communities along the project route.\n\n“I’ve been in this industry for over 20 years,” says Denine, “and it is important to me that we make sure that anyone who wants a job in this industry has a safe and inclusive experience. We have an opportunity to leave a positive legacy for all and I am proud to be working with Coastal GasLink to make sure everybody feels safe and to foster transparent communication with our neighbours,” says Denine.\n\nWhether it’s through jam sessions, trivia, traditional food, or nature walks, Program advisors are implementing creative ways for workers to develop a stronger understanding and relationship with the land and people around them. The pandemic has also led advisors to adapt to using videos and other platforms to share their culture with everyone in the accommodation.\n\n“With the COVID-19 measures in place, we are looking at opportunities to support not only physical health, but the mental health of our workers. We know that by providing opportunities for people to come together, share their time together, and participate in activities, we are contributing to a healthy workforce,” shared Denine.\n\nVisit CoastalGasLink.com to learn more about the health and safety measures in place at Coastal GasLink’s workforce accommodations, as well as the project’s commitment to working with Indigenous communities.\n\nenergy sector",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-09-14 06:00:00-08:00",
    "title": "Community advisors promote safe and inclusive workforce lodges – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/marketplace/indigenous-advisors-promote-safe-and-inclusive-workforce-lodges/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}