{
    "authors": [],
    "content": "We are now in the month of December and in our moods for giving. If you know of someone who is a gardener and would like to surprise him or her with that “perfect gift,” the following is what I would suggest.\n\nI was looking on the internet to find out what is available in our local stores regarding gardening tools. I was specifically looking for certain kinds when it amazed me to find most of the garden tools offered came with short handles.\n\nI will any day respect a person who likes to work on their knees, but for me, a tall person, as well getting to that age where it is much easier to get down than up, not so good\n\nLAST WEEK: Some tips on African violets and more petunia stories\n\nSo, for a moment let’s reflect on short-handle garden tools. During my gardening experience in Greater Victoria, I would be maintaining the common area around some apartment buildings, it was my enjoyment to glance up and see how some of the tenants had the most fantastic flower show from their balcony boxes. In this case, it would be appropriate to use tools with short handles.\n\nNow back to that “perfect gift.” In my collection of gardening tools, are two I use the most, a four-tine cultivator and a trenching shovel.\n\nThe cultivator is useful for many jobs, but I want to tell you the most important. If you have a big cluster of weeds, by dragging the cultivator through the weeds, you can pull out the weeds and leave the soil behind.\n\nMORE GARDENERS CORNER: Christmas cacti and a sidestep into Advent wreath-making\n\nThe trenching shovel has a blade width of five inches and is v-shaped with handle length of 48 inches, just perfect for nearly all your weeding jobs standing up. These tools are also available at our local feed store.\n\nI have turned one of my bedrooms into a cold frame, with shelves for flats and several overhead grow lights. This is properly the most important space to have when planning to grow your oven bedding plants, where you can control the temperature.\n\nThis is where I have the geranium cuttings, now plants, I transplanted a month ago. They have flowers that I will trim back, to allow the new geranium plants to focus on making roots.\n\nIt you have any questions, or suggestions for topics, please email me: e.jacobsen85@yahoo.com.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "What to get your favourite gardener for Christmas – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/what-to-get-your-favourite-gardener-for-christmas/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}