{
    "authors": [],
    "content": "If you’re among the millions of Canadians receiving CERB benefits or payment relief, you may wonder how you’ll cope with your debts this winter. Start by talking about your debt, and exploring solutions, says Leah Drewcock, senior vice-president, MNP Ltd.\n\nMany Canadians are struggling to meet their financial obligations during these uncertain times. Others may be feeling the calm before the storm because they have been able to tap into the temporary relief provided by governments and financial institutions, such as:\n\nCERB benefits (Approximately $70 billion has been paid to Canadians as of Aug. 16, 2020).\n\nFlexible loan payment options or interest relief for debtors facing financial difficulties.\n\nCanada Revenue Agency extending the 2019 income tax payment deadline to Sept. 30, 2020.\n\nFederal government’s next phase of COVID-19 income support for individuals.\n\nThese temporary relief measures are meant to help Canadians support their families and meet their obligations during very uncertain times. They are not permanent solutions, nor do they remove the stress of the financial burden that existed before the COVID-19 pandemic.\n\nStart thinking long-term\n\nIf you are already struggling to make minimum payments, deferring those payments could simply delay the inevitable. If you couldn’t pay your debts before, it’s unlikely much will change when government supports run out, personal income taxes become due, and payment deferrals expire.\n\nIf you are one of the over four million Canadians receiving CERB benefits — or the millions of others receiving payment relief — you may start wondering whether you will be able to cope with your debts this winter.\n\nThe best way to manage the struggle is to start talking about it and begin looking for long-term solutions. You need to get off the hamster wheel of continually wondering where the money will come from to pay your debts. You need to get past the stress and the uncertainty of keeping your head above water and toward putting your feet on dry land.\n\nProfessional advice is available, whether you want to talk about your debts or the steps you can take to become debt-free. Start by scheduling a free consultation with a Licensed Insolvency Trustee (LIT) today.\n\nDuring this no-obligation initial meeting, the LIT will review your financial situation and identify opportunities to manage your debt and solutions to overcome it for good. They will outline all the options available to you.\n\nWhether you qualify for a Consumer Proposal, Bankruptcy, or would be better served by another financial management strategy — an LIT will make sure you have all the information you need to manage your finances and remove your financial stress.\n\nTo learn more about the options available to manage your debt, schedule a Free Confidential Consultation with Leah Drewcock, CIRP, LIT, at 250-596-4901 or leah.drewcock@mnp.ca\n\n*According to canada.ca statistics delivered by Service Canada and the Canada Revenue Agency.\n\nDebtFinances",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-09-07 06:00:00-08:00",
    "title": "Finding financial solutions in uncertain times – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/marketplace/finding-financial-solutions-in-uncertain-times/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}