{
    "authors": [],
    "content": "Terrace-Kitimat Airport stayed open throughout the COVID-19 pandemic, providing safe, clean travel to those who needed to fly for essential reasons. YXT is the gateway to Northwestern communities.\n\nWhen the world slowed down, the Terrace-Kitimat Airport Society stepped up.\n\nAs the COVID-19 pandemic took hold and non-essential travel was cancelled to keep everyone safe, most airports in Northwestern BC closed their doors. But some travel was essential, and YXT was there to help. Emergency medical procedures, supply chains and community supports had to continue throughout the pandemic, and airlines needed a central hub to rely on.\n\n“Even though our numbers are low, we’ve stayed open throughout the pandemic to service the Northwest,” says Airport General Manager Carman Hendry.\n\nThe airport continues to take COVID-19 seriously, with extra janitorial cleaning and other safety protocols. The recently-completed terminal expansion project means there’s extra space for physical distancing, creating a safe and healthy atmosphere for travellers.\n\nCentralized services\n\n“With the regional hospital identified by the province as the base for any COVID-19 cases, we’re a real hub for essential services,” Hendry says.\n\nCommercial airlines chose the Terrace-Kitimat Airport as a gateway to Northwestern communities, and Hendry and his team answered the call.\n\n“Even though we lost 95% of revenue we continued to do this for the safety of the public,” he says. “Medical appointments and essential travel all moves through YXT.”\n\nAs provincial health authorities slowly open up, the airport is opening up with them. Now that the province is re-starting some non-essential surgeries and medical appointments, the airport is poised to serve those in need.\n\nGateway to the Northwest\n\nThe Terrace-Kitimat Airport location south of the Skeena River was originally chosen for strategic military reasons, and now the location is convenient for residents across the Northwest.\n\nCentral: strategically located to serve Haida Gwaii, Prince Rupert, Kitimat, Terrace, Smithers and surrounding communities.\n\nAccessible: well-connected on major roadways, with no extra ferry to add to your trip\n\nConvenient: ample parking for a brief stay or a long trip\n\nThe airport takes its responsibility as regional hub seriously, and asks travellers to do their part to keep everyone safe. Anyone visiting the airport who is not a passenger is asked to stay in their vehicle to reduce traffic inside the terminal. For the latest information on flights and safety protocols, visit yxt.ca.\n\nairportsCoronavirus",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-06-29 06:00:00-08:00",
    "title": "Terrace-Kitimat Airport provides essential service through crisis – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/marketplace/terrace-kitimat-airport-provides-essential-service-through-covid-19-crisis/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}