{
    "authors": [],
    "content": "By Steve Smyth\n\nI have worked on the Southside for over 20 years and pass the old mill site, and site of the proposed Inland Port daily while looking at cracked pavement, weeds, bent fence posts, contaminated soil, and garbage. This, some people would have us believe, is the “Heart of Terrace”.\n\nIf one exists physically, the heart of our community is George Little Park and the 4600 /4700 blocks of Lakelse Ave., Lazelle Ave. and Park Ave. It is where we shop, go to market and where we gather to celebrate.\n\nDue to the City’s lack of tax revenue, the heart of this community is on life support. With no industrial tax base, our small businesses are forced to pay ever higher tax rates while they already pay some of the highest tax rates in BC. Who are Terrace’s “cash cows”? Wal-Mart, Canadian Tire, and a closed casino. If you add all these taxpayers together, you get in a year what our neighbours in Kitimat get in a month from Rio Tinto. The truth is that the City of Terrace can’t afford to rebuild more than a few blocks or two of crumbling infrastructure every year, far less than need doing just to keep up.\n\nIf the downtown core is the heart, then Keith Avenue is the artery that moves things in and around Terrace. Between Frank Street to the West, and Wal-Mart at the East, there are only 3 residential homes. The rest is made up of glass and tire shops, industrial supply places, bulk plants and car dealers, all the very definition of an industrial neighborhood. For opponents to suggest that this isn’t the right place to house a business like the inland port doesn’t reflect existing reality.\n\nThe official community plan (OCP), that opponents are complaining would be violated by the inland port development, resulted from a series of meetings and poster board shows produced by a consultant in 2014. The planning behind it suggested that by now, the City industrial lands at the airport would be more than half full, along with two LNG builds in Kitimat and another in Prince Rupert. Terrace was to be a boom town with commercial and residential space at a premium. Thus, “Whistler by the Tracks” was born, featuring shingled post and beam shops, with additional housing on the second floors.\n\nWhile it all looked pretty, a few key facts were omitted. The first being that the then owner of the property had little to do with the process and did not support the outcome. The second is that Terrace is not short of commercial or residential space for construction. Additional retail spaces placed in any Keith Development would likely be the death blow for downtown, creating a donut of retail around a decaying core. The good thing about planning is that it can be changed, depending on circumstances, it is not a hard and fast plan, written in concrete.\n\nKeith Ave. should also be a designated truck route through Terrace, thereby eliminating or reducing the interface between commercial trucks and passenger vehicles. Having the Inland Port on the former mill lands also helps keep commercial traffic off the rail crossing span of the Sande overpass, thereby increasing safety.\n\nA few well organized opponents believe that the land is our last chance for a renaissance in Terrace, a chance to move away from our “dirty” industrial past, suggesting that the site is a bad location. I suggest that the property is ideally suited to support the inland port proposal and attract additional ancillary businesses along with the tax revenue and jobs that come with them and building on Terrace’s reputation as the service and supply center of the northwest. Keith Ave. is an industrial area and should remain one.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-10-24 12:48:00-08:00",
    "title": "OPINION: Mill site is good location for inland port – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/opinion/opinion-mill-site-is-good-location-for-inland-port/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}