{
    "authors": [],
    "content": "By Ekamjit Ghuman\n\nSpecial to Black Press Media\n\nTuesday, Oct. 6 is World Cerebral Palsy Day. Cerebral palsy (CP) is a common permanent physical childhood disability which affects an average of one in every 700 individuals. It is estimated that there are 17 million people living with CP worldwide.\n\nAlthough the disability mainly affects movement, individuals with CP can also have hearing, visual, speech, learning, epilepsy and intellectual impairments.\n\nThere are four types of CP (spastic, dyskinetic, ataxic and hypotonic, and some individuals can have more than one type) and it can affect different parts of the body.\n\nFor example, spastic CP is the most common form of CP in which the muscles appear to be stiff and tight.\n\nA person’s CP can affect one arm and one leg on one side of their body (referred to as spastic hemiplegia/unilateral), both legs (referred to as spastic diplegia/bilateral) or both arms and legs as well as the trunk, face and mouth (referred to as spastic quadriplegia/bilateral). Even though CP is a lifelong disability that has no cure, individuals living with CP are resilient and can still live the lives of their dreams.\n\nI was born with CP.\n\nMy CP affects my hand co-ordination, speech, vision and ability to walk. Over the years I have accomplished many dreams with my disability.\n\nFor instance, during the early years of my childhood, I successfully learned how to walk with the use of a walker. I also learned how to write, despite the fact that my writing appears sloppy, resembling that of a child. I even completed my undergraduate studies due to the unconditional support I received at home and at school.\n\nThroughout my childhood and adolescence I was encouraged and empowered to unleash my potential and pursue my dreams as long as they were reasonable and permitted by my CP. Therefore, I spent my childhood and adolescent years dreaming of a career that would enable me to one day purchase an apartment as well as to travel to the places on my bucket list, such as Amsterdam, Havana and Bali.\n\nHowever, as a person with a disability, I face challenges in being accepted for who I am by the community at large. To illustrate, at times if I walk into a store, a restaurant, an office or a religious place of worship, I am stared at or am a victim of rude and hurtful remarks and questions. People see me as different and unable; not as just another individual.\n\nFinding employment proved one of the biggest challenges.\n\nAfter completing my Bachelor of Business Administration from Simon Fraser University in 2014, I embarked upon my search for an employment opportunity like other new graduates, unaware that the next five years would unravel into the biggest struggle of my life.\n\nI felt as if my life had come to a halt. While my fellow graduates were moving forward in their careers, I was struggling daily to not only find an employment opportunity but also to remain hopeful.\n\nTo help increase my prospects of finding a job, I volunteered at several non-profit organizations to gain work experience and enrolled in Kwantlen Polytechnic University‘s Post Baccalaureate Diploma in Human Resources Management (which I completed in 2017) to further enhance my knowledge, skills and abilities; but still, no job.\n\nWhile struggling to find a job, I experienced a myriad of emotions which included anguish, anxiety, despair, envy and fear and sometimes even cried myself to sleep as my dreams, ambitions and aspirations were in peril.\n\nYet, I was aware that I could not lose hope and hence, continued to struggle to find work as I keenly believe that my CP should not deter me from pursing my dreams. There were people in my life who understood my struggles and thankfully they continued to offer words of hope and encouragement.\n\nIn the fall of 2019, I finally received my first job offer which I quickly accepted.\n\nThough it took me five long years to find my first employment opportunity, I was fortunate to find a position in which I work with several individuals who are accepting, understanding, supportive and accommodating of my disability.\n\nThe ability to assist my boss in accomplishing her goals and objectives as well as make a meaningful contribution to British Columbia is gratifying and rewarding.\n\nIn the upcoming years I desire to remain a part of the workforce so that I can continue to make meaningful and viable contributions to our community while I continue to pursue my dreams.\n\nWorld Cerebral Palsy Day aims to create awareness of the disability.\n\nAwareness of CP is imperative because society broadly needs to overcome biases about disability and work towards making positive changes such as creating inclusive educational and employment opportunities for people with CP.\n\nBy helping to create awareness about CP, I hope to see us transition towards becoming a society that is not only accepting and understanding of individuals with disabilities but also one that encourages and empowers people with disabilities to unleash their potential and pursue their dreams.\n\nColumn",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-10-06 06:00:00-08:00",
    "title": "GUEST COLUMN: Life with cerebral palsy full of triumph and tribulations – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/opinion/guest-column-life-with-cp-full-of-triumph-and-tribulations/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}