{
    "authors": [],
    "content": "By André Carrel\n\nA state assuming responsibility for the social welfare of its citizens is a welfare state. By this definition, and with public programs such as medicare, employment insurance, pensions and more, Canada is a welfare state. In ordinary times a desire to expand the welfare state’s public services (e.g. pharmacare and daycare) is debated within the purview of economic dogma.\n\nWhen the state’s established social services are tested under extraordinary conditions, flaws and shortcomings in established programs are exposed, and governments scramble to execute ad hoc responses.\n\nSome of our programs, public health services in particular, performed with distinction. Surging demands called for more money and staff, but their organizational foundation was equal to the task.\n\nThe same cannot be said of programs intended to provide economic security for citizens. We have a hodgepodge of economic assistance programs, from employment insurance to food banks.\n\nSome programs, e.g. Old Age Pension, are universal, while many, if not most, are conditional, subjected to a multitude of rules more concerned with preventing abuse than with ensuring that citizens have an adequate economic foundation.\n\nHealth services are provided, unconditionally, to smokers, alcoholics, reckless drivers, and drug addicts just as they are to those whose lifestyle is beyond reproach. We would not accept a public health system that denied quality treatment to smokers, leaving them to cope as best they can in their search for their own cure.\n\nI am not aware of statistics that document the share of our public health care costs attributable to individual lifestyle and behaviour choices, but I suspect these costs to be significant.\n\nFrom the onset of the pandemic, our socio-economic programs did not have the capacity to respond as effectively as did our health services. It was not just a matter of increasing budgets for employment insurance and social assistance programs. Their inability to meet surging needs was predicated by the limits of their core principles.\n\nTheorists and practitioners across the political spectrum have for years debated and written about the idea of a guaranteed annual income as an effective way to end poverty.\n\nThe title of retired Conservative Senator Hugh Segal’s book on the subject, “Bootstraps Need Boots”, was gleaned from Dr. Martin Luther King Jr.’s writings on the subject.\n\nFrom the $300 tax-free handout to every senior citizen to the scandal plagued and aborted WE student volunteer program, governments – federal and provincial – struggled to avert the likelihood of economic ruin for millions of citizens.\n\nThe glaringly obvious lesson from this is that we ought to plan and establish an economic safety-net program along the principles proven to be effective in the delivery of public health programs.\n\nAn effective but inefficient government program is as costly and useless as is an efficient but ineffective one. Effectiveness and efficiency are interdependent attributes. Government programs need to be both.\n\nAbuse, be that exploitation or corruption, is a human failing. We do not allow this fact to detract us from our health services objectives. (We do not allow chain smokers to derail our medical care program objectives). Why do we allow the presumption of abuse to preclude a national income security program?\n\nWe can avoid the cost and turmoil of improvised hope-for-the-best programs when the next pandemic hits. Planning for and implementing a national guaranteed annual income program: that is a COVID-19 pandemic lesson we should not ignore.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-09-17 08:41:00-08:00",
    "title": "OPINION: Social safety net needs reinforcement – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/opinion/opinion-social-safety-net-needs-reinforcement/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}