{
    "authors": [],
    "content": "By Steve Smyth\n\nWhen Fox News personality Laura Ingraham told basketball superstars Kevin Durant and Lebron James to “shut up and dribble” after criticizing President Donald Trump, James welcomed the rebuke.\n\n“The best thing she did was help me create more awareness. I get to sit up and talk about social injustice [instead of basketball],” he said.\n\nIn the 1960s, Cassius Clay was stripped of his boxing championships, arrested and convicted for refusing to be drafted into the US Army for service in Vietnam. Converting to Islam and changing his name to Muhammed Ali, he spent four long years of his boxing prime fighting the conviction before it was overturned by the US Supreme Court.\n\nThe tradition of athletes protesting social and racial injustice can be traced back to at least 600 AD and the Greek Olympics. In the past weeks we’ve seen the cancellation of tennis matches, men’s and women’s basketball games and a bit later, NHL playoff games. While there are hundreds of cases of black, gay and female athletes and celebrities using their visibility and fanbase to effect social change, this latest round of boycotts and cancellations have taken on a much broader base across the sporting world.\n\nPredictably, reaction has been swift, mixed and sometimes virulent. On my own social media feeds, people who I thought sensible are foaming at the mouth over the loss of their nightly entertainment. They are outraged that highly paid athletes who hold such sway and influence over society would have the temerity to use that influence for social change.\n\nIt seems strange that we accept athletes using their popularity and celebrity to sell shoes and cars but are horrified when they try to change the world using the same means. Do we expect them to exist in a bubble, only concerned with their sport and somehow not concerned about the world in which they live and raise their families?\n\nThat people of colour in the US are being killed by the very people who are supposed to protect them is beyond doubt. To the phrase “Black lives matter” you retort, but don’t all lives matter? This is like going to a cancer fundraiser and protesting that all diseases matter or protesting that the fire department is only protecting the houses that are actually on fire. After all, don’t all houses matter? Why is debating racism in 2020 even a thing?\n\nUsing “all lives matter” sidetracks the critical discussion we need to have about how the Black and Indigenous communities are affected by racism in our society. It’s almost impossible to argue with people who are determined to be close-minded and set in their ways. You can construct the best argument possible; you can counter with statistics and you can confront people with the truth, but if they don’t want to listen, then maybe they won’t ever learn. Some of these people, especially buttressed by the anonymity of social media, seem to enjoy being the Devil’s advocate and countering with what they perceive to be reality. They don’t want to be bothered by facts and just want to watch basketball/football/hockey instead, and I guess that’s okay, too.\n\nWhat is not okay is pretending that the same people you admire and, in some cases, emulate for their athletic ability have no right to use their position and power in society to affect change.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-09-10 08:38:00-08:00",
    "title": "OPINION: Athletes have the right to voice opinions – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/opinion/opinion-athletes-have-the-right-to-voice-opinions/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}