{
    "authors": [
        "Jake Wray"
    ],
    "content": "Social network threatens to ban news in Australia, same could happen here\n\nCan Terrace quit its Facebook habit?\n\nLike many rural communities in B.C., Terrace relies on Facebook as a default communication platform.\n\nEveryone uses it to send private messages. It’s the go-to site for private buy and sell. It’s the main platform for discussion and debate about community issues, event planning, and business communication.\n\nCity council meetings are livestreamed on Facebook — in fact, committee of the whole webcasts are only available on Facebook, as the City neglects to upload those to its own site like it does with regular council meetings. Even The Terrace Standard relies on Facebook to reach much of its audience.\n\nBut Facebook is not a safe, neutral platform. It’s well-documented that Facebook’s algorithm is optimized to grab viewers’ attention by any means necessary. Outrage, Facebook has learned, drives engagement, and the platform is designed to stoke outrage for profit. This contributes to the polarized, brutal political climate of 2020.\n\nFacebook has access to any private message sent through its messenger. Those messages are routinely data-mined. Certain Facebook employees have the power to read any message they wish (and have been caught doing so multiple times).\n\nFacebook has admitted to running predictive algorithms on a huge number of messages attempting to determine, for example, if machines can predict using messages whether a person is a drug dealer, which is so 1984 that I can’t even.\n\nFacebook has repeatedly ignored or failed on act on evidence of its platform being used to manipulate political outcomes across the globe according to a recently-leaked memo written by a former Facebook data analyst, Sophie Zhang.\n\nAs you can see, I’m a longtime Facebook opponent. Most of my friends have heard me rant about this after a drink or two.\n\nI don’t use it in my personal life and I am perturbed that I’ve had to resume using it for professional purposes since I started working at The Standard.\n\nI’m trying not to be unreasonable about it. I understand the incredible convenience that Facebook offers. There’s a reason it has been adopted so comprehensively in our region. It does make my job much easier.\n\nBut recently, Facebook took a step too far. It has threatened to block Australian news organizations and regular users from sharing news articles on the platform, in response to a proposed Australian bill that would force Facebook to compensate news organizations for news content shared on the platform.\n\nThat’s a grave threat, considering the information monopoly Facebook controls.\n\nIt makes me wonder; if Terrace Standard articles were banned from Facebook, would the people of Terrace seek out alternative means of reading, sharing, and commenting on our news?\n\nWe aren’t perfect, but we care about our community and we do our very best to serve you. I hope you would follow, but I would understand if you didn’t.\n\nThis leads me to another question. If Terrace were able to abandon Facebook in favour of a neutral, ethical social media platform, what effect would that have on our community? Would we see as much disrespect and fury in discussion of local matters?\n\nI acknowledge there will be some degree of that on any online platform, but Facebook nurtures and encourages negativity.\n\nI wonder if the bitter disputes like those that flare up on the Terrace Community Bulletin Board group would be present on a different platform.\n\nThere aren’t many ethical alternatives right now. Some do exist, such as the non-profit diaspora* social network project, but they are essentially devoid of users, and a social network isn’t much use without any people on it.\n\nI think we’re stuck with Facebook for now, but I challenge and encourage each of you to begin searching for alternatives, and to constantly question the impact of this ghoulish social network. The soul of our community is at stake.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-09-24 15:05:00-08:00",
    "title": "OPINION: Facebook has taken one step too far – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/opinion/opinion-facebook-has-taken-one-step-too-far/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}