{
    "authors": [
        "Katya Slepian"
    ],
    "content": "A man wearing a face mask to help curb the spread of COVID-19 walks in downtown Vancouver, B.C., Sunday, Nov. 22, 2020. The use of masks is mandatory in indoor public and retail spaces in the province. THE CANADIAN PRESS/Darryl Dyck\n\nB.C. is reporting 834 new COVID-19 cases and 12 new deaths as of Wednesday (Dec. 2), according to provincial health officer Dr. Bonnie Henry.\n\nBy region, that breaks down to 529 in Fraser Health, 174 in Vancouver Coastal Health, 66 in Interior Health, 20 in Island Health and 45 in Northern Health. Three of the new cases are epi-linked.\n\nThat brings the total death toll to 469. Total cases have reached 34,728, of which 8,941 are currently active. There are 337 people in hospital with the virus, of whom 79 are in ICU or critical care.\n\nThere are currently 54 active outbreaks in long-term care and seven in acute care, with a total of 1,472 people affected. Of those, residents make up just over one-third of cases.\n\n“We are continuing to see unchecked transmission,” Henry said.\n\n“The need to follow provincial health orders is so important.”\n\nThe province has hired 161 new contact tracers in the past week, with a total of 1,096 of the at-least 1,200 that Health Minister Adrian Dix said the province plans to hire.\n\nHenry said that the news that the U.K. had become the first country to approve the Pfizer vaccine was a good sign. However, she noted that it would be “some time yet before we get there.” The province is working to finalize its immunization framework to be ready to roll out the vaccine, expected in the first weeks of 2021.\n\nDix said that B.C. is speaking with the Red Cross and speaking with the Department of National Defence on the logistics of rolling out the vaccine.\n\nThere are no mandatory immunizations in B.C., and Henry said that will continue with the COVID-19 vaccine. However, for people who work, or visit, in long-term care the province will be “strongly encouraging” vaccination against the novel coronavirus.\n\nREAD MORE: Indoor adult sports teams banned, deemed too risky as B.C. battles surge in COVID cases\n\nThe provincial officer urged everyone to continue to “stay local, stay small” and to avoid crowded spaces.\n\nGatherings and events of any sort are banned in B.C. until Dec. 7 but Henry acknowledged that extending that order “is something that we’re looking at.”\n\nEveryone in B.C. is being asked not to travel unless it is for medical or essential reasons, whether within B.C. or outside of the province.\n\n“We need to stop right now,” Henry said, noting an example of a sports team that travelled outside of B.C. and led to dozens of COVID exposures.\n\nREAD MORE: Hockey team brought COVID-19 back from Alberta, B.C. doctor says\n\nHenry said that it was okay if a loved one returned home for the holidays, but that this person needed to stay within the household and follow all public health orders.\n\n“I cannot stop you by an order from getting into your car or on a plane but I am asking you in the strongest terms,” she said.\n\nHenry acknowledged the difficulties of not travelling and a lack of holiday events as the season nears.\n\n“All of these things we love to do are on pause,” she said. She urged people to get outside, safely, and get fresh air and exercise as the winter months descend on B.C.\n\nSome activities, like hot yoga, spin classes and high intensity interval training are on pause indefinitely, while guidelines are expected for other indoor group fitness activities next week.\n\nHenry acknowledged that there are people who have flouted the rules and that establishments have been shut down and those responsible fined.\n\nBut she said that it was a “very small, if visible and vocal” minority of British Columbians who are breaking the rules.\n\n“I know these restrictions put an added burden on what is already a difficult time for us, and they seem never ending,” Henry said.\n\n“We’ve done a lot… and I’m asking everybody to do a little bit more to protect those we are closest to.”\n\nREAD MORE: B.C. tourism relief coming soon, Premier John Horgan says\n\n@katslepian\n\nkatya.slepian@bpdigital.ca\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirusvideo",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-02 15:05:00-08:00",
    "title": "834 new cases, 12 new COVID-19 deaths as B.C. works on immunization strategy – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/news/834-new-cases-12-new-covid-19-deaths-as-b-c-works-on-immunization-strategy/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}