{
    "authors": [
        "Thom Barker"
    ],
    "content": "Station partners with The Learning Shop and Houston Community Services with funding from Radio Fund\n\nCICK community outreach specialist Meghan Brady, left, station manager Glen Ingram and Angelique Batley of Houston Community Services celebrate the inception of a Smithers Community Radio satellite podcasting studio in Houston. (Contributed photo)\n\nSmithers Community Radio is getting ready to also become Hazelton and Houston Community Radio.\n\nCICK 93.9 FM announced last week it had entered into partnerships with Hazelton’s The Learning Shop and Houston Community Services to create satellite podcasting studios in those two neighbouring towns.\n\n“We are excited to hear what our neighbouring communities of Hazelton and Houston sound like and look forward to vibrant volunteer programmers who will share their voices and passions for the benefit of our region,” said Glen Ingram, CICK station manager.\n\nREAD MORE: CICK buys Lions rail car\n\nThe station received funding for the equipment from the Community Radio Fund of Canada and is currently accepting applications from prospective radio programmers in those communities.\n\nInterested parties will receive training from a current member of CICK staff or other volunteer programmers.\n\nMembership in the Smithers Community Radio Society is $20 per year.\n\nDetails are available on the station’s website and Facebook page or by calling CICK community outreach specialist Meghan Brady at cickmeghan@gmail.com or 250-847-8769.\n\n\n\neditor@interior-news.com\n\nLike us on Facebook and follow us on Twitter\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "Smithers Community Radio expands to Hazelton and Houston – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/community/smithers-community-radio-expands-to-hazelton-and-houston/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}