{
    "authors": [],
    "content": "Here we go!\n\nDecember is on the calendar. What a way to start. Clear skies and plus temperatures. No virus talk until later in the day. Friends here for coffee. Fallen trees cleaned up. Soup delivered to the door. Even my old vacuum was fixed and now can proceed to do what it must. I had some trouble walking the old dog. Had a bad knee, and other parts, but we went anyway. Beautiful.\n\nBy the time I got home I thought I would have a cup of tea before I put some wood in the stove. I sat in my chair in front of the TV, turned on the yule log channel and fell asleep. What woke me up? Could be that I was drooling.\n\nOr it could have been the hot tea running down my pants.\n\nLAST WEEK: Young dad grateful and positive despite hardship\n\nI changed course and put on another channel. Advertisements of course. I was enticed to enjoy a group of older women wearing fancy underwear. Over 50 years old I was told. Really? Would I gather with those ladies just to show off my panties?\n\nWhen my old Al died, I wore his briefs for some time. The open part to the back for just in case.\n\nNext ad for me was to see people who would listen to a command from an exercise coach that was in a mirror. Each to his own I suppose.\n\nFood deliveries, a new bed and more underwear. The skin tight underwear did not have any wedgies. Now isn’t that special?\n\nMORE SPICE OF LIFE: COVID offers rare insight into others lives, but how real is it?\n\nMust have been very interesting ads or maybe it was the update on the virus situation that kept me awake. Certainly snaps a person back to reality. With many who feel the whole pandemic is a hoax or that wearing a mask is an infringement on our freedom just saying the COVID virus is not real does not make it so.\n\nMany of us know of folks who have died, others became very ill. We might know of a person who had lost a business or suffers from food insecurity.\n\nI will not turn away from the images of the health care workers and the ill just to satisfy any doubts I might have about the virus. For sure I will not be enticed by the collection of Christmas advertisements that might help me feel special during the Christmas period. I felt special enough because of the kindness of friends who came to my rescue while I dealt with my bad knee.\n\nWear your mask and respect others. This time in the world is not forever especially if we do our part. Vaccines are on the way. Will I do the vaccine? Don’t know why not.\n\nCall 250-846-5095 or email mallory@bulkley.net.\n\n\n\neditor@interior-news.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "December dawns on a positive note – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/december-dawns-on-a-positive-note/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}