{
    "authors": [
        "Deb Meissner",
        "Our Town"
    ],
    "content": "Jane Hoek was dedicated to her students at Muheim Memorial Elementary School in Smithers\n\nAfter 50 years in the Bulkley Valley, Jane Hoek is saying farewell\n\nJane Hoek is off on another adventure in her life. The most difficult part is to say goodbye to the people and places she loves, but Hoek is looking forward to being close to her family in Prince George.\n\n“Moving is a very emotional experience after living here for over 50 years,” she said. “It’s another chapter in my life, a new journey I look forward to, but it is still very hard to leave.”\n\nHoek was born one month before the Second World War broke out. She, her father Jack Lester, mother Mary, twin sister Libby, older sister Jill and eventually younger sister Heather all lived in a cottage in Regent’s Park, at the London Zoo in London, England. Her father was curator of reptiles.\n\nThey lived safely there all though the war years.\n\nDuring those years, Jack and his great friend Sir David Attenborough went on “wonderful explorations of the natural world together,” Hoek recalled. “My father and Attenborough bringing home adventure stories, living at the zoo, it was all fascinating to me as a young girl.\n\n“It began my life-long love of nature.”\n\nAfter attending school to eventually gain her teaching certification, Hoek and a school friend decided they too wanted “to explore and travel the world.”\n\nThey planned an adventure that would take them to all the places around the world they had dreamed of, starting on the east coast of Canada.\n\nThey arrived by plane, travelled and explored from coast to coast by train, and when it came time to move on, Hoek decided she wanted to stay. She loved Canada.\n\nShe returned home to England and made her plans to accept a teaching position in Canada, in a place named Smithers, British Columbia, she said with a smile.\n\nHer teaching position was at Muheim Memorial Elementary School, where she taught for 25 years.\n\n“I loved it there” Jane said, “the children and I had so much fun.”\n\nDebbie Courtliff, a good friend of Jane’s and fellow teacher, said\n\n“There was a lot of fun going on with the learning in Jane’s classroom,” Courtliff said.\n\n“There were animals Jane would bring to class to teach the children about, like baby chicks, and the occasional llama; field trips up the ski hill, out to Toboggan Creek Fish Hatchery; and the yearly trip to Jane’s farm on Tyhee Lake.”\n\n“The kids learned a lot and had an absolute blast.”\n\nDuring those early years in the Bulkley Valley, Hoek met and married husband Hildo.\n\nThey both shared a deep love of nature and the outdoors, gardening and animals and found “the perfect 20 acres of land on Tyhee Lake to have a hobby farm and start our family,” Hoek said.\n\nTheir son Gavin and daughter Lisa were soon to follow.\n\n“Those were happy years,” Hoek said with a smile.\n\nBut life changes and takes unexpected turns, and the one that came next, would change the Hoek family and their lives forever.\n\nTheir young son Gavin was diagnosed with cancer, and though he fought, and the family did all they could do, he did not survive.\n\n“It was heart-wrenching, almost unbearable at times, but it brought our family closer together,” Hoek quietly said.\n\nIn the years that followed, Janes’ determination to raise awareness and funds to fight cancer, were unstoppable. A mission she continues to be passionate about.\n\nOver the years, Hoek has been involved in groups in the Bulkley Valley that have changed countless lives. She has been involved with the Canadian Cancer Society, the Relay for Life, the Daffodil Dash, the Terry Fox Run, and the Bulkley Valley Cancer Care Team.\n\nThough cancer profoundly changed her life, it did not consume Hoek.\n\nShe maintained a balance of family, her teaching career, her charitable causes and continuing to enjoy the Bulkley Valley and to be involved in many other ways.\n\nEnjoying many diverse interests led Hoek to find several community groups to be a member of and active in. She also pursued one particular interest both professionally and personally, photography.\n\nHoek loves photography, and for several years, took all the pictures for the sports teams in the Bulkley Valley. She made photography into a business and took thousands of pictures of young athletes and spent many hours making them into photographs and keepsake cards (like hockey cards) for family and friends of the teams and kids.\n\nNature, animals and the surrounding majestic scenery were also favourites of hers to take pictures of. That particular combination led to Hoek to publish a book of photographs called The Beautiful Valley published in 2011.\n\nIt is filled with photos of Bulkley Valley scenery and the many, diverse wild creatures that live within it. One review of the book simply said, “wow.”\n\nAnother pursuit Hoek has enjoyed was her involvement in the Bulkley Valley Naturalists Club. She loved the annual Christmas Bird Count and often gave talks to the group on the flora, fauna and natural history of the valley.\n\n“A good hike spent in nature here, made a perfect day,” Hoek said.\n\nLove of music was another facet of Hoek’s life. The complete enjoyment of being a musician brought Hoek, and her cello, to play in the Orchestra North Smithers.\n\n“Music comes from the soul and enriches your life and others too,” she said.\n\nIn the past several years, Jane has once again dealt with change, and unexpected turns in her journey.\n\nHer husband Hildo passed away after a brief illness with cancer. Her daughter Lisa has fought her own battle with cancer and is a survivor, and Hoek sold the property on Tyhee Lake that she dearly loved.\n\n“It has been difficult, but my family and dear friends see me through, they keep me going,” she said.\n\nMoving to Prince George to be closer to her daughter’s family and her grandchildren, makes a lot of sense given all that Hoek has been through. But her reluctance to leave the many friends she has in Smithers and the groups to which she belonged, is also understandable. She put down roots here and touched so many lives.\n\nHer new adventure she starts with a bit of hesitation.\n\n“It is what I need to do, and I look forward to it, but I hope people won’t forget me,” she said.\n\nIt hardly seems likely.\n\nAfter 50 years, the bonds of friendships made, the love and care that so many people in this valley have for her, the children she taught and have grown up here, none of these people will forget, nor will the community forget the many contributions Hoek worked tirelessly to make.\n\n“It’s a different time in my life, but I am ready,” Hoek declared.\n\n“I welcome friends to come by when they are in Prince George, to keep up by phone and let me know what is happening in the valley. I will be thinking of everyone.”\n\nAfter a second week in her new home, Jane and her furry companion Alice, have settled in and Jane is enjoying making plans for her new adventures in Prince George. Her family is close by, and the city is a “whole different experience, full of possibilities.”\n\nSaid by a true adventurer.\n\ncommunity profile\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.\n\nJane’s scrapbook from her first trip to Canada in 1966. (Deb Meissner photo)\n\nAlways a lover of music, Jane Hoek played Cello in Orchestra North Smithers\n\nIn her new home at Riverbend Manor in Prince GeorgeJane",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "After 50 years in the Bulkley Valley, Jane Hoek is saying farewell – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/community/after-50-years-in-the-bulkley-valley-jane-hoek-is-saying-farewell/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}