{
    "authors": [
        "The Canadian Press"
    ],
    "content": "One of five writers will receive the $100,000 fiction prize at a virtual ceremony Monday\n\nIt’s typically the literary to-do of the season, but this year, the Scotiabank Giller Prize gala is going digital.\n\nOne of five writers will receive the $100,000 fiction prize at a virtual ceremony tonight.\n\nThe contenders include Winnipeg writer David Bergen, a former Giller winner who is marking his fifth nomination for the prize with the story collection, “Here The Dark,” published by Biblioasis.\n\nFour-time nominee Shani Mootoo is shortlisted for her love-triangle novel “Polar Vortex,” published by Book*hug Press.\n\nAlso in the running are first-time finalists Gil Adamson of Toronto for the western-meets-mystery “Ridgerunner” (House of Anansi Press); Toronto-raised Souvankham Thammavongsa for the short-story collection “How To Pronounce Knife” (McClelland & Stewart); and British Columbia-raised, New York-based Emily St. John Mandel for her haunting story of white-collar crime, “The Glass Hotel” (HarperCollins Publishers).\n\nThe finalists would normally be feted at a swanky Toronto gala, but tonight, the winner is set to accept the award from the comfort of their own home.\n\nGiller executive director Elana Rabinovitch says organizers spent months working to preserve the ceremony’s signature “sizzle” within the public health constraints of COVID-19.\n\nRabinovitch says the televised ceremony, which will be hosted by Canadian actor Eric McCormack, will feature a mix of pre-taped and live portions.\n\nJazz musician Diana Krall will perform as part of the socially distanced festivities, and a procession of celebrities will make home-recorded cameos in their red carpet attire.\n\nRabinovitch says she hopes to congratulate the winner in-person (and from a distance), but depending on where the writer lives, organizers may have to get “creative.”\n\n“We have some alternate endings,” she said with a laugh. “You’ll have to watch on Monday to find out.”\n\nDespite the logistical challenges, Rabinovitch says shifting the proceedings online has lowered the costs of the ceremony. In light of those savings, prize organizers are donating $25,000 each to the Indigenous Voices Awards and Diaspora Dialogues, an initiative to support diverse writers.\n\nThe event will air on CBC and its Gem streaming service at 9 p.m. tonight.\n\nThe finalists were chosen by jury members Mark Sakamoto, Eden Robinson, David Chariandy, Tom Rachman, and Claire Armitstead.\n\nThe long list of 14 titles announced in September had some big names who didn’t make the cut, including Thomas King, Emma Donoghue, and Lynn Coady.\n\nA total of 118 works were submitted for this year’s prize, according to organizers.\n\nFounded in 1994, the Giller awards $100,000 annually to the author of the best Canadian novel, graphic novel or short story collection published in English, and $10,000 to each of the finalists.\n\nAdina Bresge, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nEntertainment",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-11-09 07:30:00-08:00",
    "title": "5 writers to be feted at first virtual $100K Giller Prize ceremony – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/entertainment/5-writers-to-be-feted-at-first-virtual-100k-giller-prize-ceremony/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}