{
    "authors": [
        "Associated Press"
    ],
    "content": "Trolling those close to President Donald Trump is a central theme of the new “’Borat’ film\n\nSacha Baron Cohen arrives at the Vanity Fair Oscar Party in Beverly Hills, Calif., on March 4, 2018, left, and former New York Mayor Rudy Giuliani at the Trump National Golf Club Bedminster clubhouse in Bedminster, N.J. on Nov. 20, 2016. Giuliani appears in a scene in the new “Borat” film. The scene, which was filmed in a New York hotel room in July, resulted in Giuliani calling police. (AP Photo)\n\nRudy Giuliani is shown with his hand down his pants after flirting with an actress playing a young woman pretending to be a television journalist in a scene in Sacha Baron Cohen’s latest mockumentary, a sequel to his hit “Borat” film.\n\nThe scene shot in a New York hotel room in July — which resulted in Giuliani calling police — includes a moment when Giuliani is seen lying on a bed with his shirt untucked and his hand down his pants with the young woman nearby.\n\nGiuliani went to the hotel room thinking he was being interviewed about the Trump administration’s COVID-19 response. The young woman is flirtatious with him and invites him to the bedroom, which is rigged with hidden cameras.\n\nGiuliani then asks for her phone number and address. He lies back on the bed and has his hands in his pants.\n\nThe hotel room scene ends when Baron Cohen, who was disguised as part of the crew, bursts into the room in an outlandish outfit screaming that the young woman is 15 years old. Up to that point, there is no indication she is underage. The character, Borat’s daughter, is played by actress Maria Bakalova, who is listed as 24 years old on the Internet Movie Database site, IMDb.com.\n\nGiuliani had no immediate comment.\n\nThe former New York City mayor called police after that encounter, but there is no indication an investigation was launched. Giuliani spoke to the New York Post’s Page Six column about the incident in July, but did not mention the bedroom aspect of the encounter.\n\nNew York Times columnist Maureen Dowd, who profiled Baron Cohen ahead of the the film’s release, tweeted Wednesday about the scene: “It’s even wilder than it sounds. Beyond cringe.”\n\nTrolling those close to President Donald Trump is a central theme of the new “Borat” film, a sequel to the 2006 mockumentary that saw Baron Cohen’s character travel the United States, espousing sexist, racist and anti-Semitic views, and eliciting similar responses from unwitting subjects.\n\nFor “Borat Subsequent Moviefilm: Delivery of Prodigious Bribe to American Regime for Make Benefit Once Glorious Nation of Kazakhstan,” Baron Cohen returns as his alter-ego from Kazakhstan in a plot that involves trying to give his daughter as a gift to Vice-President Mike Pence.\n\nThe closest Borat gets is the audience at the Conservative Political Action Conference, where he shouts to Pence that he’s brought a woman for him. Dressed in a Donald Trump costume and with Borat’s daughter, played by Bakalova, slung over his shoulder, Baron Cohen is swiftly escorted out by security.\n\nThat leads to a second scheme involving Giuliani that ends up in the hotel room scene.\n\nGiuliani finalized his divorce from his wife of 15 years in December.\n\nBaron Cohen has made a history of poking fun at conservative figures. For his 2018 Showtime series “Who Is America,” the British comedian got former Vice-President Dick Cheney to sign a waterboarding kit. A sketch with former Alabama Chief Justice Roy Moore involved the comedian administering a “pedophile test.” Moore has sued over the encounter.\n\nThe Associated Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nMovies and TV",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-10-21 13:40:00-08:00",
    "title": "Giuliani caught in hotel bedroom scene in new ‘Borat’ film – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/entertainment/giuliani-caught-in-hotel-bedroom-scene-in-new-borat-film/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}