{
    "authors": [
        "Katya Slepian"
    ],
    "content": "Rocker had formed Van Halen in the 1970s with his brother\n\nFILE - This Jan. 17, 1993 file photo shows the band Van Halen, from left, Michael Anthony, bass guitar, Sammy Hagar, lead singer, Alex Van Halen, drums, and Eddie Van Halen, lead guitar in Los Angeles. (AP Photo/Kevork Djansezian, File)\n\nFamous rocker Eddie Van Halen has died of cancer at the age of 65, according his son Wolf Van Halen.\n\nIn a tweet sent at approximately noon, Wolf Van Halen said his father died earlier Tuesday (Oct. 6) morning.\n\n“He was the best father I could ever ask for,” Wolf wrote. “Every moment I’ve shared with him on and off stage has been a gift.”\n\nEddie Van Halen formed the band that would become Van Halen with his brother, Alex Van Halen, in 1972.\n\nHe has been recognized as one of the most talented and influential guitarists in rock music, with a powerful style that showcased lightning-fast licks and innovative fret work.\n\nDavid Lee Roth, another iconic rocker, was the lead singer of the band for many years, later replaced by Sammy Hagar.\n\nThe band has sold more than 80 million records worldwide and recorded 13 number-one hits on the Billboard Mainstream Rock chart, including Runnin’ With The Devil, Panama and Jump.\n\nEddie was inducted into the Rock and Roll Hall of Fame in 2007. His son, Wolfgang, became Van Halen’s bassist in 2006.\n\nAt the time of his death, Eddie had been battling throat cancer for several years.\n\n@katslepian\n\nkatya.slepian@bpdigital.ca\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nMusic",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-10-06 12:52:00-08:00",
    "title": "Guitarist Eddie Van Halen dead at age 65 after long battle with cancer – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/entertainment/guitarist-eddie-van-halen-dead-at-age-65/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}