{
    "authors": [
        "K-J Millar"
    ],
    "content": "Prince Rupert RCMP say there were a number of illegal vehicle entries in November\n\nPrince Rupert RCMP issue a holiday advisory to lock vehicles and remove all valuables. A number of vehicle entries occurred in November. (file photo)\n\nPrince Rupert RCMP is sending out a holiday reminder about the importance of locking and securing your vehicle, as well as removing any valuables while at home, at work, or out in public.\n\nWith Christmas shopping and purchases perhaps being stored in cars and vehicles they can be a temptation to would-be thieves.\n\n“Over the month of November, the Prince Rupert RCMP responded to 10 reported thefts from motor vehicles. All of these investigations found that the vehicles were left unsecured,” Cpl. Devon Gerrits said in a media release on Dec. 9.\n\n“These are crimes of opportunity that can be prevented by ensuring that you do your part by locking your vehicles when they are unoccupied,” he said.\n\nGerrits told The Northern View more people have their vehicles sifted through than actually report.\n\n“It is always a good idea to report to the police as we have specialized sections such as Forensic’s that could examine a vehicle for suspect fingerprints.”\n\nThere is always the debate about locking vehicles as a theft deterrent versus keeping them unlocked to avoid unnecessary damage like a broken window or jimmied door locks. Gerrits said locking is better.\n\n“I would recommend locking your vehicles, we hardly get any reports of people actually breaking into a vehicle – if any,” Gerrits said. “Also if someone is worried about that concept, a good thing to do would be to remove any sort of valuables that would be visible.”\n\nIf you see or notice any suspicious activity or observe a theft in progress please contact the Prince Rupert RCMP, or contact Crimestoppers at 1-800-222-8477 (TIPS) if you wish to remain anonymous.\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-10 22:20:00-08:00",
    "title": "RCMP warns to lock and secure vehicles to avoid illegal entry and thefts – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/rcmp-warns-to-lock-and-secure-vehicles-to-avoid-illegal-entry-and-thefts/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}