{
    "authors": [
        "K-J Millar"
    ],
    "content": "Prince Rupert Christmas kettle donations are creating concern with less than half of what’s needed\n\nPrince Rupert Salvation Army Christmas Kettle donations are a concern for the organization as donations are down to less than half of the goal with just two weeks until the end of the campaign, Dawn Butt pastor of the church said on Dec. 9. (Photo: K-J MIllar/The Northern View)\n\nThe Prince Rupert Salvation Army is struggling to meet its annual Christmas Kettle Campaign goals, with just less than half of the goal reached and only two weeks to go until Christmas, Dawn Butt S.A. Lieutenant told The Northern View on Dec. 9th.\n\nThe goal this year was to raise $30,000 from kettle donations, however, with COVID-19 restrictions, there are just two public Christmas kettles in town. Kettles are located at Walmart and BC Liquor Store, with a third available for clientele inside the Moose Lodge. Kettles are out for donations until Dec. 24.\n\n“Our kettles are not doing so well,” Butt said. “… our kettle numbers are actually down this year.”\n\n“We have our online kettle as well, where people can donate, so that is helping a little bit with our kettles, but we are probably not even at the halfway mark for where we wanted to be. It is kind of sad. “\n\nIt is unknown if the donation predicament is due to COVID-19, or with people playing it safe and donating in other ways. However, there are volunteers aplenty which is great with most kettle volunteer spots already filled, the pastor said.\n\n“We are getting lots of volunteers, I think we have only three more spots to fill, so that is great.”\n\nWhile monetary gifts and donations are down and causing concerns, food and toy drives are performing well.\n\n“Our food drives have done really well. Our toy drives have gone really well,” Butt said. “We’ve had great partnerships with (community businesses) who have participated.”\n\nMore to come in The Northern View print edition\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-10 13:00:00-08:00",
    "title": "Salvation Army is trudging uphill with kettle donations – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/salvation-army-is-trudging-uphill-with-kettle-donations/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}