{
    "authors": [
        "K-J Millar"
    ],
    "content": "An electrical fire started in the offices of Prince Rupert Unemployed Action Center with the grounded current arcing into the adjacent restaurant, Paul Lagace coordinator and poverty advocate said on Dec. 10. Power has been cut to both buildings. (Photo: K-J Millar/The Northern View)\n\nPrince Rupert Unemployment Action Centre (PRUAC) is on the move after an electrical fire on Dec. 7 put their office space out of commission.\n\nThe new temporary office location will be in Hecate Strait Employment Development Services (HSEDS). The non-profit organization PRUAC which serves the community by way of advocacy and assistance in many ways such as helping to obtain unemployment benefits, government financial aid forms, tenancy issues, and a variety of other matters needs to be in a central location for the clientele to access services.\n\n“Hopefully we won’t be displaced too long,” Paul Lagace coordinator and poverty law advocate said. “The reality is we’d love to say a week, but it could be a month or two.”\n\nLagace said the community stepped up quickly to help out the service agency. Tom Chang, a landlord in the city, as well as HSEDS offered office space almost immediately to the organization which was in high need. The currently increasing client base and eviction issues are creating a larger than usual demand for services, Legace said.\n\nThe move should be complete by the afternoon of Dec. 11 with phone lines running, as they are currently receiving messages only. Services will be offered on an appointment basis on the main floor of HSEDS at 208 First Ave. E. in Cow Bay.\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-10 11:00:00-08:00",
    "title": "Community landlords step up to offer space to advocacy organization – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/community-landlords-step-up-to-offer-space-to-advocacy-organization/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}