{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "The ratio was still below the $1.81 seen in the fourth quarter of 2019\n\nCanadian dollar coins or loonies are pictured in North Vancouver, B.C. Wednesday, May 29, 2019. Statistics Canada says Canadian households owed an average of $1.71 for every dollar of disposable income in the third quarter. THE CANADIAN PRESS/Jonathan Hayward\n\nCanadian households owed an average of $1.71 for every dollar of disposable income in the third quarter, Statistics Canada said on Friday.\n\nIn other words, Statistics Canada said, household debt as a percentage of disposable income rose to 170.7 per cent in the third quarter, up from 162.8 per cent in the second quarter.\n\nThe ratio was still below the $1.81 seen in the fourth quarter of 2019.\n\n“With more cash and less spending, households were able to pay down some consumer debt. And while there has been a recent pickup, it remains below levels seen earlier this year,” said a client note by Priscilla Thiagamoorthy, economist at BMO Capital Markets.\n\nStatistics Canada’s report said that while credit market debt rose by 1.6 per cent in the third quarter, household disposable incomes fell 3.1 per cent as Canadians recovered from job losses during the COVID-19 pandemic. Lower income households tended to have a higher debt to disposable income ratio, the agency has said.\n\nWhile employment got within 3.7 per cent of its pre-pandemic levels during the quarter, it wasn’t enough to offset the wind-down of government supports, as employment insurance benefits dropped almost 50 per cent in the quarter, the report said.\n\nBut with COVID-19 restrictions keeping people close to home, household savings remained high during the quarter at $56.8 billion, down from a record of $90.1 billion in the second quarter, the agency said.\n\nHouseholds also benefited from rebounding mutual fund shares, amid a 3.9 per cent return on the Toronto Stock Exchange over the three-month period. Overall, the net worth of Canadian households rose three per cent to more than $12.3 trillion.\n\n“Wealth distribution tends to be highly unequal across income groups, as a result, recent gains in net worth have disproportionally benefited Canadians who were already better off,” Ksenia Bushmeneva, an economist at TD Economics, in a note to clients about the household wealth report.\n\n“Generally speaking, wealthier individuals experienced larger increases in savings as they were more likely to retain their jobs while also cutting back on discretionary spending such as travel and restaurants which remain largely unavailable.”\n\nMeanwhile, there was a record rise in mortgage borrowing and housing investment hit its highest point on record as the cost of borrowing hovered at all-time lows, StatCan reported. Mortgage debt hit nearly $1.63 trillion as demand for mortgage loans rose to a new high of $28.7 billion.\n\n“Clearly, cash is not always king, and having wealth — (whether) it’s financial or real estate assets — has really paid off this year with equities and real estate prices rallying,” wrote Bushmeneva.\n\nOther key changes tracked in the report included household debt service ratio, which measures how much income goes to paying interest and principal. The household debt service ratio increased to 13.22 per cent from 12.36 per cent, after declining earlier in the year amid debt deferral programs tied to the COVID-19 pandemic. Many of these programs wound down at the end of the third quarter, Statistics Canada said.\n\n“Canadian household finances are in better health this year thanks mainly to unprecedented government transfers which lifted overall incomes,” wrote Thiagamoorthy.\n\nThis report by The Canadian Press was first published Dec. 11, 2020.\n\nAnita Balakrishnan, The Canadian Press",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-11 10:10:00-08:00",
    "title": "Household debt now $1.77 for every $1 in disposable income, StatCan says – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/household-debt-now-1-77-for-every-1-in-disposable-income-statcan-says/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}