{
    "authors": [
        "Jake Wray"
    ],
    "content": "Cameron Kerr, 30, was killed in a fatal hit and run on Hwy 16 when he was walking home on Nov. 18, 2018. (Facebook Photo)\n\nThe question of ‘what if?’ has haunted Garrett Kerr for more than two years now.\n\nHis brother, Cameron Kerr, 30, was killed in a hit-and-run in the early hours of Nov. 18, 2018 while walking home after drinking near Terrace, B.C. Cameron was a sheet metal worker by trade, and he was also a former player for the Terrace River Kings hockey team, and an avid outdoorsman who loved paddling, hunting and fishing.\n\nGarrett said he was known as being kind and compassionate, with a great sense of humour.\n\nThe driver of the vehicle has not been caught, despite a rigorous RCMP investigation that turned up significant evidence and identified a group of suspects from the Lower Mainland who may have colluded to cover up the incident.\n\nGarrett and Cameron were together that night, and Garrett has asked himself over and over what he could have done differently.\n\nThe night Cameron was killed, the brothers had attended a wake for a young friend who died of an overdose. Friends and family had gathered for a bittersweet night of sharing memories at a home in New Remo, a tiny community about eight kilometres outside Terrace.\n\nCameron had decided to walk home in the dark to Terrace along Hwy 16. It’s a long walk, but not unfamiliar to the brothers, who grew up in New Remo. Before he left, Garrett tried to convince him to wait for a cab or to sleep at their parents’ home in New Remo.\n\nBut Cameron was adamant, so Garrett let him go and returned to the party.\n\nAccording to the RCMP, an oncoming vehicle struck Cameron shortly after he left as he walked against traffic on the shoulder of the highway. The Kerr family maintains that driver and companions took hours to cover up the incident before continuing northwest.\n\nSome time after Cameron left, Garrett and a group of friends piled into a cab and headed to Terrace. There was an energetic mood in the cab, and no one was paying attention to the ditch on the opposite side of the road.\n\n“I still don’t know to this day whether my brother was alive when I rode by in the cab,” Garrett says. “The longer these guys hold out and don’t cooperate, the longer I have to live with that.”\n\nCameron’s body was found around noon the next day.\n\nOn Nov. 21, police announced they had identified a suspect truck on Haida Gwaii with damage consistent with the collision, and were confident they had identified a suspect driver from the Lower Mainland. They seized the suspect truck, another truck and two boat trailers on Haida Gwaii, in addition to an abandoned boat trailer discovered near where Cameron was killed. Police questioned seven people of interest.\n\nBut the RCMP didn’t have enough evidence to recommend charges.\n\nGarrett and his family held a press conference on Dec. 19, appealing for people to come forward with information. They were joined by Sgt. Shawn McLaughlin, the lead Mountie on the case.\n\n“We will not relent until we deliver the driver responsible,” Sgt. McLaughlin said.\n\nSince then, the Kerr family has remained focused on urging the suspects and their families and friends to step up. The Kerr family held another press conference (their third) in November 2019.\n\nThey paid for an ad to be published in Lower Mainland newspapers in April 2020, summarizing their understanding of the incident and pleading for associates of the suspects to come forward.\n\n“To the parents, wives, girlfriends and friends of a group of men from the Lower Mainland: In November 2018, these men set off for a fishing and hunting trip to Haida Gwaii,” the letter begins.\n\n“After passing through Terrace, they were involved in a tragic collision … after the collision, they spent hours hiding their damaged boat trailer in the woods … they transferred the boat to the new trailer and proceeded to Haida Gwaii as if nothing had happened. The persons responsible for his death knowingly left Cameron to die alone.\n\n“Their trucks, boats and trailers were all impounded by the police, so when they returned to the Lower Mainland, it was without those possessions … If you recognize these men by this story, the family of Cameron Kerr pleads with you to urge [the suspects] to do the right thing and go to the authorities so that this nightmare can end for Cameron’s family, as well as these individuals.”\n\nGarrett says the family is grateful for the work the RCMP have done, despite the absence of charges.\n\nSgt. McLaughlin, speaking to The Terrace Standard on Dec. 2, 2020, says he can’t share many details of the current status of the investigation, but police are not sitting idly waiting for someone to come forward.\n\n“It’s been two years and [the family] want that assurance, and they deserve that assurance to know that this hasn’t fallen off our plate. We are still continuing to investigate and use various means to do so.”\n\nIn November of this year, near the anniversary of Cameron’s death, a small group of family and friends went to the spot where his body was found to visit a memorial. It’s made of antlers, to represent his love of hunting, his fishing rod, and kayaking paddles.\n\nGarrett is thankful to the Terrace area community for its support.\n\n“Everybody up here thinks about Cameron all the time and they’ve been so helpful in the investigation,” he says. “But really, the people that can make a difference at this point are living their lives down south.”\n\n– With files from Natalia Balcerzak\n\nPolice are asking anyone with information and who has not already spoken with police to call Sgt. Shawn McLaughlin with West Pacific Region Traffic Services at 250-638-7438 or, if you wish to remain anonymous, call Crime Stoppers at 1-800-222-8477 (TIPS).\n\nRCMP\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-10 13:05:00-08:00",
    "title": "‘What if?’: RCMP ID persons of interest in fatal northern B.C. hit-and-run, no charges laid – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/what-if-rcmp-id-persons-of-interest-in-fatal-northern-b-c-hit-and-run-no-charges-laid/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}