{
    "authors": [],
    "content": "Momoka Matsui, lead ballet dancer in Anne of Green Gables performed Ballet Jorgen interpreted the character Anne Shirley from L.M. Montgomery’s classic Canadian novel, at the Lester Centre on Feb. 25. (Photo by K-J Millar/The Northern View)\n\nTwelve talented local youth dancers joined the Toronto based Ballet Jorgen’s world premier tour that brought to life the Canadian classic story, Anne of Green Gables, on Feb. 26. More than 300 audience members at the Lester Centre applauded the professional dance interpretation of the novel written by L.M. Montgomery.\n\nThe local youth stars participated with dance roles in the ensemble as furry woodland characters, a rabbit, skunk, toad, turtle, flowers and school children. The Prince Rupert troupe had just three weeks notice of their inclusion in the production.\n\n“Ballet Jorgen put out a general call to dance schools in every city they tour. We have to submit a written summary on each student we are presenting as they need to be disciplined in dance, ” Ella Ferland, director of Spectrum City Dance, said. “It is a quite a protocol to be accepted.”\n\nThe local dancers don’t have much time to rehearse and need to be adaptable.\n\n“The kids go to the rehearsals once the ballet comes to town. They are then incorporated into the production,” Ferland said.\n\n“We were very happy at how well our dancers blended in on stage. The feed back from the professional dancers and the company itself was fantastic. They said the kids were able to adapt easily, which doesn’t always happen,” Ferland said.\n\n“All of our dancers were every excited to be part of this. It’s a thrill to be on stage, its a thrill for them to watch the professional class. They treated the kids as peers. that was very happy making for the kids, ” Ferland said.\n\nBallet Jorgen is a Canadian classical ballet company that aims to make ballet accessible and relevant to 21st century audiences. They are dedicted to telling Canadian stories through the art of dance.\n\n“Tonight, this production proved how versatile Anne’s story is, that it can touch hearts around the world, and warm spirits on a cold winter’s night, ” Micheal Gurney, manager of the Lester Centre said.\n\nBallet Jorgen are on tour performing Anne of Green Gables for nine weeks in total, with six more to go, Callum McGregor, dancer with the company told Black Press.\n\nThe production carries with it 18 dancers, 5 crew and takes more than four hours to set up in each locale. The professional dancers have prepared every day since last May for this special journey through Western Canada. They each work on their roles from 9:30 to 6 p.m. everyday to ensure their dancing technique is spot on.\n\n“It’s been a whirl wind and being on tour has taught me life lessons,” McGregor whose first year it is with the company said. “It’s the best experience being here, able to perform.”\n\n“We are going to continue to enjoy the tour,” McGregor,who has been dancing for 14 years, said\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-03-05 06:00:00-08:00",
    "title": "Prince Rupert dancers on pointe in world premier ballet tour – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/entertainment/prince-rupert-dancers-on-pointe-in-world-premier-ballet-tour/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}