{
    "authors": [],
    "content": "By Lia Crowe\n\nA willingness to take risks, work hard and have fun along the way.” The three pillars on which Kyle Lawrence has built his career have led to his success, as well as happiness, and what I immediately perceive as an upbeat, charismatic, glass-half-full kind of personality.\n\nI meet Kyle at Spacious Storage in downtown Kelowna and it’s evident right away that the “having fun along the way” part is true to life: our photo shoot takes us up ladders and onto the rooftop as we explore all the cool spots in the Spacious Storage and Malibu Marine buildings.\n\nOriginally from Vancouver, Kyle left the big city last year when an opportunity came along to partner in a self-storage facility and boat business in downtown Kelowna.\n\n“This was not only a great opportunity, but it also allowed me to be closer to family while realizing the benefits of the Okanagan lifestyle. I know I live in a special place when I can wakesurf at 6 am before heading off to work.”\n\nSo it’s no surprise that when asked what he’s passionate about outside of work, he says that being active outdoors is important to him.\n\n“I have been skiing my entire life and love the freedom of charging down the mountain.” Kyle is also passionate about music, enjoying a wide range of genres, from reggae to rock and everything in between, as well as audio books that cover business, biographies and personal development. And because that’s not quite enough, he’s also into working out, Thai boxing and meditation!\n\nWhen it comes to style, and with “big-city corporate” behind him, Kyle is loving that he can lean into the casual side of work wear, with Adidas sneakers replacing dress shoes and denim replacing the suit jacket. He jokes that he feels that he’s finally made it because he wore shorts to work for the first time ever last summer!\n\nAsked for the best life lesson he’s recently learned, he says, “Being grateful for the people in my life, living in the moment and learning how to expand my comfort zones.”\n\nClothes/Grooming\n\nFavourite denim, brand and cut: DUER performance denim, slim fit.\n\nCurrent go-to clothing item: Rip Curl fleece.\n\nFavourite pair of shoes: Adidas Busenitz Pro Shoes.\n\nBest new purchase: Axis boat.\n\nFavourite day-bag: Black Diamond ski backpack.\n\nSunglasses: Ray-Ban.\n\nScent: Million by Paco Rabanne.\n\nNecessary indulgence: Reese’s Peanut Butter Cup Blizzard.\n\nFavourite skincare product: Tamanu oil.\n\nFavourite hair product: Layrite Pomade.\n\nStyle Inspirations & Life\n\nLast great read: Can’t Hurt Me: Master Your Mind and Defy the Odds by David Goggins.\n\nBook currently reading: Little Black Stretchy Pants by Chip Wilson.\n\nFavourite book of all time: Awareness by Anthony de Mello.\n\nFavourite artist: My mother, Sharon Lawrence.\n\nPiece of art: Bamboo Study, by Sharon Lawrence.\n\nFavourite fashion designer or brand: DUER performance denim.\n\nFavourite musician: Stick Figure.\n\nEra of time that inspires your style: 90s surf/skate culture.\n\nFavourite local restaurant: Naked Café.\n\nFavourite cocktail or wine: Anything but a Caesar!\n\nFavourite current song: Just Livin’ by Sensi Trails.\n\nAlbum on current rotation: KBong and Island Reggae Radio on Spotify.\n\nFavourite city to visit: Maui.\n\nFavourite hotel: The Westin Maui Resort & Spa, Ka’anapali.\n\nFavourite App: Spotify and Audible.\n\nFavourite place in the whole world: Hawaii.\n\nOkanagan",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-25 07:00:00-08:00",
    "title": "Kyle Lawrence talks style and inspiration – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/life/kyle-lawrence-talks-style-and-inspiration/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}