{
    "authors": [],
    "content": "Happy Anniversary Prince Rupert!\n\nTen years ago the Prince Rupert Port Authority (PRPA) set in motion its Community Investment Fund to support community projects across the North Coast.\n\nThe goal was to share the port’s financial success with the communities that enable it, and ten years in, they’ve built a lasting legacy. Since 2010 the PRPA has worked with local organizations — led mostly by dedicated volunteers — to complete over 80 projects. They’ve committed over $12.5 million dollars to the Community Investment Fund!\n\n“At the Prince Rupert Port Authority, we believe strong communities sustain us and looking back on the past decade, we are immensely proud of the impact our contributions have had to the communities that surround our port,” says Natalie Allen, Community Relations Coordinator at the Prince Rupert Port Authority. “But our contributions were able to make a difference because of the many passionate, hardworking volunteers and community leaders who give their time to the organizations that spearhead these efforts.”\n\nTen years of community projects\n\nThe PRPA invests in projects in the Prince Rupert area and surrounding coastal communities that enhance the quality of life for residents. Projects can focus on one aspect of community vitality, or be broad with wide-reaching impact.\n\n“From youth recreation initiatives to supporting transition housing, the Community Investment Fund has been able to enhance thousands of lives and strengthen the bonds that unite us as people,” Allen says.\n\nIn recognition of this milestone, PRPA is reflecting on ten projects that embody the spirit of the Fund with videos and more exciting announcements to come. Learn more at rupertport.com, or explore a few highlights below.\n\nHealth and wellness: Ground and marine search and rescue teams across the North Coast and Haida Gwaii have benefitted from the Port Authority’s CIF, and so has the 333 Trinity Recovery House and North Coast Transition Society, which helps people regain control of their lives.\n\nGround and marine search and rescue teams across the North Coast and Haida Gwaii have benefitted from the Port Authority’s CIF, and so has the 333 Trinity Recovery House and North Coast Transition Society, which helps people regain control of their lives. Culture and environment: The Community Investment Fund has supported community kitchens and greenhouses at The Friendship House in Prince Rupert, Lach Klan and Metlakatla. These programs provide food security, encourage a healthier lifestyle, and also help bring people together with the land.\n\nThe Community Investment Fund has supported community kitchens and greenhouses at The Friendship House in Prince Rupert, Lach Klan and Metlakatla. These programs provide food security, encourage a healthier lifestyle, and also help bring people together with the land. Youth and education: Funding from the Port Authority allowed the Prince Rupert Gymnastics Association to secure a full-time coach, buy new equipment and expand its class offerings for all ages and abilities.\n\nFunding from the Port Authority allowed the Prince Rupert Gymnastics Association to secure a full-time coach, buy new equipment and expand its class offerings for all ages and abilities. Arts and recreation: Community Investment Funds helped update the Lester Centre of the Arts with modern equipment. CIF also contributed to the Rushbrook Trail, a joint effort from several contributing partners and hard working volunteers which restored the popular path after a 15-year closure.\n\nThe Prince Rupert Port Authority announces a call for proposals every January. The call is open for 30 days and during that time the PRPA hosts an information session, which will be virtual in 2021. Follow PRPA on Facebook, Twitter and Instagram for the latest!\n\nCommunityCommunity Leadership",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-30 06:00:00-08:00",
    "title": "Thriving together: Port, communities celebrate lasting legacy – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/marketplace/thriving-together-port-communities-celebrate-lasting-legacy/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}