{
    "authors": [],
    "content": "Vopak Development Canada Inc. (Vopak) is proposing to construct and operate Vopak Pacific Canada Project, a bulk liquids tank storage and marine export facility on Ridley Island within the Port of Prince Rupert. The Vopak Pacific Canada Project is being reviewed under both the Canadian Environmental Assessment Act, 2012 and B.C.’s Environmental Assessment Act (2002). The federal environmental effects evaluation is being co-ordinated by the Prince Rupert Port Authority (PRPA) on behalf of federal authorities and the British Columbia Environmental Assessment Office (EAO) is administering the provincial environmental assessment, with both agencies seeking to coordinate the reviews.\n\nThe Proponent has now submitted its Environmental Effects Evaluation/Application to obtain an environmental assessment certificate (EEE/Application).\n\nIn order to provide information to the public about the EEE/Application, and to receive comments from the public, PRPA and the EAO invites the public to attend one of the following Open House options. Due to the COVID-19 pandemic and associated physical distancing and self isolation measures, these open houses will be held virtually. The options are as follows:\n\non: November 24, 2020\n\nfrom: 5:30 p.m. to 7:30 p.m.\n\nhttps://joincan.broadcast.skype.com/vopakpacificcanada.onmicrosoft.com/a9562e319e64413e97ed6ecc6c26f771\n\non: November 26, 2020\n\nfrom: 5:30 p.m. to 7:30 p.m.\n\nhttps://joincan.broadcast.skype.com/vopakpacificcanada.onmicrosoft.com/e299004307eb49dab871c9f89b04b0df\n\nHyperlinks to join the online meetings are above. Instructions and hyperlinks will also be found on the EAO’s website project page (hyperlink provided below).\n\nThe open houses will begin with a presentation by PRPA and the EAO on the regulatory processes. A second presentation will also be given by Vopak in relation to the Vopak Pacific Canada Project.\n\nThere are 45 days for the submission of comments by the public in relation to the EEE/Application.The comment period will begin on November 16, 2020 and end on December 30, 2020. All comments received during this comment period will be considered.\n\nThe intention of seeking public comments is to ensure that all potential effects – environmental, economic, social, heritage and health – that might result from the Vopak Pacific Canada Project are identified for consideration as part of the assessment process.\n\nPRPA and the EAO accepts public comments through the following ways:\n\nBy Online Form: http://gov.bc.ca/eao\n\nBy Email: projects@rupertport.com\n\nBy Mail: Jack Smith, Director, Environmental Planning and Compliance, Prince Rupert Port Authority, 200, 215 Cow Bay Road, Prince Rupert, BC,V8J 1A2 OR\n\nBy Mail: Gareth Stuart, Project Assessment Director, Environmental Assessment Office, PO Box 9426 Stn Prov Govt, Victoria, BCV8W 9V1\n\nAn electronic copy of the EEE/Application and information regarding the environmental assessment process are available at http://gov.bc.ca/eao. Copies of the EEE/Application are also available for viewing at these locations:\n\nPort Interpretive Centre, 215 Cow Bay Rd, Prince Rupert, BC\n\nAll submissions about the Vopak Pacific Canada Project received by EAO or PRPA during the comment period are considered public. They will be posted to EAO’s website and will become part of the PRPA’s project file.",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-09 06:00:00-08:00",
    "title": "Environmental Assessment of the Proposed Vopak Pacific Canada Project – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/marketplace/environmental-assessment-of-the-proposed-vopak-pacific-canada-project/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}