{
    "authors": [],
    "content": "The Hasebe Family is grateful for the amazing care their son Colton (top right) received at Sunny Hill Health Centre.\n\nIt was just before Christmas 2015 when ten-year-old Colton struggled to breathe, his asthma inhaler offering no relief. His dad Kevin brought him to the BC Children’s Hospital and as they approached the counter, Colton collapsed. His heart stopped for 15 minutes, and the lack of oxygen caused permanent brain damage.\n\nOnce his condition stabilized, Colton moved into the Sunny Hill Health Centre to begin rehabilitation. At first he felt dizzy sitting up, so staff provided him a reclined wheelchair to increase mobility. But he didn’t need it for long.\n\n“I remember talking to his physiotherapist on a Friday, and they said after the weekend they wanted to start working on exercises to get him wheeling around on his own. By Monday he was already standing with assistance, so we had to set new goals!” his mom Rachel says.\n\nColton received expert care from the compassionate staff at Sunny Hill, and his mom continues to be amazed by his rehabilitation years later.\n\n“It was so incredible the progress he made. When this first occurred he couldn’t see, he couldn’t speak. I wanted to have hope, but I really thought he was going to be in a wheelchair for the rest of his life. Now he’s made Grade 9 Honour Roll!”\n\nHealing, home-like environment for patients and families\n\nAs of Aug. 30 there’s a brand new Sunny Hill Health Centre on the BC Children’s Hospital’s campus, offering convenience to families like Colton’s who used to have to drive between facilities to continue treatment. The new space on campus also makes for easy collaboration between the BCCH’s many services — surgeons, rehabilitation experts and other health professionals can now collaborate in real time throughout each patient’s treatment.\n\nEvery space in the new facility is designed to give personalized, state-of-the-art care. The pool floor is adjustable so children of different heights can train, and personalized aqua jets accommodate varied resistance training needs. The gym is a huge space large enough to accommodate wheelchairs, power chairs, standing children and even children in hospital beds, all working to regain mobility. Parallel bars, adjustable basketball nets, a practice kitchen and more help children progress in real-world situations. The outdoor garden offers varied terrains for practicing mobility, as well as pockets of solitude for families to rejuvenate.\n\n“We lived at Sunny Hill 24/7 when Colton was recovering, so it was great to have spaces for patients and also families,” says Rachel, who enjoyed getting to know other families in the Sunny Hill kitchen.\n\nRachel also pitched in as a patient representative on the committee choosing art for the new centre, which comes from BC and Canadian artists and brings beauty, vitality and inspiration to the space.\n\n“Artwork is very important in the healing experience, especially with children. Of course we wanted it to be beautiful, but we also wanted to accommodate different needs,” she says. Animal sculptures in the courtyard, for example, mark progress and help kids set goals, as well as brightening the space.\n\n“Sunny Hill is an extraordinary community of children, many of whom face overwhelming challenges. And it takes an extraordinary community of donors to support their healing journey. We are tremendously grateful for the heartfelt support of our incredible supporters who helped elevate Sunny Hill from great to exceptional,” says Teri Nicholas, President and CEO of BC Children’s Hospital Foundation.\n\nFURTHER READING: North Delta’s boy newest BC Children’s Hospital Foundation Champion Child\n\nBC HealthFamiliesHealth and wellness\n\nThe new Sunny Hill Health Centre at BC Children’s Hospital re-opened its doors in late August.\n\nThe rehabilitation team at Sunny Hill Health Centre used a special reclining wheelchair near the beginning of Colton’s recovery, and he quickly progressed to standing and assisted walking.",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-09-07 06:00:00-08:00",
    "title": "New facility brings sunshine and healing to BC kids – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/marketplace/new-facility-brings-sunshine-and-healing-to-bc-kids/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}