{
    "authors": [
        "Eric Welsh",
        "Local Sports"
    ],
    "content": "Bantam hockey players from across the province are encouraged to apply for scholarships through the Pat Quinn Classic tournament.\n\nWhile there will be no physical tournament this year thanks to COVID-19, organizers are still selecting three players to win $1,000 to be applied to post-secondary schooling.\n\nIn any other year, players would only be eligible for the scholarships if they played in the annual tournament in Burnaby, but 2020 has been anything but normal. Opening the scholarships up to the entire province is a way to find light in an otherwise dark situation.\n\n“We know this year has been very difficult,” said Cliff Ronning, a former Vancouver Canucks who played for Quinn and now serves as honourary chair of the Pat Quinn Classic. “We also know many young hockey players have risen to the challenge by studying hard, being good teammates on the ice, and finding ways to take care of others in their community.\n\n”It’s important that we reward these efforts and help them achieve their academic goals.”\n\nREAD MORE: Canucks legend Pat Quinn dies at 71; ‘We have lost a great man’ says Linden\n\nThe Pat Quinn Classic is one of the longest running hockey tournaments in the world, though it has only existed in its current form since 2015.\n\nThe international tourney for bantams and peewees dates 58 years back to 1962, but it was renamed five years ago after the passing of legendary hockey coach Pat Quinn. Affectionately known by many as ‘The Big Irishman,’ Quinn died in November of 2014 at the age of 71, and the tournament was re-imagined as a way to carry forward his passion for developing great athletes and leaders.\n\n“”Not only have we created an exceptional tournament with terrific hockey, we have made leadership and academic success foundational to the tournament,” Ronning said. “Pat would be proud that we are using this platform to inspire the next generation of leaders.”\n\nREAD MORE: Chilliwack skaters lead Canucks to Earle Sinkie Trophy\n\nQuinn was a two-time winner of the Jack Adams Trophy as the National Hockey League coach of the year and was revered in Vancouver as the architect of the 1994 Stanley Cup finalist Canucks.\n\nHe spent 42 years of his life as an NHL player (1968-77), coach or general manager (1977-2010).\n\nInternationally, Quinn guided Team Canada to gold medals at the 2002 Winter Olympics, 2008 World U18 Championships and 2009 World Junior Championship. He added a World Cup title in 2004.\n\nQuinn was inducted into the Hockey Hall of Fame in 2016 as a builder.\n\n“I was fortunate to consider Pat a friend and mentor, and that’s what fuels my passion and commitment to this tournament,” Ronning said.\n\nThe Pat Quinn Classic is run in partnership with the Vancouver Canucks Alumni Association.\n\nTwo scholarships are sponsored by the Vancouver Canucks Alumni under the names of Quinn and Ronning, both members of the BC Hockey Hall of Fame.\n\nThe third scholarship is under the name of Kirk McLean and sponsored by Gary Pooni of Brook Pooni Associates. McLean is also a BC Hockey Hall of Famer and he is a member of the Canucks Ring of Honour.\n\nSix thousand dollars in scholarships have been awarded to six students over the past two years.\n\nThis year, male and female bantams have until Jan. 21 to apply at patquinnclassic.com/scholarshps/apply-now/\n\nhockeyScholarships",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-05 07:00:00-08:00",
    "title": "Pat Quinn Classic scholarships continue even as COVID cancels tournament – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/sports/pat-quinn-classic-scholarships-continue-even-as-covid-cancels-tournament/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}