{
    "authors": [
        "K-J Millar",
        "Local News"
    ],
    "content": "CIHL games have been cancelled for the 2020-2021 season. There will be no season games played between Prince Rupert Rampage and Hazelton Wolverines as seen in the 2019-2020 CIHL playoffs. (Photo: K-J Millar/The Northern View)\n\nHockey gameplay has been cancelled for the Prince Rupert Rampage and the Central Interior Hockey League (CIHL) with the senior mens AA 2020/2021 season being benched by the global pandemic.\n\n“With what has been going on around the world it’s time for us as a league to come to terms that a 2020-21 CIHL season is not looking like it will be possible,” Ron German president of the CIHL said in a media release on Nov. 24.\n\nThe CIHL hockey league includes the Prince Rupert Rampage, Terrace River Kings and teams in Kitimat, Smithers, Hazelton, Williams Lake and Quesnel.\n\n“We had a schedule to start December 4th but with recent restrictions feel that in in any circumstances less than a super miracle vaccination, we would probably not return to play with spectators in time to salvage a 20-21 season,” German said.\n\nRupert Rampage President Travis McNeice said it is extremely disappointing for the players, spectators and the league.\n\n“The games keep the town upbeat in the winter. It’s is very sad,” he said. “The Rupert Rampage are a community team with community spirit. We want to be out there supporting our community in any way we can.”\n\nMcNeice said while he hasn’t yet has an opportunity to address the players himself about the cancellation however practice will still go on this Thursday night. The team has been staying up-to-date with the latest COVID-19 updates. Players have been keeping fit by attending the gym and having on ice practice time so they were ready to go if the games could go on.\n\n“Hopefully, when COVID allows we will be able to have some exhibition games with Terrace or Kitimat,” McNeice said.\n\nGerman said that if conditions regarding the COVID-19 pandemic change in 2021, the league would explore the possibility of playing exhibition games if BC Hockey and local guidelines could be met.\n\n“We are thankful the support of each community, their fans, volunteers and sponsors for the opportunities they have given the league, the teams and the players, without their past and future support we would not be able to host these great community events. We will need their support more than ever to start back up.”\n\n“The CIHL will be back as soon as we can play in front of our valued communities and fans,” German said.\n\nwith files from Ben Bogstie\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-25 15:10:00-08:00",
    "title": "Rupert Rampage season cancelled amidst global pandemic – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/rupert-rampage-season-cancelled-amidst-global-pandemic/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}