{
    "authors": [],
    "content": "Saulteau First Nation is one of the many Indigenous communities that have partnered with Coastal GasLink. Photo by Coastal GasLink.\n\nFrom the City of Dawson Creek to the coastal District of Kitimat, the 670-kilometre Coastal GasLink project spans dozens of local and Indigenous communities.\n\n“At Coastal GasLink, our success is measured by the breadth of support we see every day from Indigenous and local communities across our project route,” said Kiel Giddens, Coastal GasLink’s Manager of Public Affairs and a Prince George community member. “Seeing everyone come together, from local leaders to our workers and contractors, to safely build this project and support one another has been so inspiring for us.”\n\n“Our future is being built every day with support from communities, allowing us to achieve important construction milestones,” notes Giddens\n\nThere are more than 3,500 women and men, many of them from Indigenous and local communities along the project route, safely at work on the project.\n\nFor Vanderhoof Mayor Gerry Thiessen, Coastal GasLink is part of their community. “With everything that’s happened in 2020, and the highs and lows of the forest industry, having a consistent project like Coastal GasLink become part of the community at a time when we’ve needed it has proven to be a real positive benefit to Vanderhoof,” said Mayor Thiessen.\n\nLikewise, Dawson Creek Mayor Dale Bumstead shared how the project builds community. “People come to our communities and our cities to live and have a great job and a great quality of life. And that’s what this will do for us,” said Mayor Bumstead.\n\nThe project has also created valuable contracting opportunities for local and Indigenous-owned businesses, allowing them to expand their businesses, employ members, and build capacity for future opportunities.\n\nSaulteau First Nation is one of those communities. “We’ve had a lot of opportunities brought to us through Coastal GasLink, which has been supremely beneficial for our membership and for the nation as a whole,” said Chief Justin Napoleon from the Saulteau First Nation. “I think that’s been the greatest benefit for us, being able to take on projects ourselves and employ our own members.”\n\nFor Mayor Sarrah Storey, Coastal GasLink is a welcome development for local businesses after years of ups and downs. Photo by Coastal GasLink.\n\nOf course, it’s not just contracted businesses that benefit from the project. Local coffee shops, furniture providers and manufacturers, to name a few, are all helping to build Canada’s largest private sector project.\n\n“We are really looking forward to the energy this is going to bring to our area and our businesses. Seeing a project like this in our area is huge and very much needed and appreciated,” said Mayor Sarrah Storey of the Village of Fraser Lake.\n\n“The project is being built not only to benefit northern people and communities today, but with the goal of leaving a lasting, positive legacy for decades to come,” concludes Giddens.\n\nTo learn more about Coastal GasLink and receive project updates, please visit CoastalGasLink.com.\n\nenergy sector",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-16 06:00:00-08:00",
    "title": "Community support is the bedrock of the Coastal GasLink project – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/marketplace/community-support-is-the-bedrock-of-the-coastal-gaslink-project/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}