{
    "authors": [
        "Associated Press",
        "Canada"
    ],
    "content": "VanVleet’s deal was the second major development for the Raptors in two days\n\nToronto Raptors guard Fred VanVleet (23) shoots in front of Boston Celtics center Robert Williams III (44) during the first half of an NBA conference semifinal playoff basketball game Wednesday, Sept. 9, 2020, in Lake Buena Vista, Fla. (AP Photo/Mark J. Terrill)\n\nFred VanVleet bet on himself. It paid off.\n\nVanVleet agreed Saturday to a four-year, $85 million contract to remain with the Toronto Raptors, a person with direct knowledge of the discussions told The Associated Press on condition of anonymity because the contract remains unsigned.\n\nThe fourth year of the contract is at VanVleet’s option, the person said.\n\nThe undrafted guard from Wichita State has played a huge role in the Raptors’ recent successes, most importantly their run to the 2019 NBA championship. He has set career bests in scoring by wide margins in each of the last three seasons, that number rising to 17.6 points per game this past season.\n\nKeeping VanVleet was of major importance to the Raptors, who have won at least 50 games in each of the last five seasons — by far the longest current streak in the NBA. Milwaukee has a two-year such streak, and the reigning NBA champion Los Angeles Lakers reached the 50-win mark last season.\n\nIt also fulfilled a VanVleet prophecy: He famously went undrafted four years ago, then passed on some low-money deals that he figured wouldn’t pan into much.\n\n“I turned those down. I bet on myself,” VanVleet told friends and family on what would have been his draft night, a festive occasion that turned disappointing when the call from the NBA never came.\n\nThe Raptors brought him in on a summer-league deal, then a minimum deal, then gave him a two-year contract for $18 million two years later — and now gave him the full reward.\n\nKyle Lowry, the veteran point guard and longtime leader of the Raptors, has predicted that VanVleet will take over that role one day. The deal agreed to on Saturday only cements that sort of thinking.\n\n“He’s going to be rewarded,” Lowry said after the Raptors were eliminated with a Game 7 loss to Boston in this past season’s Eastern Conference semifinals. “To me, that means the world that he can take care of his family and take care of his family at a high level.”\n\nThat’s no longer in doubt.\n\nFree agency opened in the NBA on Friday evening and VanVleet was one of the top available names. The Lakers’ Anthony Davis remains unsigned though is expected to remain with the defending champions, and Gordon Hayward’s future was another of the top questions remaining in the league as Day 2 of free agency began Saturday.\n\nVanVleet’s deal was the second major development for the Raptors in two days. On Friday, the team announced that it would begin this season by calling Tampa, Florida, home because of travel issues related to the coronavirus pandemic — specifically the challenge of getting NBA teams over a U.S.-Canada border that is closed to nonessential travel.\n\nIn other matters Saturday:\n\nATLANTA\n\nThe Hawks added guard Kris Dunn on a two-year contract worth $10 million, a person with knowledge of the move told AP. That move came after Atlanta also landed Danilo Gallinari on Friday to a three-year contract.\n\nMIAMI\n\nMoe Harkless, who was briefly — on paper, anyway — a member of the Heat in July 2019 before getting moved as part of the trade that brought Jimmy Butler to Miami, is now with the Heat and for real this time.\n\nHarkless agreed to a $3.6 million contract, a person with knowledge told AP. For now, the Heat intend to use their biannual exception to land Harkless, who averaged 5.6 points in 62 games last season with the Los Angeles Clippers and New York.\n\n___\n\nTim Reynolds, The Associated Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nNBA",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-22 07:50:00-08:00",
    "title": "VanVleet staying with Raptors on 4-year deal: AP source – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/sports/vanvleet-staying-with-raptors-on-4-year-deal-ap-source/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}