{
    "authors": [
        "K-J Millar"
    ],
    "content": "CHSS Basketball\n\nKevin Sawka is coach of the Charles Hays Secondary School junior boys basketball team and is the instructor of the basketball academy at the school.\n\nThe academy runs as a class at the high school where two cohorts of mixed students receive credit for completion from grades nine through 12.\n\n“It is pretty involved. In non-COVID circumstances, they get three mornings and two after-school sessions which alternate week by week between the two cohorts,” Sawka said.\n\nHowever because of COVID times are restricted to two mornings and two after school sessions for each group, as well as the community connections project where the 11’s and 12’s pair up with minor basketball coaches has been removed this year, Sawka said.\n\n“In terms of high school, first of all, we’ve been really lucky that we have the basketball Academy,” Sawka explained. “The kids in that course are all kids that would be intending to try out for their perspective levels of basketball that year. So any, anybody that would be looking to play for their high school team would be enrolled in that course, essentially.”\n\n“I’m trying to stay optimistic and keep my fingers crossed that a high school basketball season does happen. But also, at the same time seeing the climate within the province here – preparing for the potential of not having a high school season,” Sawka said.\n\n“The way I’m running the basketball academy this year is a bit more of a slow burn, like, not trying to jam a whole bunch into September, October, November, but trying to kind of spread it out over the whole school year.”\n\nSawka said due to the cohort rules under COVID students need to be masked under certain circumstances. He provided the students the choice at the beginning of the academic year to mask up during the hour and a half basketball academy or mask up during the rest of their classes which could be up to five and half hours per day. They unanimously voted to mask up during basketball even though playing sport and breathing through a mask can be difficult. However, some students feel more comfortable wearing their masks all day and do so.\n\nThere are no intramural basketball games during COVID and while typically equipment would be left out at lunchtimes for students to play, during the pandemic that is not occurring. Sawka said sports that would typically be underway at the high school and middle school levels by now, just are not happening currently.\n\n“If we didn’t have the basketball academy at the high school, most likely we wouldn’t be doing anything right now because we wouldn’t be allowed to,” Sawka said. “And it’s gonna allow us to keep things afloat if a season actually goes through or not.”\n\n“The competitor in me really, really wants a high school season. I’m keeping my fingers crossed for that because that’s what it’s all about. It’s the competitive drive – that’s why we work so hard in the offseason is for the season,” the coach said.\n\nCoach Sawka said he wants to see the high school team go three for three and bring back another banner because it will be especially tough on the grade 12’s if there is no season. With the preseason rankings from the spring of last year, the team would easily be in the top four again, he said.\n\n“Because that group has been very hard working by and large, and are a really strong group … “\n\nSawka praises the team and said the school team’s back to back banner win is unprecedented, but a “threepeat” would be very rare.\n\n“Believe me our grade 12’s want every piece of that. They want the opportunity to get that. I am really proud of that group of kids who have worked hard in that program. I want nothing more for them to have that chance and put up another provincial banner.”\n\nSawka explained under the BC school sports rules they are currently in Phase 2, so if a cohort has been pre-established practice is permitted inside that school group. However, he said intra-school sports are not permitted with other schools right now.\n\nThis is not the same with community sport which has different governance through ViaSport and is currently in Phase 3 of their guidelines, he said.\n\nCommunity Minor Basketball Association\n\nWhen Sawka is not instructing basketball at the high school level, in his spare time he is vice president of the Prince Rupert Minor Basketball Association, which has also been scaled back due to the coronavirus.\n\nUnder the Phase 3 pandemic protocols community basketball teams are permitted gameplay as long as they play in unchanging age groups.\n\nSawka said three years ago they expanded court time to two practices and one game a week, however this year due to the health crisis the players have one practice and one game a week.\n\n“So in terms of PRMBA, we’ve got two age levels per cohort – so grades three -four, grades five-six, and grade seven-eight,” Sawka said.\n\nThe MBA in Prince Rupert capped the age cohorts at 40 players, which allows for the maximum cap of 50 people in the gym at one time, with coaches and staff included.\n\n“We were successful in implementing that cap, which was fantastic to see because we were wondering if the Coronavirus would have an impact on people wanting to still have their kids involved in community sports and stuff.”\n\nThere are a good number of players enrolled this year, but not nearly as many in the grade three-four age group, Sawka said.\n\nUsually, the PRMBA season starts by Sept. 10, but this year the league had to wait for the City of Prince Rupert.\n\n“This year, we had to wait until the Civic Centre had done all of their due diligence and protocols and all that kind of stuff to open up their facility. Because we’re just a user of their facility we had to wait for them to get all their ducks in a row.”\n\nSwimming\n\nRacquetball and Squash\n\nTami Orear manager of the Prince Rupert Racquet Association said the club is currently open for members only, and can not allow drop-ins under the pandemic protocols.\n\n“We are a private club so we are open exclusively to the members,” she said.\n\nUnder the guidelines of the Minister of Health and also Squash B.C. which Orear said they follow strictly, the club hours do have restrictions. Two people per court are permitted with three courts in the building.\n\n“There are playing guidelines that players need to follow. People play with-in their bubbles.”\n\nThe social space on the upper floor of the club, which includes a bar is usually available for rentals. Under the regulations 50 people are permitted, however, the club wants to be cautious.\n\n“I do small events of 25 or less, however, that is few and far between just because there are a lot of restrictions to that,” Orear said. “We do 25 or less because we are able to safely social distance the tables. So, six people only to a table.”\n\nAlso, the COVID-19 liquor sales rules affect the club with the same compliance required as that of restaurants and bars having last call at 9:45 p.m.\n\n“There is no dancing permitted. No dance floor. Music can not be played loud. There are a whole bunch of restrictions,” she said.\n\n“So everybody has to use their own equipment. There are no rentals … you are not allowed to share equipment. (Players) have to check-in and we use an online system and we have a datebook as well. these are set out as part of the guidelines we have to follow.”\n\nShower facilities are available at the club, however, members are encouraged to play and go home, Orear said.\n\nThe call volume to the racquet club has increased and been higher than previous years Orear said, and she puts it down to the wet summer season in the region. However, due to COVID-19 restrictions, the drop-in play has not been permitted which hurts the club’s bottom line. “\n\n“Unfortunately, we’re unable to do that. We are a non-profit society. So we do count on those funds. Unfortunately, we’re on a shoestring budget right now.”\n\nThere have been a few new memberships but nothing significant over last year, she said. The club has courts for racquetball, squash, and pickleball, as well as a tenant who provides a spin class.\n\nPickleball is an up and coming sport Orear explained. It is a game similar to table tennis but in a court.\n\nOver the summer when the club was in pandemic shutdown, the facility had more than $20,000 in renovations with new glass back walls being installed. Orear said one of the club members helped facilitate the funding from Northern Development Initiative Trust and the Prince Rupert Port Authority to complete the project.\n\n“We are just a little hidden gem, next to the golf course, ” Orear said.\n\nGymnastics\n\nPrince Rupert Gymnastics Association (PRGA)is eagerly waiting to move into its new gym which should start construction in the old Canfisco building in January or February of 2021. With more than $90,000 of state-of-the-art equipment just ordered, including a springboard floor, head Coach Erin Hipkiss told The Northern View that the lease for the facilities was a done deal and their copy had been collected on Nov. 13.\n\n“All of the things you would want in a dream facility are all coming together. I am very thankful during this time of COVID that we are able to expand. There are a lot of clubs that didn’t make it through COVID and it has been a heartbreaking time.”\n\nThings have been “pretty smooth” for the Prince Rupert club since COVID-19 Hipkiss said with the gymnasts lucky to live in Prince Rupert away from higher clusters of the virus which have affected a lot of lower mainland clubs. After the initial March shut down Prince Rupert Club opened its doors in the first phase on June 16 with the older competitive athletes coming in to work on social distancing policies.\n\n“As the BC government started opening up their phases, our return to sport policies changed as well,” Hipkiss said. “We are actually offering full programs right now, but definitely at a very limited capacity.”\n\nOne of the major changes that affected the association was the coach to athlete ratio being reduced to five participants to one coach, which is down from 10 participants to one coach, for example in the parent and tot class numbers were cut in half Hipkiss said.\n\n“Currently our programs are all sold out. We do have waitlists and it’s just a matter of the size of our facility right now. Because our facility is so small we can’t even offer the up to 50 people in one spot. We just don’t have the space to even accommodate that number.”\n\n“It is going to be huge to have that extra space and bring in more participants that want to be taking our classes,” she said. “It breaks my heart that we can’t right now. We are just maxed out.”\n\nPrior to COVID-19 Prince Rupert coaches travelled weekly with the competitive team of gymnasts to use gymnasium facilities in Terrace to practice floor routines due to the limited space in P.R. The travel has been suspended and Hipkiss said she doesn’t feel confident travelling with the athletes in such times to other locations for training and competitions.\n\nAnother that changed drastically for the association was the cleaning protocols with staff spending a lot of time cleaning and sanitizing in between classes to ensure all of the equipment has been sprayed properly.\n\nTo be more efficient with cleaning time and practice coaches are wearing masks, hand cleaning and specialized equipment has been purchased for the safety of the athletes and coaches.\n\n“We actually ended up purchasing a vital oxide fogging machine. This allows us to completely fog the entire space. So within about 15-20 min. our 3500 sqft space is completely sanitized,” she said.\n\nPrince Rupert Gymnastics Association is one of the only clubs in the north running parent and tot classes for children under the age of three years old Hipkiss said. To obtain the fogging machine was the number one priority for the organization in holding the parent and tot aged groups.\n\n“For me this was a hugely important age group to keep in the gym. Brain development at that stage is huge with the development of their movement capabilities. It all goes hand in hand. It is such a key time in the development of a human to get in there and learn to run, crawl, and hang on a bar.\n\nThe fogging machine itself cost just over $600, however, the cleaning solution used in it gets a bit tricky Hipkiss said because they purchased it by the barrel full. The barrels do not fit inside the gymnastics facility so need to be stored off-site. It needs to be transferred to smaller jugs so it can be transported to the club for use. Each machine use costs between $20 to $30 in cleaning solution.\n\n“When I look at finacials of how much we are currently spending on cleaning, Saturdays themselves are at least $100 in cleaning solution. When we look at a schedule of 13 weeks, Saturdays alone cost $1300,” Hipkiss said. “So, it’s huge for us to be taking on a project such as moving into the Canfiscos building during COVID. It is definitely an anxious time when you talk about fundraising and having enough funds to get us into this new gym.”\n\n“I am super thankful that were are up here in the North and that we have the Board of Directors that we do,” the head coach said. “It has been instrumental to have the right people and come up with creative ideas to get the fundraising going and to make sure we are able to offer these classes.”\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.\n\nArianna Mac Neil balances on the beam at the Prince Rupert Gymnastics Club in Prince Rupert on Nov. 13.\n\nAva Clarance sets herself up for a turn on the bar at the Prince Rupert Gymnastics Club on Nov. 13. (Photo: K-J Millar/The Northern View)\n\nSam Sumanik cartwheels off the beam on Nov. 13 at the Prince Rupert Gymnastics Club (Photo: K-J Millar/The Northern View)",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-19 01:30:00-08:00",
    "title": "Sportsnet around the City – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/sportsnet-around-the-city/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}