{
    "authors": [
        "K-J Millar",
        "Local News"
    ],
    "content": "Prince Rupert School Board for District 52 held it’s first meeting of the 2020-2021 academic year on Sept. 15, announcing some changes to procedures due to COVID-19. (Photo: K-J Millar/The Northern View)\n\nCOVID-19 Exposure – Recap\n\nOn Thursday, Oct. 29, 2020 School District No. 52 (Prince Rupert) was made aware by Northern Health that a member of the school community at École Roosevelt Community Park School had tested positive for COVID-19.\n\nThe district worked with Northern Health and the Medical Health Officer and followed their guidance. Any individual deemed to be at risk of exposure was contacted directly by Northern Health.\n\nIt is now over two weeks after the date of the positive test.\n\n“Please be reassured that our schools continue to implement the strict protocols and procedures we have in place so that students and staff can continue to attend school as safely as possible. The safety and well-being of our students, families and staff remains our highest priority,” the board stated.\n\nFor any COVID-19 related questions, please contact: Northern Health Online Clinic at 1-844-645-7811.\n\nConrad School Start-Up\n\nPrincipal Kerri Levelton and vice-principal Tania Murray reported on the start-up at Conrad Street Elementary School. There are many differences in the way school is now run, in particular with visual reminders and lots of hand washing! Students are kept in cohorts, in part through divided recess and lunch breaks. Each class has a designated entrance and exit.\n\n“The Board was pleased to hear of the school’s participation in the Downey & Wenjack Fund’s legacy school project,” said board chair James Horne. “We hope everyone will enjoy the memorial rocks students have placed on the Rushbrook trail.”\n\nFramework for Enhancing Student Learning\n\nThe Framework for Enhancing Student Learning Committee met on Tuesday, Nov. 3. The Committee focused on the design of the student survey. The data from these surveys will inform the district’s Framework report, which must be prepared annually in accordance with the Ministry of Education’s new order.\n\nThe Framework will be completed in conjunction with a renewal of the district’s Strategic Plan.\n\nBoard Appointments\n\nChairperson: James Horne\n\nVice Chairperson: Kate Toye\n\nBCSTA Provincial Council Member: Kristy Maier\n\nBCSTA Provincial Council Alternate: Louisa Sanchez\n\nBargaining Representative Council Member: Bart Kuntz\n\nBargaining Representative Council Alternate: Kate Toye\n\nSchool Liaison Appointments\n\nCHSS: Kate Toye Conrad Louisa Sanchez\n\nÉcole Roosevelt: Kristy Maier\n\nHartley Bay: Louisa Sanchez\n\nLax Kxeen: Tina Last\n\nPacific Coast: James Horne\n\nPineridge: Bart Kuntz\n\nPort Edward: Janet Beil\n\nPRMS: Janet Beil\n\nSchool Board Representatives\n\nPersonnel Committee: James Horne, Kate Toye\n\nFramework for Enhanced Student Learning: Kate Toye, Louisa Sanchez\n\nFinance and Building Committee: Kate Toye, Kristy Maier, Bart Kuntz\n\nPolicy Committee: James Horne, Janet Beil\n\nOther Appointments\n\nAboriginal Education Council: Kate Toye\n\nAboriginal Education Council Alternate: Tina Last\n\nDistrict Parent Advisory: Kristy Maier\n\nDistrict Parent Advisory Alternate: Kate Toye\n\nDistrict Technology: Bart Kuntz\n\nDistrict Scholarship Committee: Louisa Sanchez\n\nCanadian Parents for French Kristy Maier\n\nCanadian Parents for French Alternate: Louisa Sanchez\n\nHealthy Community Integration Committee: Kate Toye\n\nLester Centre of the Performing Arts: Janet Beil\n\nLester Centre Alternate: Tina Last\n\nEquity Scan: Louisa Sanchez",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-30 09:15:00-08:00",
    "title": "School District 52 highlights – Oct. 29 meeting – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/local-news/school-district-52-highlights-oct-29-meeting/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}