{
    "authors": [
        "Tracy Holmes"
    ],
    "content": "Helen Watson, posing for a photo for her 100th birthday, turned 105 on Saturday (Nov. 21). (File photo) Helen Watson’s family had this book made to commemorate her 100th birthday. Watson turned 105 on Nov. 21, 2020. (Aaron Hinks photo)\n\nWhen Helen Watson’s birthday rolled around last Saturday (Nov. 21), she couldn’t party like she was 100 – as she did five years ago, when she actually turned 100 – but the South Surrey senior wasn’t complaining.\n\nREAD MORE: Milestone birthday ‘a whirl’ for South Surrey senior\n\n“It was very nice, everybody was so good to me,” Watson told Peace Arch News Monday (Nov. 23) of her 105th birthday celebration.\n\n“It was just fine the way it was.”\n\nThe COVID-19 pandemic firmly quashed any plans that may have otherwise been made to celebrate the occasion in the fashion it deserves.\n\nPandemic protocols months ago changed how family visits could take place for Watson, and earlier this month – after restrictions were ramped-up due to the ongoing surge in cases – the visits were halted altogether, in the name of safety.\n\n“Nobody’s allowed in right now, and that’s OK with us,” Watson’s son, Larry, said last week. “I understand that they’re very strict there. I’m glad they’re doing that because it’s for the safety of everyone there.”\n\nLarry said he and his wife had shifted how they visit some time ago, to standing at a safe distance outside his mom’s window and speaking to her over the phone. They could see and hear each other more clearly than through the Plexiglas screen that had to separate them inside, he explained, and “it seems like a better visit.”\n\nThe 79-year-old said it’s difficult to sum his mother’s life up in just a few lines. Words that describe her have long included artist, independent and feisty.\n\nNow, the description also includes ‘survivor of two global pandemics,’ as Watson was three years old when the Spanish Flu struck in 1918.\n\n“Her parents were affected by it, her father, he went deaf from it,” Larry said.\n\nLarry said his mom is “very surprised… and maybe a little upset” about the current pandemic, “because she can’t see her family.”\n\n“That’s the hard part for her, that she doesn’t get to see anybody.”\n\nWhen Watson first joined the ranks of centenarian in 2015, she welcomed a PAN reporter into her home, sharing a snippet of her creative side and just a few of the countless memories and experiences she has had – from an early childhood in Saskatchewan, to seeing her first airplane, to meeting her husband while working at St. Paul’s Hospital in Vancouver, to travelling solo around the province and into the U.S. into her early nineties.\n\n“I did everything,” she said at the time.\n\n“She wasn’t scared to go out and do things,” her son said Monday.\n\nThe family marked Watson’s first 100 years by publishing a book of photos, and this year, made her a blanket to take the chill off. They’re looking forward to days when they can have a proper visit.\n\n“Hopefully everything will be OK in six months or so and her family can get back in and see her.”\n\ntholmes@peacearchnews.com\n\nCoronavirusSeniorsSurrey",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-24 10:30:00-08:00",
    "title": "B.C. woman who survived Spanish Flu turns 105 – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/community/b-c-woman-who-survived-spanish-flu-marks-105-years/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}