{
    "authors": [
        "Adam Louis"
    ],
    "content": "Renegade Prospectors co-founders Rick Curiston and Tina Francis pose near Cayoosh Creek. Former Agassiz resident Curiston recently celebrated one year sober from alcohol and eight years drug-free, loving his new lease on life, family and their love for treasure hunting. (Contributed Photo/Tina Francis) Tina Francis makes pendants out of the stones the family finds while prospecting on Cayoosh Creek. (Contributed Photo/Tina Francis) Rick Curiston and Tina Francis pose near the water. The couple followed through on a sobriety pact and have taken up prospecting near Lillooet. (Contributed Photo/Tina Francis) Rick Curiston and 4-year-old daughter Paisley sift through the dirt in search of gold in Cayoosh Creek. Curiston and his fiancee Tina Francis document their mining adventures on YouTube. (Contributed Photo/Tina Francis) Rick Curiston’s daughter Paisley beams as she shows off her latest find. The youngest member of Renegade Prospectors currently holds the family record for the biggest amethyst found. (Contributed Photo/Tina Francis)\n\nA man raised in Agassiz has found his calling among the rocks and clear blue waters of Cayoosh Creek.\n\nAlong his journey of sobriety after a long battle with drug and alcohol addiction, Renegade Prospectors co-founder Rick Curiston – now loving life in Lillooet – hopes to turn his prospecting passion into a new career.\n\nCuriston’s skills in video editing and creating content he developed as a DJ spurred him on to create a YouTube channel, documenting his new-found love of small-scale mining and prospecting.\n\n“Everyone in Agassiz would most remember me as the crazy DJ that partied all night, and I was in the festival scene for many years before COVID,” he said.\n\nThe name Renegade Prospectors is a reference to his former annual festival “Weekend Renegade.”\n\n“I smoked crack for 11 years,” Curiston said. “I’ve been clean for eight. I found prospecting 11 months ago, and I’ve been sober for a year.”\n\n“I’ll always be an addict, but now it’s for gold,” he added.\n\nCuriston and his fiancee Tina Francis made a pact to get sober together and stuck to it. The Renegade Prospectors logo contains a nod to the couple’s past; the web in the dream catcher resembles the dopamine molecule. Dopamine is a neurotransmitter linked to the brain’s pleasure centre and plays a key role in the forming of habits, both good (socializing, eating properly) and bad (gambling, addiction).\n\nREAD ALSO: Local miner eyes Bear Mountain for gold\n\nHe vividly remembers the first time he found his first piece of gold while panning along Cayoosh Creek.\n\n“Prospecting takes us to a whole new level,” Curiston said. “The high I got from seeing that [first piece of gold] – shake [the pan] back, and bang! There it was. I jumped right up and yelped.”\n\nCuriston hopes to incorporate parts of his First Nations ancestry in his YouTube channel – also named Renegade Prospectors – speaking on local legends in addition to showcasing his prospecting finds. He hopes to turn his channel and his hobby prospecting into a career.\n\nProspecting, hobby mining and panning for gold is the trendy new hobby in the Cayoosh Creek area, according to Curiston.\n\n“It’s booming right now because of COVID; we’ve bumped into a lot of people, all newbies,” he said. “There’s nothing else to do!”\n\nAfter seeing Curiston and Francis’s success, the couple’s received private messages across social media looking for their expertise in the hobby.\n\nAgate seems to be their most common find.\n\n“It’s huge on agate,” Curiston said of the Cayoosh Creek area. Agate is a volcanic rock that melds chalcedony and quartz.\n\nPrior to venturing out, Curiston looks for irregularities and coloration in the land using Google Earth to help him determine where to look next.\n\n“We haven’t found ‘nothing’ yet. Every time, it works,” Curiston said.\n\nThen, off he goes treasure hunting with Francis, 4-year-old daughter Paisley and loyal canine friend Biscuit.\n\n“[Paisley] even has her own hat, vest, gear and tools for digging agates and amethyst,” Curiston said. “She’s still the holder of the best purple piece of amethyst to date! Due to her being so close to the ground, she finds the really nice stuff.”\n\nREAD ALSO: B.C. museum receives donation of 52-million-year-old fossils\n\nAmong their biggest hauls is a 35-pound piece of agate and amethyst chunks the size of Curiston’s fist. He described the first amethyst find as a “pocket glowing with purple inside.”\n\n“That was it, all high fives,” he recalled. “We started chiseling; it’s took two and a half hours to get it out of super hard, hard rock. It was super, super dense rock, but it was very worth it.”\n\nFrancis is enrolled in online schooling for business skills and has been working on building blogs. She crafts pendants – doing everything from polishing to cutting gems to assembling the pendants themselves – from the agate they find while prospecting and has sold a few already to friends and family.\n\nWhen they’re not treasure hunting, the family likes to fish for trout and hike, exploring familiar trails, relics and old mining sites possibly hearkening back to the days of the Cayoosh Creek Gold Rush in the late 1800s.\n\nCuriston and Francis have been posting videos since late August on YouTube, garnering just under 40 subscribers so far. Their Facebook page is more active with more than 100 followers as of publication; the page features photos of their finds, video briefs out in the field and articles about mining and prospecting. They have also set up a Patreon page for those who want to support their work and content.\n\n“Thanks to those who have helped me, guided me into the world of prospecting and who have supported me along the way,” Curiston wrote on Facebook at the one year sober mark. “I appreciate every one of you. Life has changed a lot in the past few years and I’m so happy I can live every day now, clean and sober.”\n\nDo you have something to add to this story, or something else we should report on? Email:\n\nnews@ahobserver.com\n\nLike us on Facebook and follow us on Twitter\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nAgassizFirst Nationsmining",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-19 09:58:00-08:00",
    "title": "Former Agassiz DJ turned prospector finds treasure, renewed life in Lillooet – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/community/former-agassiz-dj-turned-prospector-finds-treasure-renewed-life-in-lillooet/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}