{
    "authors": [
        "K-J Millar",
        "Local News"
    ],
    "content": "Prince Rupert and area has had five cases of COVID-19 since January\n\nPrince Rupert has seen five cumulative cases of COVID-19 since January, while other areas in northern B.C. like Smithers, have experienced significant jumps since mid-October.\n\nReported cases in the north are mapped out by BC Centre for Disease Control showing 27 cases in Haida Gwaii which stems from a summer out-break, Terrace had 22 cases, Kitimat has had four cases, the Nass Valley has had two cases and Smithers tops the numbers at 42 cases. According to the published data Smithers is more than double what it was at the same time last month.\n\nWhile the CDC reports every day or every other day on regional statistics and weekly for health service delivery areas, local numbers are only updated monthly. Health authorities are still not reporting numbers for individual communities.\n\nThe CDC dashboard for tracking numbers showed on the afternoon of Nov. 12 in the Northern Health Region out of 499 cases, five cases are currently hospitalized with four of those in ICU. There are 60 active cases of COVID-19 in the Northern Health Authority region.\n\nAs the spread of the virus is accelerating through Canada, the North Coast has relatively low numbers being in the category of less than 50 cases per 100,000 population.\n\nThe doubling of the Smithers numbers in one month comes as the spread of the virus is accelerating throughout Canada, particularly, in certain areas of Ontario and on the prairies. It puts the Smithers LHA well ahead of others in the Northwest with the exception of Haida Gwaii, which has been COVID free since the summer out-break.\n\nFor B.C., the CDC is reporting 594 new cases as of this morning (Nov. 13). Yesterday (Nov. 12), Dr. Bonnie Henry, the provincial health officer expressed concern that the cases in the province are doubling every 13 days.\n\n“We’re accelerating the number of cases in our community,” she said.\n\n“We are in a challenging time, perhaps the most challenging time of this pandemic.”\n\n– With files from Thom Barker",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-19 01:30:00-08:00",
    "title": "North Coast has seen relatively low COVID-19 numbers – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/community/north-coast-has-seen-relatively-low-covid-19-numbers/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}