{
    "authors": [
        "K-J Millar"
    ],
    "content": "First it was Hammy, then Yogi, now it’s Stickler!\n\nStickler is the third Prince Rupert deer in recent years to be sighted with unusual headgear. (Photo: Todd Hamilton/The Northern View)\n\nFirst there was Hammy, then Yogi, now there is Stickler.\n\nIn 2017, Hammy, a Prince Rupert deer, became an international sensation after getting caught in a purple backyard hammock. Hammy was cut free by RCMP officers, however, the police were unable to remove the entire hammock before he ran off, which became wrapped around his antlers.\n\nFor the following weeks, the young deer swaggered around Prince Rupert with his hammock crown wrapped around his antlers and became known as Hammy. Hammy was a social media darling and even received his own Facebook page as Prince Rupert noted Hammy sightings.\n\nREAD MORE: UPDATE: Hammy dodges conservation officers\n\nOn Oct. 26 came Yogi.\n\nYogi created a stir after getting a large, pink yoga ball stuck between his antlers. Something that conservation officers, who spent weeks chasing Hammy to remove the hammock, were less serious about.\n\n“The ball will pop and he won’t be as popular,” Sgt. Tracy Walbauer of the Terrace Conservation Office said.\n\nREAD MORE: PHOTOS: Hammy 2.0? Prince Rupert deer spotted with bright pink yoga ball stuck in antlers\n\nNow, Stickler has shown up.\n\nOn Nov. 3, the young buck was spotted parading around Prince Rupert with a large, moss-covered branch.\n\nIn keeping with his new Prince Rupert name, it appears he had a fight with a tree but refused to back down until the tree gave up.\n\nPrince Rupert appears to have Hammy 3.0.\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-03 14:15:00-08:00",
    "title": "O Deer, Hammy has competition – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/o-deer-hammy-has-competition/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}