{
    "authors": [
        "K-J Millar"
    ],
    "content": "Colleen McLaren is an artist in every sense of the word - showing her work on Oct. 21. She is a Prince Rupert author, painter, singer, actress, hairstylist, and revitalizer of Pillsbury House. (Photo: K-J Millar/The Northern View)\n\nColleen McLaren is an artist in every sense of the word. The francophone chantress, painter, and author has made Prince Rupert the canvas of her life since moving to the city more than 40 years ago as a single mom to start a new beginning.\n\nAlways embraced in creativity growing up, Colleen’s mother was a hairdresser and her father was an undertaker and later a railway engineer. Colleen started singing at six years old when the nuns in her catholic school found she could do far more than just hold a note in the choir. As she grew so did her vocal talent with training in classical singing. After she left school, she would work at hairdressing during the day and sing with the big bands in the evenings making the occasional television performance.\n\nColleen got married young and had a son. Her marriage was abusive and shortlived she said, which she writes about in a book titled “I Got This” compiled of women’s empowerment stories. It went on to become an international bestseller, she said.\n\nAfter her marriage broke-up and returning to live with her parents she soon had a wanderlust for places other than the small northern Ontario town in which they lived.\n\nColleen’s sister had already settled in Prince Rupert and it seemed natural to be with family. In 1981, she made Prince Rupert her home. As a hairdresser, Colleen built her reputation in town with creativity and business acumen operating several different hair salons over the years. She would often volunteer services to assist with high school fashion shows and various functions.\n\nWhen the Lester Centre of Performing Arts opened in 1988, Colleen starred as the orphanage matron Ms. Hannigan in the centre’s first production.\n\nRaising her son, operating businesses, and living the best life she could became her priority. All the time, she said she was searching for who she really was and where she fit in. Colleen said her and best friend Collette who had moved from Ontario made the decision to enjoy life.\n\n“When I got here, I had never seen a mountain or an ocean,” she said. “The nightlife in Prince Rupert at the time was wild and crazy. The people were beautiful characters.”\n\nREAD MORE: The tides of time for Prince Rupert Airport Ferry – 50th anniversary sails quietly by\n\nOne morning while having breakfast in Breakers, Colleen said she came to the realization that she was already living the dream and Kaien Island was, in reality, her own idealistic ‘island in the Pacific’. The idea grew into a story that she entered into a writing contest and was eventually published. While life was good, she also knew she had to plan for the future and retirement.\n\nIn an ironic twist, of which Colleen said there are several in her life, the woman who as a small child once told her mother that she would live in an abandoned house when she grew up, has spent the last 25-years building the profile of the foundational residence of Prince Rupert.\n\nPillsbury House was originally built in 1908 as the first residence in the city. It was designed and engineered in collaboration by Joel H. Pillsbury who was the harbour engineer and Charles M. Hays founder of the Grand Trunk Railway. The house became home to the Pillsbury family and many railroad officials during the birth and establishment of the city.\n\nAs with age and an older condition the harder economic times reflected in the upkeep of the city’s original residence which had become run down and a hollow shell standing empty, overlooking the waterfront.\n\nOne day in the mid-1980s Colleen was walking with her grandchildren when she saw the house in it’s forgotten state.\n\n“The house had become invisible over the years with its deterioration,” Colleen told The Northern View. “I hadn’t even known it was there. You couldn’t see it for all the trees and growth.”\n\n“One day as we were walking past, the sun washed it in light and it was like the house was beckoning me,” she said. “I told my grandkids that Granny was going to live there one day.”\n\nPillsbury House fell into further disarray and was eventually sold by the railway to the City of Prince Rupert. It was 1995, and Colleen had realized that she needed to start downsizing her life and planning for quieter times. She had nursed her mother through the final days of lymphoma. Her son was married with a family of his own.\n\nColleen came up with a vision of renting a home and running a hairdressing salon out of it. As she was planning for this, she spotted an advertisement in the newspaper requesting business and improvement proposals for Pillsbury House.\n\nNow a well-known tourist destination in Prince Rupert, the house in the original business proposal to the City was planned to be renovated as a bistro. Costs of installing commercial-grade equipment were a catalyst for a change in direction. That’s when Pillsbury House Bed and Breakfast came to fruition.\n\nColleen used all of the inheritance money left by her mother to revitalize the interior of the house while keeping its history and turn of the 20th Century charm. Still today, 25 years later the house is accented with the original lead framed diamond-paned windows, original wooden floors, and staircase banisters. The Prince Rupert Heritage Committee took care of the exterior and grounds.\n\n“When they built the house, the four gables are pointing in the direction of the four major compass points,” Colleen said. “It is said the wind tunnels around the house. They built it so that the wind cuts the corners and tunnels around the house rather than hitting it straight. And I can attest to the fact that the house during a storm is very, very sturdy.”\n\nIt has taken many years to build up the profile of Pillsbury House to be a destination for visitors and a focal point in the city for tourists, she said.\n\n“At times I felt like I was dragging a dead horse with all of the struggles I’ve had to build this business and get the place known,” she said. “I used to stand on my head and spit nickels to be professional and proper with running this business. I think it made people a bit uptight. I was always worried ‘what if they don’t like it’, ‘what do they need?” But I learned to be more relaxed and laid back and when I did everyone was so happy.”\n\nOver the years she has opened up the house for victorian fashion shows, ladies tea parties, community events, and historical tours. The bed and breakfast involves many aspects, like marketing, booking, cooking, and cleaning for the guests. Part of the B&B’s charm is the breakfast. Breakfast isn’t ‘served’ to the guests, it is performed for the guests.\n\nUsing her talents in singing and artisanal french culture Colleen sets the stage with fully laid tables accented by silverware and candlelight. She said beautiful french music plays as the guests come down the staircase for breakfast. Then she segues into a performance of Edith Piaf with a musical and comedy routine. She does this as she dishes up the three-course meal for her guests to start their day on a high note, all the while surrounded by her watercolour on canvas artwork.\n\nColleen looks at painting as just another opportunity to grow. She said hadn’t picked up a brush until two years ago. The first year she painted more than 100 paintings and had a display at the Ice House Gallery.\n\n“The opportunities that I’ve had to meet people from all over the world just from being here. It’s been an education. It has expanded me rather than if I could have travelled personally. The world has come to me,” she said.\n\nColleen said she wonders sometimes if Prince Rupert as a whole is aware of how many guests and visitors Pillsbury House has drawn to the city and how much effort she has put in overtime, like hosting the Snowbirds when they came to town.\n\nREAD MORE: Heart of Our City – Ashley Johnson, Feline friendship\n\nColleen explained she puts her full heart into everything she does like when she arranged for the spreading of Amelia Pillsbury’s ashes, who was the first baby born in the master bedroom of the house to Joel Pillsbury and his wife. Colleen had been researching the history of the house and its original occupants when she was contacted by Amelia’s daughter who had held on to her mother’s ashes for more than 30 years. Colleen assisted in arranging an event and many in the city became involved. Representatives from the family were flown out from PEI to P.R. and the ashes were dispersed in shells and floated out on the waterfront and spread around the tree in the front yard. The tree which Colleen has monikered “The Amelia Tree”.\n\n“I wish there was a way to convey to the city how much Prince Rupert has benefited from the hospitality of this house and the introduction to Prince Rupert that this house has provided.”\n\n“I am so hurt right now because I have worked so hard,” Colleen said with tears in her eyes and her voice catching in her throat. “I have worked so hard to make this B&B a success. At times I’ve been pulling and tugging and eventually, it became successful. I was booked solid. And then March hit.”\n\nHer music, her writings, her paintings, her joie de vivre, all could not stave off the decimation that COVID-19 has wreaked on the folk-like house she has created and which she says is a work of art itself.\n\n“Covid has wiped me out,” she said.\n\nAs a small business relying on guest stays for income there have been none in seven months. Bookings are what makes the business tick, and she said in her industry the money made during the tourist season needs to suffice and carry over the winter until the next tourist season. She said she has received some CERB but just frankly there was no income even though she still has expenses and overheads.\n\n“Everybody’s humble, right? We’re all humble. I’m not going to go out and promote myself, but I have to promote the house. It’s like we have a symbiotic relationship. The house has to succeed for me to succeed. So me and the house have to succeed together or this is gone. We keep each other together and alive. Right now, we are not producing. I am not sure what is going to happen.”\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.\n\nColleen McLaren Prince Rupert artist, author, and singer finds inspiration in her surroundings at Pillsbury House on Oct. 21.\n\nColleen McLaren Prince Rupert artist, author and singer finds inspiration in her surroundings at Pillsbury House on Oct. 21. (Photo: K-J Millar/The Northern View)",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-01 08:00:00-08:00",
    "title": "Heart of our City – Colleen McLaren – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/heart-of-our-city-colleen-mclaren/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}