{
    "authors": [
        "K-J Millar",
        "Our Town"
    ],
    "content": "Ashley Johnson, a volunteer with the Trap Neuter and Release program in Prince Rupert has mapped out more than 24 feral cat colonies in the city. (Photo: K-J Millar/The Northern View)\n\nIt’s the furry, four-legged feline that has captivated Ashley Johnson’s heart.\n\nAs a volunteer with the Prince Rupert SPCA and the Trap, Neuter and Release program (TNR), she is dedicated to advocating for the care, consideration and reduction of the city’s cat population.\n\nGrowing up, Ashley had no pets of her own, she said. Not even fish. She and her siblings would play with the neighbour’s dog but that was her overall pet experience until she received her first cat. That was 14 years ago.\n\nIn 2008, Ashley was living in Prince George when she received a call from a friend in Smithers. A very young kitten had appeared on his doorstep and he was wondering what to do.\n\n“I drove to Smithers and picked up the kitten, and then drove back to Prince George,” she said. The reasoning was simple in as much as the two friends believed it would be easier to find a good home for the kitten in a larger city.\n\nThe kitten found a home ­­— at Ashley’s house and became cat No. 2.\n\nAlways having lived in Northern B.C., Ashley moved to Terrace.\n\n“I had just the two cats until 2014. I met my partner and he had two cats. So we went from two cats each to four cats between us.”\n\nREAD MORE: Aftermath of building fire – Flames of ruined hope\n\nThe couple moved to Prince Rupert from Terrace. Soon after, cat five came along when a family on the street moved away.\n\n“The intent for all of the kitty-cats was to adopt them out. It didn’t quite happen.”\n\nCat six came after being rescued a few streets from Ashley’s home. As an exceptionally friendly kitten, Ashley said she believed an adoption would be easy and smooth.\n\nThe idea was to get the kitten healthy and adopt her out. She was a super-cuddly kitty, but something happened, she said.\n\n“After we had her fixed, she had an attitude shift and went back to being semi-feral,” Ashley said.” She likes us but she is just skittish and we don’t see her often.”\n\nCat seven was an outside cat who came from another neighbour who moved. After being injured twice in 30 days the cat soon transitioned into being an indoor cat.\n\nAshley spends most of her time at home nursing the sick and injured cats she rescues through the Trap, Neuter and Release program, which is not always easy for her as she has a disability.\n\nAshley is hands-on in her volunteer work from the beginning of the process in trapping the feral cat or kitten, to arranging veterinary appointments for wellness checks, nursing sick and recovering cats after surgery, feeding and general care of foster cats, right to releasing them back into their colonies after they have been spayed or neutered.\n\n“Sometimes I can’t walk without assistance, or sometimes I use a cane,” she said, but that doesn’t hinder her devotion to helping the feral cats in the city.\n\nThe physical trapping can sometimes be difficult for her, as she has to crawl under buildings which can be a struggle as she is claustrophobic. Then due to the weight of the traps with felines in them she accepts assistance where it is offered and has someone go with her.\n\n“While the empty traps are not heavy, if you get a full-sized tom cat, who is aggressive and upset at being in the trap, then carrying the trap can be difficult.”\n\nIn between rescuing and trapping cats, Ashley likes to sew. She likes to make cosplay outfits and she has been sewing lots of masks during COVID. Any generated funds from the masks have been provided to assist in the care of the feral cat colonies in Prince Rupert and to building shelters for them.\n\nAshley has used her own time to map out the location of at least 24 different cat colonies in the city. Feral cat colonies in P.R. can have to up 50 cats, she said. Not all of the cats in a colony are feral, but there are between 2,500 to 3,000 feral cats in Prince Rupert.\n\nREAD MORE: Heart of Our City – Sailing through life’s adventures, Titan McMaster\n\nAshley and her partner have nursed and fostered 110 cats in their home and Ashley has personally worked with more than 250 cats since 2017.\n\nHer belief in animal advocacy and safety is so strong she has used her own money to pay vet bills for stray and feral cats.\n\n“I don’t know if working with kittens and cats is addictive, but if I had known about the TNR and fostering earlier, then my life’s path would have been much different, she said. “I would have gone to school to do veterinary technician or vet sciences.”\n\nInstead she did bookkeeping, which has benefited her with funding, grants and expenses for the cat organizations she has worked with.\n\nAshley said in her time with the Trap, Neuter and Release program she has seen a significant decline in cat numbers of some colonies. One particular colony was up to 50 cats, and with her and other volunteers efforts, the colony reduced to 18 cats pre-pandemic, another colony of 10 to 15 cats was down to less than four, she said.\n\n“The program was working. Due to government restrictions and cutbacks, the SPCA, rescuers and owners could not get cats fixed. So, some colonies that were completely fixed are now seeing kittens again.”\n\nDespite the setback, she will continue her efforts to rescue, care for the cats and advocate for the TNR program.\n\n“Cats are supposed to be domesticated animals. The only reason we have feral cats is because somewhere down the line a domesticated cat was let out, lost or abandoned, then started having kittens,” she said.\n\nAshley said working with TNR program is extremely rewarding and she loves being able to assist.\n\n“It really started when I came to Prince Rupert. I knew liked cats because I had two of my own, but then it just started to take off.”\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-10-30 10:30:00-08:00",
    "title": "Heart of Our City – Ashley Johnson – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/community/heart-of-our-city-ashley-johnson/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}