{
    "authors": [
        "K-J Millar"
    ],
    "content": "Bernie Alexander, poppy campaign organizer and vice president of the Royal Canadian Legion Branch 127 Prince Rupert said with Covid-19 poppy donations may be down in 2020 due not being able to have the assistance of the Girl Guides, Boy Scouts and Sea Cadets. (Photo: K-J Millar/The Northern View)\n\nBright red poppies are in abundance around Prince Rupert, with The Royal Canadian Legion’s 2020 National Poppy Campaign officially launched and the local legion needing extra support due to COVID-19.\n\n“We just put out more than 10,000 poppies,” Bernie Alexander poppy chairman and vice president of the Prince Rupert Legion Branch 127 told The Northern View. “Poppy boxes have been placed in stores, restaurants, cafes, and places of business.”\n\nMarie Lewis is the Prince Rupert Legion Branch President and said most years the poppy campaign results in between $7,000 to $10,000, but diminished contributions this year may hurt the local legion.\n\n“We hope to see that amount of money, but because of COVID-19, we don’t have as many retailers participating this year. We are already anticipating a $3,000 to $4,000 reduction in donations,” she said.\n\nRead more about The Royal Canadian Legion in the print version of The Northern View\n\nREAD MORE: ‘Falling like dominoes’: Pandemic could lead to closure of 10% of Canada’s legions\n\nREAD MORE: Remembering Rupert: A historical report on Prince Rupert during the Second World War\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-10-23 08:00:00-08:00",
    "title": "National poppy campaign restricted by COVID-19 – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/national-poppy-campaign-restricted-by-covid-19/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}