{
    "authors": [
        "Lachlan Labere"
    ],
    "content": "Actor Ryan Reynolds surprised a Shuswap family with a special birthday message to their son who was worried he’d be alone on his 9th birthday on Nov. 24. (Tiffanie Trudell/Facebook)\n\nA text message from Ryan Reynolds almost tipped off Damien Smith to one of the surprises in store for his upcoming ninth birthday.\n\nThe text from the Vancouver-born celebrity, loved by Damien for his portrayal of the comic-book character Deadpool, was prompted by an emotional request shared over Facebook by the boy’s parents, Thomas Smith and Tiffanie Trudell.\n\nIn an Oct. 14 post, Smith and Trudell, who recently moved from Coquitlam to Canoe, explain how their son’s birthday is coming up on Nov. 24. Instead of looking forward to the occasion, their boy was feeling blue.\n\n“We just moved to the Shuswap two weeks ago, and my boy’s birthday is coming up and I asked him, ‘Are you… excited about your birthday?’” explained Smith. “And he’s like, ‘No, I’m just going to be lonely.’”\n\nDamien’s heart-wrenching response prompted the couple to ask the public for help in celebrating their son’s special day.\n\n“Since moving out of the city, he’s been feeling pretty sad about his friends and our family not being around this year…,” reads the post, adding how with COVID-19 the family has chosen to not have a party.\n\n“What I’m wondering is would anyone be interested in sending him some birthday cards in the mail?”\n\nSoon after, the couple began receiving messages from people all over the world who said they would be sending cards. Despite the family’s request for cards only, gifts also began showing up. One neighbour dropped off a Sidney Crosby jersey. Another person contacted the couple to say they would be making Damien a Deadpool birthday cake.\n\nNot long after a story about the card request was shared on the Salmon Arm Observer website, Damien was receiving visits from kids in the neighbourhood wanting to be his friend.\n\n“All of a sudden we had these bangs on the door and there was a bunch if kids in our driveway and they all wanted to be Damien’s friend ,and we’re like, ‘Oh my goodness, word travels fast out here,’” said Tiffanie. “It’s a really beautiful community and we’re so blessed to be out here.”\n\nReynolds, who is known for sending special messages to fans, got wind of Tiffanie and Thomas’ story. He texted the couple at dinner time to say he wanted to send Damien a little birthday video. Tiffanie began to cry with joy.\n\n“The boys were eating dinner and they’re looking at me like, what’s wrong with mom?” said Tiffanie, laughing as she sets the scene. “Tom’s like, ‘What what!’ I showed him the phone and he’s like, ‘Be quiet.’\n\n“So we told Damien the reason mommy was crying was because we won a vacation but we can’t take it because mommy is pregnant. So Damien is all mad because we can’t go on vacation. And I go, I’m sorry honey, I’m so sorry.”\n\nThursday morning, Oct. 22, the couple were on the phone with Reynolds’ assistant, and Reynolds in the background. True to his word, Reynolds sent the family a birthday video for Damien.\n\n“He was in the background talking to us,” said Tiffanie. “I guess maybe he wanted her (the assistant) to handle it, but he started saying things to Tom.”\n\nThe family plans to present Damien with the cards, gifts and the video on Nov. 21, when Bikers are Buddies members and others will be parading by their house to offer birthday wishes.\n\nOverwhelmed by and grateful for all of the support, Tiffanie said she and Thomas have been collecting about 50 cards a day from their post box, many from Shuswap residents.\n\nTiffanie and Thomas plan on reading the cards together with Damien, who struggles with reading. They also plan on sending out thank-you cards – a lot of thank-you cards.\n\n“Its’ going to be fun,” said Tiffanie. “We’re going to get them out – even if it takes us a couple of months.”\n\nAnyone wishing to send Damien a happy birthday greeting can do so by mailing to the following address: Damien Smith, PO Box 321, Canoe, B.C., Canada, V0E1K0.\n\nRead more:“I’m just going to be lonely:” Shuswap family asks for help celebrating son’s birthday\n\nRead more: Bikers Are Buddies set up in North Okanagan-Shuswap\n\nLike us on Facebook and follow us on Twitter\n\nSalmon Arm\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.\n\nInstead of having a party, Thomas Smith and Tiffanie Trudell have asked the public to send their son, Damien (pictured), happy birthday cards. (Contributed)",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-10-22 16:40:00-08:00",
    "title": "Ryan Reynolds text almost gives away Shuswap boy’s birthday surprise – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/community/ryan-reynolds-text-almost-gives-away-shuswap-boys-birthday-surprise/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}