{
    "authors": [
        "K-J Millar"
    ],
    "content": "Prince Rupert and region residents are specifically being called on to become radio officers for the Canadian Coast Guard. An open call has been issued with the online application deadline extended until Oct. 23. in an effort to garner some home grown talent.\n\nLike many work places and business in the area, the Canadian Coast Guard is not immune to the systemic hiring issues that affect the local area, Ashley Wilson officer in charge of the Prince Rupert Marine Communications and Traffic Services (MCTS) said. Supporting the local area with jobs is an important investment in the community, she said.\n\n“There are two components to the job. Safety is one side of it. Mariners are used to talking to Prince Rupert Coast Guard Radio. We monitor for distress calls, disseminate safety and weather information and if there is a search and rescue we coordinate communications for that … When (Coast Guard) are on the water we are coordinating that communication.”\n\n“It’s kind of like air traffic control for the ocean. We screen vessels coming into Canadian waters. We ensure they do not have any defects or deficiencies so that they are not polluting. We monitor them and ensure they do not come into conflict with each other. It’s much like an air traffic controller — they do that for planes, we do that for boats,” Wilson said.\n\nLocal aptitude testing is completed every six months, and the next session is November 2. Interested applicants can apply online at the government jobs website. An interview and keyboarding session is then arranged, with an invitation to successful candidates to attend Coast Guard College in Nova Scotia.\n\n“Training is paid for, travel is paid for. Room and board is covered. They do receive a stipend to cover expenses every couple of weeks,” Wilson said.\n\n“We train from the ground up, so you don’t need to have a foundational knowledge,” Wilson said of candidates who may be wondering if a marine background is required. “You don’t need a university degree … There are not a lot whole lot of jobs you can walk out of high school and just do.”\n\nRead more about the Coast Guard in the print edition of The Northern View\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-10-20 10:30:00-08:00",
    "title": "Coast Guard calling for radio officers – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/coast-guard-calling-for-radio-officers/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}