{
    "authors": [
        "K-J Millar",
        "Our Town"
    ],
    "content": "Louisa Parent spends her time volunteering behind the bar at the Moose Lodge in Prince Rupert and assisting in the office. (Photo: K-J Millar/The Northern View)\n\nLouisa Parent is a daughter, a mother, a fiancée, and also a volunteer at the Moose Lodge in Prince Rupert.\n\nGrowing up First Nations in Prince Rupert she learned from an early age how to look after other people, being the eldest to her five younger siblings.\n\n“I’m the oldest in my family. Our ways, our culture, and our beliefs — the eldest girl has a lot of responsibility,” Louisa said. She said she took a mother-like role to her youngest brother.\n\nOn the day she spoke to The Northern View, she was busy bustling around downtown running errands, taking care of an ill family member, and preparing to make her brother Owen’s birthday a special one with a cake, a banner, party hats, and special, oversized satin glittered comedic necktie for the birthday man.\n\nCommitment to family is important to Louisa. She has always worked to provide stability and everything her family has needed. She spent many years as a single mother balancing studying, looking after her children, and volunteer work.\n\nLouisa has studied many different topics like First Nations Arts, womens’ studies, child and youth worker program. She said it has all been positive for her. She said she continued to take training courses as her family grew up so she could better herself.\n\n“I did what I had to do to support and help my family,” she said.\n\nREAD MORE: Heart of our City – Swimming in the Street\n\nShe said she has carried over what she learned while studying into her paid employment and volunteer work. Her first experience with volunteering was as a parent volunteer while at her children’s school.\n\n“They had a Friday Nights Alive program, where the kids would come to the school and do computers, arts and crafts, and play the gym. It was fun for them and gave them something to do. I was a volunteer supervisor there,” she said.\n\nLouisa and her children moved away from Prince Rupert for a while after her marriage dissolved and her parents passed away within a year of each other. She missed Prince Rupert and her high school-aged children wanted to come back. She moved back to help everyone and so she could be there for them.\n\n“Prince Rupert is my home. I like the water and the ocean. I love the smell of the saltwater air,” she said.\n\nWhile living in Nanaimo she would walk to the water every day to a nice park, she said.\n\n“The sea air is not the same … it just didn’t quite smell the same. I don’t know what it is. The seas air — having grown up in Prince Rupert you just don’t forget it.”\n\nShe said everyone in her family from her grandfather and uncles, has worked in fishing in one capacity or another. She too worked in the canning industry.\n\n“Everyone worked on boats, or fishing or in the canneries. It’s a big part of Prince Rupert’s history all up and down the coast here.”\n\n“I know it rains here a lot and some people don’t like it, but it’s home,” Louisa said.\n\nAfter her children grew up and left the nest she said she was on her own and needed to fill her time.\n\n“Lots of places, anywhere you go, have programs running that need volunteers,” she said. “If you hear that, look into it. You will enjoy it and learn a lot. Volunteering will make you feel better.”\n\nWhile working in a temporary contract position at the Friendship House, Louisa saw how important volunteering is and how it can change someone’s life.\n\nAfter work, she would volunteer with the Elders in a weekly program where they would fundraise with bake and food sales. She would assist them with shopping and cooking. She said while she was wanting to help and assist them, she was receiving joy from the program as she loved hearing all of the interesting stories the Elders would share.\n\nREAD MORE: Heart of our city – New pastors want to journey along side\n\nLouisa started volunteering at the Moose Lodge about two years ago. She has been playing darts for about five years on a mixed-team in the league that plays weekly. She met her fiancé Ken there, who also volunteers some of his time at the Moose Lodge. Apart from relaxing with darts, her volunteering helps out in the office with some admin duties and also behind the bar looking after members’ thirsts being quenched.\n\n“I felt a little bit overwhelmed at first. I thought it may be a big boys club,” she said laughing. “But then I thought, I’m tough I’m not going to allow them to bump out. It’s funny, I take my stuff seriously and stick to my guns. I can see them cringe now sometimes when I walk in. They know I’m watching them.”\n\nShe is full of praise and support for her fellow volunteers and said they are very dedicated and spend many hours every day there, even though they have jobs outside of the volunteering.\n\nLouisa extolled that all the team at the Moose Lodge is wonderful to work with, and thankfully they haven’t played any tricks on her yet.\n\n“Anyone can volunteer. You can do just one day a week. It still helps. Even if you have just a couple of hours of free time it really does help.”\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-10-19 09:10:00-08:00",
    "title": "Heart of our City – Moose is a bullseye for Parent – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/community/moose-is-a-bullseye-for-parent/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}