{
    "authors": [
        "K-J Millar"
    ],
    "content": "Northern Health has not declared any COVID-19 public exposures in the Northern Health Region at this time the health authority said, in a statement on Sept. 17. (Photo: Courtesy of the Kitsap Public Health District)\n\nNorthern Health has not declared any COVID-19 public exposures in the North Health Region at this time, a statement issued by the health authority on Sept 17, said.\n\nThe statement regarding COVID-19 community outbreaks and public exposures in the northern region said Northern Health is aware of concerns expressed in some communities and on social media. The health authority wants to remind community members about the importance of self-monitoring for symptoms in general and particularly if they have been in a setting where they may have been exposed to COVID-19.\n\n“A public exposure alert would be issued when public health officials are unable to ensure they can identify and directly contact everybody who may have been exposed to a potentially infectious case of COVID-19 in a public setting,” Northern Health said.\n\nAs of 4:30 p.m. on Sept. 18, the British Columbia COVID-19 dashboard, an online platform for statistical data, reported 244 cases have been confirmed in the Northern Health Authority region. There are 36 active cases with seven of those hospitalized and three patients currently in ICU. Northern Health region has seen one fatality and 207 recoveries.\n\nREAD MORE: Northern Health records 1st fatality due to COVID-19\n\n“For all recently-lab confirmed cases in the North, contact tracing is underway and N.H.’s public health team is reaching out to close contacts, directly,” the statement said.\n\nNorthern Health said it is important to note that a close contact is a person who has been in direct, face-to-face contact for prolonged periods with an infectious case.\n\n“If you are identified as a close contact, you will be contacted directly by public health, and supported in any actions you need to take (such as self-monitoring, or self-isolation).”\n\nAccording to the dashboard data, the province’s health authorities have administered 461,144 COVID-19 tests which have identified 7,842 cases. Provincially 59 people are hospitalized with 20 in ICU. B.C has 223 confirmed deaths from the virus, and 5,797 have recovered.\n\nAnyone who develops symptoms should self isolate, and contact their primary care provider or the NH Online COVID Clinic and Info Line for assessment and testing.\n\n“Individuals who have not had close interactions with, or who have been simply present in the same location as a confirmed case do not need to take additional precautions beyond the public health advice and guidance for all British Columbians, for the prevention of COVID-19.”\n\nIf you have symptoms, please call the NH COVID-19 online clinic for an assessment and testing: 1-844-645-7811.\n\nREAD MORE: Record-breaking 165 new COVID-19 cases diagnosed in B.C. in 24-hour period\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-09-18 12:15:00-08:00",
    "title": "No COVID-19 public exposures in the North Health Region at this time – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/life/no-covid-19-public-exposures-in-the-north-health-region-at-this-time/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}