{
    "authors": [
        "K-J Millar",
        "Our Town"
    ],
    "content": "Titan McMaster is classed by some, as a young man at almost 22 years old, but a maturity beyond his years has enabled him to seemingly sail effortlessly from job port to job port while he finds his niche in life. The name Titan means ‘big powerful man’ something this articulate youth is well on his journey to becoming with his adventuresome personality and drive for success.\n\nWith a creative eye through the camera lens and having worked in a variety of jobs already, such as stockboy in a marine store, a roofer laying shingles, a hotel front desk agent, now working as a carpenters apprentice has also chiseled its way onto his resume. Currently, halfway and working through his carpenter’s apprentice in an LNG work camp in Kitimat, Titan said he is looking forward to the day when he completes his red seal, so he can carry on working to become an architect.\n\nRelocating from northern Ontario, Titan’s mother moved her family to Prince Rupert when her three boys were entering their teenaged years. Attending Charles Hays Secondary School Titan learned of a slower pace of life than in the larger cities he had previously lived. At 14 years old a move across the country to B.C. quickly acclimated the teen to mountains, coastal air, the sea and high school rugby.\n\nNot realizing how contagious being bitten by the travel bug could be, on a class trip to Asia, Titan traveled to Cambodia, Hong Kong, Vietnam and Thailand. This trip was just a precursor to the months he spent sailing around the Caribbean in a 40 ft. catamaran with his grandfather after graduating high school.\n\nWhen his grandmother became tired of sailing the seas and wanted some shore time, he jumped on board at the opportunity to fill her place on his grandfather’s sailing vessel. The newer model catamaran was decked out with three separate sleeping quarters with stand up showers in one hull and the other hull had two more sleeping quarters with their own showers with a bridge in the middle housing the living area, dining area and radio room.\n\nTitan said there was plenty of space and sometimes it was much needed living in such close proximity to others.\n\nParticipating in the Salty Dawg Rally, an annual sailing endeavour leaving from Hampton, Virginia to the British Virgin Islands, Titan and his grandfather took on two deckhands to assist with the trip. Sailing in a fleet of more than 80 other boats, the nine-day trip down the eastern American coast led to the bluest waters he has ever seen, Titan said.\n\nHe learned a lot about his grandfather and bonded in ways he appreciates that created memories he can carry with him, he said. Every day he would cast out a hand line which trailed behind the boat. He caught two mahi mahi, a wahu and a yellow tuna. A six-foot marlin was the one that got away.\n\nHis grandfather taught him how to fillet fish that they cooked for dinner, and he ate well on other nights when the Polish crew lady cooked and shared her stories. The four sailing mates took three-hour shifts manning the boat to watch for marine traffic, weather conditions, and dolphins.\n\n“It was so peaceful sailing out on the water,” Titan said. “The sailing conditions were amazing and there are billions of stars in the sky that you’ve never seen before because there are no city lights and no pollution clouding the sky.”\n\nBeing very new to sailing, he said sometimes he and his grandfather would become annoyed with each other but the boat was large enough to breathe some air and get some space.\n\n“You definitely learn to become comfortable with yourself. You learn patience, and how to slow down,” Titan said.\n\n“With no internet, wifi or cell phone it’s just your books and your imagination. When you are done with those you need to learn to just be content.”\n\n“I would do it again in a heartbeat,” he said. “I think you shouldn’t think too much about it. Just take opportunities when you can and learn as you go.”\n\nREAD MORE: Heart of our City – Moose is a bullseye for Parent\n\nNow back on the North Coast of B.C. with Prince Rupert as his home, he works 14 days on and seven off at the Kimitat LNG plant. He stays at the Cedar Valley Lodge, a work camp for employees and contractors.\n\nIt is an absolutely contrasting way of life to being on the open sea, he said. When he first started working at the camp in July building the modular housing for people to stay in, there were just over 500 people. Now there are 2,000, with housing still being built to hold 4,500.\n\n“It’s basically turning into a little town. I have a five-minute walk to work. It has its own convenience store, movie theatre, gym with rock climbing wall,” he said. “One cafeteria serves buffet-style meals and other has tablets you can order your meals from. When they are ready it appears on a screen for you to collect it.”\n\nThe camps are predominately male in population he said.\n\n“However, there are a lot more female trade workers arriving daily. It’s great to see more diversity and representation in the camp.”\n\nWhile he has his own room with a bed, private bathroom and T.V. he admits to becoming a bit spoiled with not having any chores to do except laundry. He said life in the camp can get exhausting and he likes his breaks home to Prince Rupert so he can spend time with his shepherd-cross dog, Chibs.\n\nHe likes his job building the sleeping quarters in the camp because it encompasses a little bit of everything. He especially enjoys learning from the senior carpenters, journeymen, and other apprentices.\n\n“It is a great experience to learn from other people. You can pick up on their tricks of the trade to build your own skill set,” Titan said.\n\nLiving in the camps has taught him to have a greater appreciation and respect for the little things at home, he said. He also has much greater respect for the staff who work in the camp environment year-round. While his job apprenticeship there is not finished, and in the winter snow shovelling will be added to his job description, he said his next stop may be Vancouver because there is a lot to see.\n\n“Growing up in Prince Rupert has taught me how to survive in the rain. It has provided me with a love of the sea. I am not ready to move away from the ocean or the mountains yet,” Titan said.\n\nREAD MORE: Heart of Our City – Swimming in the Street\n\nK-J Millar | Journalist\n\nemail\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter Send K-JLike theonFollow us on\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.\n\nReeling in a catch on his hand line in the British Virgin Islands, Titan McMaster spent a few months sailing in the Caribbean with his grandfather after graduating from CHSC. (Photo: supplied)",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-10-19 09:05:00-08:00",
    "title": "Heart of Our City – Titan McMaster – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/community/heart-of-our-city-titan-mcmaster/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}