{
    "authors": [],
    "content": "With more staff, this barbershop can open longer hours and offer convenient cuts\n\nWyatt Grice has been visiting Neil Worsfold at Four Corners Barber all his life. Neil recently welcomed Jessica Meadows to the Four Corners Team.\n\nThere’s a shop on 4th Avenue just off Main St. that’s been a barbershop since the late 1960s. Over the decades the shop has seen a few close shaves and wild styles, and this year it was time for a fresh cut.\n\n“I’ve worked at this location for 19 years, and bought the business from my friend Klaus Mueller in December 2019,” says Neil Worsfold, owner of Four Corners Barbershop. “I’ve been alone in here for the last few years, but now I’m happy to welcome Jessica Meadows to the team.”\n\nMeadows is new to Smithers but no stranger to hair — she’s been a licensed barber for 15 years, and has been cutting men’s and women’s hair for 20.\n\n“My mother’s a barber — she taught me how to do it. I did my first haircut when I was 12, and cut my friends’ hair all through high school. I went to Hairdressing School right after,” she says.\n\nBringing Meadows to Four Corners has meant that the barbershop is able to offer convenient hours again, Tuesday to Friday from 10 a.m. to 6 p.m. and Saturdays from 10 a.m. to 4 p.m.\n\nStop by for a chat, and a haircut\n\n“We’re a walk-in shop. That’s always been a big plus — there’s no worries about booking appointments,” Worsfold says. “We like to have an atmosphere where people can have a nice time, feel free to chat and have some fun.”\n\nWorsfold has enjoyed decorating the barbershop with sports memorabilia and local history to spark conversation. Local athletes like Dan Hamhuis and Jim Watson get prime placement, but nothing beats the signed Bobby Orr jersey.\n\n“That’s the pride of my collection!” Worsfold says. “UFC, hockey, football, golf —I’m into all of it, and love chatting about it while I cut your hair. I’m slowly adding some ‘old time’ Smithers things to the walls, like a realllllly old picture of music man Mark Perry.”\n\nWith a wealth of personal history in Smithers as well, Worsfold was impressed to realize he’s been a life-long barber to some of his clients, like Wyatt Grice.\n\n“He’s just one of those kids —he’s super cool, sits in the chair as still as can be, and he’s very engaging. For a young fella he holds a great conversation!”\n\nMeadows also enjoys the conversational side of working at a barbershop.\n\n“I love barbering so much! I get this half-hour window into people’s lives.”\n\nFour Corners Barbershop is a classic, no-appointment-necessary shop. Just walk-in to 3752 Fourth Ave. Tuesday to Saturday. Follow the shop on Facebook and Instagram for style inspiration, or give them a call at 250-877-7573.\n\nHairSmithers",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-10-19 06:00:00-08:00",
    "title": "Extra time for your trim — Smithers staple welcomes a fresh face – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/marketplace/extra-time-for-your-trim-smithers-staple-welcomes-a-fresh-face/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}