{
    "authors": [
        "Katya Slepian",
        "Trending Now"
    ],
    "content": "This past year has been a year of new knowledge, growth and a whole lot of spare time for many people as the COVID-19 pandemic shut down much of society and the Black Lives Matter movement inspired self-reflection.\n\nChristina Peck, Google Canada trends expert, said the year has been an unusual one when viewed through a search engine lens, too.\n\n“2020 was not the year any of us expected,” Peck told Black Press Media by phone. “It was unpredictable, heavy and really tested people around the world, and Canadians.”\n\nGoogle compiles top trending searches every year and in this way, 2020 is no different. This year, Peck said, people were asking one big question: why?\n\n“Sometimes the answer made us cry, sometimes it sparked joy or worry, and in some cases it even inspired change,” she said.\n\nSomewhere in all those emotion was the most-wanted item of the year, toilet paper.\n\n“Why are people buying toilet paper?” was the most common “why” question asked of Google this year\n\n“This has been a topic of conversation throughout the pandemic,” Peck said, and might be spiking again as B.C. introduces new restrictions and Ontario is in another lockdown.\n\nBut the list of “why” questions was not always so light. Many touched on more serious worries about COVID-19, while others were on the Black Lives Matter movement and the death of George Floyd at the hands of police.\n\n“This left many people wondering why we’re asking the same questions, why are we seeing black men and women lose their lives?” Peck said.\n\nThe top trending search of the year for Canadians is one that’s still fresh for many: the U.S. election.\n\n“We’re really dialled in and engaged into what’s happening south of the border,” Peck said, noting it’s not unusual for American news to trend in any years. News of the election especially spiked during the debates leading up to voting day and the day itself.\n\nREAD MORE: Americans search for nearby liquor stores, French fries as they await election results\n\nThe third most trending search harkens back to the start of 2020, before most people knew what awaited them this year.\n\n“Kobe Bryant – this was a really devastating moment and when the news broke in January that Kobe along with his daughter Gianna had passed away… in the helicopter crash, it kind of stopped everybody,” Peck said. “Kobe has inspired so many people both on and off the court.”\n\nBut Bryant was sadly just the first of many celebrities deaths in 2020, “goodbyes we weren’t ready to say.”\n\nOne that likely hit Canadians the hardest was Alex Trebek, who died just over a month ago after a long battle with pancreatic cancer.\n\n“He’s not only a Canadian icon but he’s someone who Canadians and people around the world have invited into their homes night after night through ‘Jeopardy!’”\n\nDespite everything that happened in 2020, Canadians did try to lighten up the mood as they faced months of job losses and pandemic restrictions. They searched for “easy cookie recipes” and “sourdough discard recipes,” before turning around and looking for “resistance band workouts” and “Chloe Ting workouts.”\n\n“We’ve all been at home so we’re probably spending a little bit more time on social media – or on our phones or our devices – and we’re seeing that people are turning to memes to find that joy,” Peck said.\n\n“There’s a lot of fun ones here… Tiger King, Carole Baskin, Joe Exotic, Love is Blind, and toilet paper memes also come back up. It’s a good indication of the year and some of the things that happened as people tried to find a little bit of laughter.”\n\nREAD MORE: What did Canadians watch on Youtube during isolation? Workouts, bird feeders\n\n@katslepian\n\nkatya.slepian@bpdigital.ca\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nBest of 2020Google",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-09 05:30:00-08:00",
    "title": "From toilet paper to Tiger King: Here’s what Canadians searched on Google in 2020 – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/trending-now/from-toilet-paper-to-tiger-king-heres-what-canadians-searched-on-google-in-2020/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}