{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "B.C. Finance Minister Selina Robinson presents bill to delay B.C.’s budget as late as April 30, and allow further spending before that, B.C. legislature, Dec. 8, 2020. (Hansard TV)\n\nB.C.’s next budget could be delayed until after the new fiscal year starts in April, as the NDP government prepares up to borrow another $2 billion to add to its current deficit, already approaching $13 billion.\n\nFinance Minister Selina Robinson began a brief pre-Christmas session of the B.C. legislature Tuesday by presenting amendments to allow the province to delay its budget until as late as April 30, after the current fiscal year ends March 31. The delay is partly due to the October snap election called a year earlier than its scheduled date, which has already delayed the government’s second quarter financial report for the current year.\n\nThe un-budgeted $2 billion in extra borrowing includes about $1.5 billion for another round of COVID-19 payments, promised by Premier John Horgan in the fall election campaign. Unlike B.C.’s first round of pandemic payments, these do not require proof of lost income during the pandemic, with up to $1,000 going to families with income up to $175,000 this year, and up to $500 for single people earning as much as $87,000.\n\nRobinson told reporters there will be an online application process for the money that will open Dec. 18. The target continues to be getting transfers to bank accounts by the end of 2020.\n\nPeople receiving B.C. income or disability assistance are eligible for the family or single benefit, and an additional $150 due to their low incomes, Robinson said.\n\nRELATED: B.C., Ottawa COVID-19 debt could ‘indenture generations’\n\nRELATED: B.C. throne speech predicts ‘better days ahead’ in COVID-19\n\nThe fall snap election was a key part of the delay in the province’s financial reporting and approval.\n\n“While the proposed rules will also allow for modest extensions for release dates for quarterly reports in a fiscal year when there is a general election, the amendments still ensure that fiscal updates are publicly provided so there is not a lengthy gap in public reporting,” Robinson told the legislature Dec. 8. “This amendment ensures that limited funding remains available should a supply act not be enacted by the start of a new fiscal year, and would only apply to address election-year schedule impacts.”\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC politicsCoronavirus",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-08 11:40:00-08:00",
    "title": "B.C. delays 2021 budget, moves to borrow more for COVID-19 – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/business/b-c-delays-2021-budget-moves-to-borrow-more-for-covid-19/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}