{
    "authors": [
        "Janelle Swift"
    ],
    "content": "A woman uses her computer keyboard to type while surfing the internet in North Vancouver, B.C. THE CANADIAN PRESS/Jonathan Hayward\n\nThis holiday season, COVID-19 has ensured that consumer shopping is mostly done online and a cybersecurity expert is offering tips and calling on British Columbians “think before you click” and avoid falling victim to a scam.\n\nIn a news release Monday (Dec. 7), BCIT cybersecurity expert Ilia Lvovski said the first of nine tips and tricks is to always double-check the URL of a website, even before clicking a link.\n\nWhen hovering your mouse above a link before clicking on it, you will be able to see on the bottom left corner of your internet browser where the actual address will take you. If that address looks different from what you would expect – don’t click on it, Lvovski said.\n\nSecure sites will include HTTPS at the front of the web address.\n\nTo further validate a secure website, look for the small padlock that appears to the left of the web address. A padlock doesn’t guarantee security but is a good first step when searching for a secure site, Lvovski said.\n\nWhen browsing for products, pop-up ads aren’t uncommon – but can lead to scams. If the pop-up is from a company that you are familiar with, this is a better indication of security. However, if you aren’t familiar with it, don’t click on it.\n\nComputer crime experts are also urging online shoppers to consistently ensure their operating system, software and anti-virus programs are up to date.\n\nWith an increase in e-commerce this holiday season, Lvovski said British Columbians should be on the lookout for spoofed websites – a term for fake shopping sites designed to appear legitimate – as well as phishing emails. Deals that seem too good to be true likely are.\n\nWhen using a credit card for online payments, avoid storing your credit card information. Alternatively, services like Paypal can also offer a second layer of protection as those programs hide credit card numbers.\n\nOne of the easiest ways to steal your personal information is through a hacked public WiFi network, Lvovski said. Use a strong, unique password for each online account. Do not store them in your browser; instead, store them in a password manager. This way, if one account is compromised, the others will be safe.\n\n@janelle_swift\n\njanelle.swift@castlegarnews.com\n\nLike us on Facebook and follow us on Twitter.",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-07 15:00:00-08:00",
    "title": "‘Tis the season to be cyber aware: 9 tips from BCIT computer crime experts – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/business/tis-the-season-to-be-cyber-aware-9-tips-from-bcit-computer-crime-experts/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}