{
    "authors": [
        "The Canadian Press"
    ],
    "content": "The unemployment rate fell to 8.5 per cent compared with 8.9 per cent in October\n\nA masked worker walks behind a hiring sign on his way into the Dover Cliffs long term care home in Port Dover, Ont., Friday, Nov. 13, 2020. Statistics Canada will say this morning how Canada’s job market fared last month as COVID-19 case counts rose along with a new round of public health restrictions. THE CANADIAN PRESS/Frank Gunn\n\nThe rate of job growth continued to slow in November with the economy adding 62,000 jobs, down from 84,000 in October.\n\nThe gains were mostly focused in full-time work with a gain of 99,000 jobs, offset somewhat by a decline in part-time work of 37,000 positions, Statistics Canada reported Friday.\n\nThe average economist estimate had been for a gain of 20,000 jobs and an unchanged unemployment rate, according to financial data firm Refinitiv.\n\nThe gains in November left the country 574,000 jobs short of recouping the approximately three million jobs lost from lockdowns in March and April that sent the unemployment rate skyrocketing to 13.7 per cent in May.\n\nThe unemployment rate fell to 8.5 per cent compared with 8.9 per cent in October.\n\nThe unemployment rate would have been 10.9 per cent in November, StatCan said, had it included in calculations Canadians who wanted to work last month but didn’t search for a job.\n\nThe agency said 1.5 million people searched for jobs in November, a small drop of 39,000 from October, but still more than 448,000 or so who were looking for work in February, pre-pandemic.\n\nThe report noted that job searchers made up an increasing share of the total number of unemployed.\n\nThe youth unemployment rate fell 1.4 per cent to 17.4 per cent with a gain of about 20,000 jobs for the age group, mostly concentrated among young men with little change to the employment situation for women age 15 to 24.\n\nSimilarly, employment among women 25 to 54 years old didn’t change much in November after six straight months of seeing their numbers rise.\n\nPositions in the hard-hit accommodation and food services sector declined for the second consecutive month, shedding 24,000 jobs in November.\n\nThat figure doesn’t take into account renewed restrictions in areas like Toronto that kicked in later in the month.\n\n“As a result, it’s likely that COVID will catch up with the Canadian economy in the December data, with a decline expected in both employment and overall economic activity,” notes CIBC senior economist Royce Mendes.\n\nOverall, the pace of job gains has slowed, with employment rising by 0.3 per cent in November compared to an average of 2.7 per cent per month between May and September.\n\nThe Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-04 09:00:00-08:00",
    "title": "Pace of job gains slows to 62,000 in November, Statistics Canada says – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/business/pace-of-job-gains-slows-to-62000-in-november-statistics-canada-says/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}