{
    "authors": [
        "The Canadian Press"
    ],
    "content": "Relatively few Canadians do invest in U.S. biopharma, according to financial data firm Refinitiv\n\nCanadians looking for profitable stocks related to the fight against the COVID-19 pandemic have plenty of homegrown options, but investing in small domestic firms carries elevated risks as well as rewards.\n\nBetterLife Pharmaceuticals Inc. is one such company. The Vancouver firm is in final testing on a treatment for cases in which a vaccine doesn’t work or patients refuse to be inoculated.\n\n“We have a Made-in-Canada solution,” says founder and CEO Dr. Ahmad Doroudian. His company has worked with the National Research Council and Toronto immunologist Dr. Eleanor Fish.\n\nThe company has developed an inhalable method to treat COVID-19 patients by helping the immune system to defeat the virus.\n\n“We think we can make an impact. We absolutely think we’re going to be part of a treatment cocktail that’s going to be needed to contain this infection in years to come.”\n\nOther names include Algernon Pharmaceuticals Inc., IMV — which is working on a vaccine — and WELL Health Technologies Corp., which offers antibody tests.\n\nInvesting in biotechnology is by nature risky, Doroudian concedes, but the rewards are much larger than investing in a global vaccine developer like Pfizer, whose shares are more stable.\n\nWhile shares of small biotech firms can surge or plunge based on clinical results, their trading prices are much lower.\n\nBetterLife’s shares have traded between 40 cents and $3 over the last 52 weeks with its market capitalization currently standing at $28.5 million. Pfizer’s value is US$227 billion based on a US$40.84 share price.\n\nOther Canadian biotech firms are private but have partnered with large multinationals that are available for investment. For example, Medicago is working with GSK.\n\nVancouver’s AbCellera Biologics Inc. and Eli Lilly and Company have co-developed the anti COVID drug bamlanivimab to treat patients with mild or moderate symptoms that has received emergency use approval in Canada and the United States.\n\nApproval comes as AbCellera seeks to raise US$200 million through an IPO on the Nasdaq Global Market.\n\nThe hype over the biotech company has grown with the announcement that Facebook early investor and PayPal co-founder Peter Thiel has joined its board of directors.\n\nYet, buying into a company that’s launching an initial public offering because they have a promising COVID treatment or vaccine can be risky, warns Les Stelmach, portfolio manager at Franklin Templeton Canada.\n\n“Definitely, buyer beware,” he said from Calgary.\n\nFor the most part, Canadian investors have to turn to the U.S. to get direct access to pharmaceutical efforts to combat COVID, especially for vaccines.\n\nEven before the virus, investors needed to look outside Canada to build a reasonable position in health care because the sector is dramatically under-represented in the TSX, said Craig Fehr, investment strategist at Edward Jones.\n\n“We’re not necessarily advising our clients to look at specific investments that are the vaccine play per se. But we do think health care should be a meaningful part of any well-diversified equity portfolio because the secular and the cyclical opportunities that exist in that space are compelling to us,” he said in an interview.\n\nRelatively few Canadians do invest in U.S. biopharma, according to financial data firm Refinitiv.\n\nJust 1.4 per cent of Pfizer’s shareholders are Canadians. They hold 78.1 million shares valued at US$2.86 billion. The ratio for GSK is 1.42 per cent, 1.16 per cent for Eli Lilly, 1.36 per cent for Gilead and 0.58 per cent for Moderna.\n\nStill, Pfizer, Moderna and AstraZeneca are attracting heightened investment interest after each announced COVID vaccines.\n\n“I think you buy Pfizer because it’s a good drug company. They make money, and they have a good drug pipeline of new and promising products. It’s not just a play on COVID,” said Stelmach.\n\nInvesting in small- and mid-cap biotech companies is difficult because they generally rely heavily on a single source of revenues, said Mike Archibald, vice-president and portfolio manager with AGF Investments Inc.\n\nAs a generalist investor Archibald said he doesn’t want to focus a lot of his portfolio that can surge on regulatory approval but collapse on negative news.\n\n“When I’m putting together a portfolio, those are bets that I generally don’t make. And if I’m gonna make them, I usually make them in very, very small percentage increments and would require a large amount of due diligence to ensure that I understand exactly what the potential outcomes are.”\n\nA good strategy for most Canadian retail investors is instead to focus on the positive impact of vaccines on the general economy, said Anish Chopra, managing director with Portfolio Management Corp.\n\n“If you’re looking at reopening trades you’re starting to see them in the marketplace which would be old economy types of industries such as financial services, energy, hospitality.”\n\nRoss Marowits, The Canadian Press\n\nCoronavirusInvesting",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-06 12:15:00-08:00",
    "title": "Canadians have some domestic options to invest in COVID buzz, says biotech CEO – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/business/canadians-have-some-domestic-options-to-invest-in-covid-buzz-says-biotech-ceo/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}