{
    "authors": [],
    "content": "As a year of uncertainty continues, it has become more critical than ever for small businesses to find creative ways to succeed, and many are turning to Export Navigator for advice and support. Operating across B.C., the free Export Navigator Program has been helping businesses grow since 2016 — now, it’s stepping in to help businesses like North Pacific Kelp from Haida Gwaii to innovate and adapt.\n\nExport Navigator is a free program that connects business owners with a local export advisor who can help them find new customers beyond B.C. From growth planning to information about exporting, business owners across the province have applied free advisor support to expand with confidence.\n\nThroughout the uncertainty of the COVID-19 pandemic, the advisors at Export Navigator have been helping businesses find ways to pivot and succeed in the face of new challenges — such as taking advantage of e-commerce platforms and learning how to access government funding resources. With more businesses turning to the program, its success stories now span a range of industries and countries.\n\nHonorable Minister Mungall, responsible for the Ministry of Jobs, Economic Development and Competitiveness, believes it’s the local aspect of Export Navigator that has been fundamental to its success in helping small businesses:\n\n“As a resident of a rural community, I see so many innovative people creating products and services that deserve wider distribution. Every business and every community is different, and I think that’s why Export Navigator’s regional approach has been so valuable.”\n\nPrince Rupert-based export advisor Mietka Zieba has been working with businesses across the North Coast to help them export. One of Mietka’s many success stories is North Pacific Kelp, a natural foods company that exports kelp foraged from their base in Haida Gwaii. Founder Dafne Romero had successfully grown her business locally but needed some help to expand beyond B.C — that’s where her advisor Mietka came in. After meeting one-on-one with her personal Export Advisor, Mietka Zieba, Dafne was connected with buyers and offered resources to help create a growth strategy. Some additional work on meeting foreign labeling requirements and Pacific Kelp soon successfully entered new markets.\n\n“Being part of Export Navigator opened up a huge amount of possibilities for my business. For instance, I’ve now incorporated bar codes onto our packaging to trace our products. Because of that change in labeling we’ve increased the stores we’re selling in – we’re even in select Save-on-Foods.”\n\nFrom solo startups with a small customer base to larger corporations that already export to some select markets, Export Navigator is available to businesses of all sizes in the North Coast and across B.C.\n\nTo continue helping businesses in the North Coast, the free program is accepting online applications. To support underrepresented groups, businesses owned by Indigenous Peoples, women, and youth can expect specialized support and are also encouraged to apply.\n\nExport Navigator gratefully acknowledges that we live, work, and play on the traditional territories of the Indigenous Peoples of British Columbia.\n\nSmall Business",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-09-21 06:30:00-08:00",
    "title": "North Coast businesses achieve international success with Export Navigator – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/marketplace/north-coast-businesses-achieve-international-success-with-export-navigator/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}