{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "Kootenay East MLA Tom Shypitka takes over as energy and mines critic for the B.C. Liberal opposition. Kelowna-Lake Country MLA Norm Letnick (right) moves from health critic to assistant deputy speaker. (Hansard TV)\n\nThe B.C. Liberal opposition has selected its critics to respond to Premier John Horgan’s new majority government, with interim leader Shirley Bond taking on a new role of seniors and long-term care.\n\nBond said Monday the 28-member official opposition is taking a team approach to the COVID-19 crisis, and will share the load with rookie Kelowna-Mission MLA Renee Merrifeld, who takes on the role of health critic. Former health critic Norm Letnick (Kelowna-Lake Country) becomes assistant deputy speaker.\n\n“It’s about leading by example,” Bond said of her own role in releasing the lineup Nov. 30. “It’s about the incredibly hard work that all of our critics will have to do, and I think it sends a signal about how important we think those issues are.”\n\nPeace River South MLA Mike Bernier is the new finance critic as incoming Finance Minister Selina Robinson prepares a budget to deal with the huge demands and deficits of the pandemic. Fraser-Nicola MLA Jackie Tegart replaces Bernier as education critic, as schools have their own struggles with carrying on while controlling the spread of coronavirus infection.\n\nSkeena MLA Ellis Ross takes over as environment and climate change critic, and Kootenay East MLA Tom Shypitka is the critic for energy and mines as B.C. carries on pipeline construction and continuing greenhouse gas reduction efforts.\n\nRELATED: Carole James stays on to advise John Horgan\n\nRELATED: B.C. reverts to ‘stand-alone’ forests ministry\n\nVancouver-Langara MLA Michael Lee has a key critic role for transportation and infrastructure. B.C. is moving to the final stages of the Kicking Horse Pass portion of the Trans-Canada Highway, with that and other sections subject to the NDP government’s union-restricted contracts. Horgan has told the new transportation minister, Rob Fleming, that that public construction model is to be used in future projects, as B.C. and Canada expect big infrastructure works to help the economy recover in the coming years.\n\nLee was one of the candidates who ran against Vancouver-Quilchena MLA Andrew Wilkinson for the leadership after Christy Clark resigned in 2017. The other contenders include Abbotsford West MLA Mike de Jong, who becomes attorney general critic, and Kamloops South Thompson MLA Todd Stone, critic for jobs, economic recovery and innovation.\n\nWilkinson is not assigned a specific portfolio. Bond said he has agreed to use his extensive experience as a minister and deputy minister to “support multiple critic roles” as the opposition takes on a 57-member NDP government caucus. A brief session is scheduled to start Dec. 7.\n\nThe full list of B.C. Liberal critics:\n\nAdvanced Education, Skills Training and Sport – Coralee Oakes\n\nAgriculture and Food – Ian Paton\n\nAttorney General – Mike de Jong\n\nCitizens’ Services – Bruce Banman\n\nChildren, Family Development and Child Care – Karin Kirkpatrick\n\nColumbia Basin Initiatives – Doug Clovechok\n\nEnergy, Mines and Low Carbon Innovation – Tom Shypitka\n\nEducation – Jackie Tegart\n\nEnvironment and Climate Change Strategy – Ellis Ross\n\nFinance – Mike Bernier\n\nFisheries, Aquaculture and BC Ferries – Jordan Sturdy\n\nForests, Lands, & Natural Resources – John Rustad\n\nGender Equity, Accessibility & Inclusion – Stephanie Cadieux\n\nHealth – Renee Merrifield\n\nHousing – Ben Stewart\n\nIndigenous Relations and Reconciliation – Peter Milobar\n\nJobs, Economic Recovery and Innovation – Todd Stone\n\nLabour – Greg Kyllo\n\nMental Health and Addictions – Trevor Halford\n\nMunicipal Affairs – Dan Ashton\n\nPublic Safety and Solicitor General – Mike Morris\n\nRural Development – Lorne Doerksen\n\nSeniors Services & Long Term Care – Shirley Bond\n\nSocial Development and Poverty Reduction – Dan Davies\n\nTourism, Arts and Culture, and Anti-Racism Initiatives – Teresa Wat\n\nTransportation, Infrastructure and TransLink – Michael Lee\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC legislatureBC politicsCoronavirus",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-30 14:35:00-08:00",
    "title": "B.C. Liberals pick critics to take on Horgan’s NDP majority – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/business/b-c-liberals-pick-critics-to-take-on-horgans-ndp-majority/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}