{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "A big job: Former forests minister Doug Donaldson stands before a 500-year-old Douglas fir in Saanich to announce preservation of some of B.C.’s oldest trees, July 2019. (B.C. government)\n\nThe B.C. ministry with the biggest name and footprint in provincial history is being broken up as part of a reform of rural and resource development, Premier John Horgan says.\n\nNewly elected Stikine MLA Nathan Cullen has been assigned the task of reorganizing what is now officially known as the Ministry of Forests, Lands, Natural Resource Operations and Rural Development into two government departments. That will leave Kootenay West MLA Katrine Conroy with a focus on forests and rural development as B.C.’s first female forests minister. Cullen, a long-time northwest B.C. MP appointed “minister of state” or assistant to Conroy, will likely end up in charge of the vast Crown lands and resource roads that wind through them.\n\n“When we were sworn in in 2017, it was my desire to have a stand-alone ministry of forests, something that the former B.C. Liberals had rolled in to what is now one of the most unwieldy ministries within government,” Horgan said after revealing his new cabinet lineup Nov. 26. “Minister Cullen’s job, working with Minister Conroy, is to disaggregate that, and take component parts and move them to where they might be better utilized.”\n\nThe directive is included in Conroy’s mandate letter, given to each minister by Horgan. Lands and natural resources will be a full-scale department with significant staff, unlike the mental health and addictions ministry that essentially advises the health ministry.\n\nRELATED: What exactly is ‘old growth,’ and how much is protected?\n\nRELATED: B.C. suspends some old-growth logging for consultation\n\n“The ministry was created by Gordon Campbell just days before he resigned as premier,” Horgan said. “It’s been existing for almost a decade without any amendments or visions, and I think it’s an important part of our economic vitality, certainly forests, but also to have the permitting and other processes separated so that they can have a stand-alone minister.”\n\nCampbell’s logic for combining forests and lands was that roads, bridges and sites for logging, mining and other industrial development were linked with care of wildlife, as B.C. struggled with dwindling caribou herds and other conservation issues. Wildlife was moved from environment into what became a super-ministry in charge of more than 90 per cent of the province’s area.\n\nCullen was elected to replace Doug Donaldson, who retired as Skeena MLA after three and a half years as forests and lands minister. One of his last projects was embarking on a “holistic” old-growth forest preservation strategy, starting with nine regions where logging is deferred for consultations with Indigenous communities in each region.\n\nThe nine areas total 3,350 square km, including the Seven Sisters region near Smithers, Incomappleaux Valley, Crystalline Creek and Stockdale Creek watersheds in the Kootenays, the Upper Southgate River that drains to Bute Inlet on the south coast, Skagit-Silverdaisy near the U.S. border and H’Kusam, McKelvie Creek and Clayoquot Sound on Vancouver Island.\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC legislatureBC politicsforestry",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-27 13:20:00-08:00",
    "title": "B.C. returning to ‘stand-alone’ forests, rural development ministry – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/business/b-c-returning-to-stand-alone-forests-rural-development-ministry/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}