{
    "authors": [
        "K-J Millar"
    ],
    "content": "The Fairview-Ridley Connector Corridor is now 75 per cent complete, announced Prince Rupert Port Authority on Nov. 30. (Photo: supplied by PRPA)\n\nThe Fairview-Ridley Connector Corridor is now more than 75 per cent complete the Prince Rupert Port Authority (PRPA) announced on Nov. 30.\n\n“Throughout the COVID-19 pandemic, crews from the Coast Tsimshian Northern Contractors Alliance, a local First Nations joint venture, have safely worked 24-hours a day on rotating shifts to build this critical piece of infrastructure,” Monica Cote manager for corporate communications said in a press release.\n\nTo reach the three quarters mark teams have completed dredging work and placed rock along the full length of the road. One third of the road is now at sub-grade elevation and ready for the paving structure the statement said.\n\nThe Fairview-Ridley Connector Corridor is a five kilometre road stretching along the southwestern edge of Kaien Island and remains on track for Quarter two of 2021 completion.\n\n“The Fairview-Ridley Connector Corridor is designed to get trucks off downtown streets, improve safety as we grow, and reduce the environmental impacts of trucking activities in Prince Rupert,” Shaun Stevenson, president and CEO of the PRPA said. “We anticipate the changes will cut emissions for each truck trip by about 75 per cent.”\n\nREAD MORE: Fairview-Ridley connector corridor is 20 per cent complete\n\nThe Connector Corridor is integral to the sustainable growth of Prince Rupert’s intermodal ecosystem, and will create new supply chain efficiencies through the development of logistics services, like the Ridley Island Export Logistics Platform and South Kaien Import Logistics Park.\n\n“These projects will generate new jobs and economic advantages for local communities and First Nations, as well as reduce the impact of port operations on the environment,” Cote said in the release.\n\nThe $115 million Connector Corridor project will be fully activated when DP World’s Fairview Terminal expansion is completed in 2022. This will enable container truck traffic to be rerouted away from public roads to the new Port Authority-owned route, which will reduce the journey from 20 kilometres to 5 kilometres.\n\nThe port handles approximately $50 billion in trade value per year and supports an estimated 36,00 direct supply-chain jobs in northern BC, $481 million in annual wages, and $125.5 million in annual government revenue. In 2019, a record 29.9 million tonnes of cargo moved through the Port of Prince Rupert.\n\nA video clip on the Fairview-Ridley Connector Corridor can be seen at: https://vimeo.com/461580172\n\nREAD MORE: Port of Prince Rupert president on growing trade in 2019\n\nhr width=75%>\n\nK-J Millar | Journalist\n\nSend K-J email\n\nLike the The Northern View on Facebook\n\nFollow us on Twitter\n\n",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-30 13:45:00-08:00",
    "title": "Crews are working 24 hours a day to complete vital infrastructure road in Prince Rupert – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/crews-are-working-24-hours-a-day-to-complete-vital-infrastructure-road-in-prince-rupert/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}