{
    "authors": [
        "The Canadian Press"
    ],
    "content": "The government says Canadian companies already collect those taxes when they make digital sales\n\nA logo for Netflix on a remote control is seen in Portland, Ore.,Aug. 13, 2020. Experts in taxation and media say a plan announced Monday by the government will ultimately add to the cost of digital services and goods sold by foreign companies. THE CANADIAN PRESS/AP-Jenny Kane\n\nThe cost of digital services and goods sold by foreign companies like Netflix will go up under a taxation plan the government wants to put in place next year, experts said Tuesday.\n\nOttawa said in its fiscal update released Monday it will require multinationals to collect GST or HST on digital products and services, which it said would add up to $1.2 billion over five years.\n\nSometimes labelled a “Netflix tax,” the measure would also apply to other services such as Amazon.com Inc.’s Prime Video or the Spotify audio streaming service, as well as digital products such as software applications.\n\nThe government says Canadian companies already collect those taxes when they make digital sales, so it’s only fair that foreign multinationals should do the same.\n\nKPMG tax partner Joe Micallef said it’s likely Canadians will end up paying the taxes collected for the government by foreign multinationals.\n\n“Right now, the way in which they’re delivering their services, they’re not responsible for the collection,” Micallef said.\n\n“And so, effectively, it would mean that these charges would be appearing on (their) invoices.”\n\nA regular monthly subscription for a streaming service that delivers video or music would be a simple calculation, with the tax rate applied to the purchase price.\n\nBut Micallef said it is be more difficult to estimate how much additional tax individual consumers, or businesses, will pay for other types of digital purchases, he said.\n\nSomething like gaming software might cost little or nothing itself, but offer the option for subsequent charges to add features that make the experience better.\n\n“How many times? How many transactions? It adds up,” Micallef said.\n\nDwayne Winseck, a media industry researcher at Carleton University in Ottawa, also expects companies will add the price of the tax to the total sale price.\n\n“I mean, this is really not a very substantial amount, when we’re talking about corporate finances,” said Winseck, who is a professor of journalism and communication.\n\nHe said that the term “Netflix tax” has become highly politicized and is often used as “code” for levelling the playing field between U.S.-based digital media companies and traditional Canadian broadcasters.\n\n“And if the idea is to create a level playing field between those two services, then that by all means that makes great sense,” Winseck said.0\n\nDavid Paddon, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nfederal government",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-02 12:10:00-08:00",
    "title": "‘Netflix tax’ for digital media likely to raise prices for consumers, experts say – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/business/netflix-tax-for-digital-media-likely-to-raise-prices-for-consumers-experts-say/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}