{
    "authors": [],
    "content": "While other distillers are bottling individual sizes of sanitizer, focusing on larger-size products lets Vancouver Island’s Shelter Point serve organizations like the RCMP, Department of National Defence, Fraser Health Authority, and school districts.\n\nTucked along the Vancouver Island coastline just south of Campbell River, the 380-acre Shelter Point farm is blessed with the key ingredients for exceptional hand-crafted spirits: fertile barley-growing fields, an underground aquifer providing naturally filtered water, and crisp sea air.\n\nHere, skilled artisans use traditional Scottish distilling methods to craft those ingredients into award-winning spirits.\n\nBut when hand sanitizer was urgently needed to combat the spread of COVID-19? That same know-how began doing so much more.\n\n“Like a lot of others in our industry, when COVID-19 started, we wanted to help address the immediate need – creating the sanitizer and shipping free to those who needed it, including 2,000 litres to Vancouver General Hospital,” explains distillery owner Patrick Evans.\n\nRamping up volume to produce the sanitizer in the most cost-effective way, today Shelter Point has distributed more than 100,000 litres. “After donating several thousand litres of sanitizer initially, it was really important that we provide the product at a fair price, possible by producing on a larger scale,” Evans says.\n\n“And our formula doesn’t add a foaming agent or thickening gel so it doesn’t dry your hands out. We studied the formula according to the World Health Organization, then used a charcoal filtering process to make it as pure as possible.”\n\nMaking a difference a little differently\n\nWhile other distillers are bottling individual sizes, focusing on larger-size products lets Shelter Point serve organizations like the RCMP, Department of National Defence, Fraser Health Authority, and school districts. For individual bottles, they’ve partnered with Purica in Cowichan Valley.\n\n“It just took off and now we’ve shipped across Canada,” Evans says. “We were working full-on to ensure we didn’t have to tell people we were sold out.”\n\nToday, a dedicated sanitizer production area is separate from whisky production, with additional employees to accommodate production.\n\nAs awareness grows – and with it the distillery’s capacity to produce more – they’re also now distributing to retailers. “We started just wanting to be part of the solution, but we’ve had such a strong demand, this is a long term product for us,” Evans says.\n\nTo learn more, visit shelterpoint.ca, and to support the local community, discounts on sanitizer are available for those paying at the distillery, 4650 Regent Rd., Campbell River.\n\nCoronavirusLocal Business",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-06-08 06:00:00-08:00",
    "title": "Vancouver Island distillery crafts sanitizer to meet Canadian need – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/marketplace/vancouver-island-distillery-crafts-sanitizer-to-meet-canadian-need/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}