{
    "authors": [],
    "content": "As those holiday season bills start coming in, most British Columbians could use a little extra cash in their pocket.\n\nFor some people, those elusive funds could be closer than they think. In BC, there’s approximately $160 million in unclaimed funds sitting in long-forgotten accounts waiting to be collected!\n\nThese forgotten assets are administered by a non-profit called the BC Unclaimed Property Society (BCUPS) (www.unclaimedpropertybc.ca), which as a public service oversees long-lost money in dormant accounts and works to reunite these funds with the rightful owners.\n\n“The\n\nBC Unclaimed Property Society serves as kind of a lost-and-found for forgotten funds in the province,” says Alena Levitz, Executive Director of BCUPS.\n\nIn 2018, BCUPS returned approximately $1.7 million in unclaimed funds.\n\nSince it was established by the provincial government and Vancouver Foundation in 2003, the Society has put approximately $14.5 million in forgotten funds back in the hands of British Columbians.\n\nFunds are from dormant credit union accounts, unclaimed wages, insurance payments, court payments, intestate estates (death without a will), overpayments to debt collectors, and outstanding real estate deposits.\n\n“Funds become dormant for a host of reasons,” points out Levitz. “If you’ve moved around a lot, chances are you’ve become separated from some money that belongs to you. You could have left some funds in a credit union account you forgot to close. Another common scenario is when an employee leaves a place of employment, moves away and the employer can’t locate them to give them their final pay.”\n\nSearching for missing funds is simple and free\n\nIf you think you have forgotten funds, search BCUPS’ free online database to see if there’s missing money waiting for you. Individuals can retrieve forgotten funds by completing a simple verification process that firmly establishes their identity as rightful owner. There are no fees or costs to search for or claim dormant assets through BCUPS.\n\nIn today’s era of online scams and online phishing, Levitz says people have every right to be cautious. “BCUPS never asks for expenses, taxes, fees or some other disbursements to claim forgotten funds, ” she says.\n\nShe encourages consumers to be wary of anyone alleging to hold unclaimed property who pressures them to act fast before it expires or asks for banking or credit card information. “We take extraordinary measures to protect people’s privacy when reuniting them with their unclaimed funds.” She also points out that there is no limitation period to claim forgotten funds from BCUPS.\n\nWhile the average BCUPS claim is around $300 to $500, somewhere in BC is the heir to an unclaimed estate worth a whopping $1.9 million.\n\nNow that would cover a lot of holiday bills!",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2019-12-30 06:00:00-08:00",
    "title": "Unclaimed assets in BC worth $160 million! – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/marketplace/unclaimed-assets-in-bc-worth-160-million/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}