{
    "authors": [],
    "content": "Mary-Lou Starrett (left) and Mary Stroomer (right) with their journeyman Heavy Equipment Operator certificates. Reach out to Tricorp to find out how they can help you reach your next career goal!\n\nSome women want flowers on Feb. 14. Mary-Lou Starrett got something better.\n\n“I got to go on-site and check out the construction cranes on Valentine’s Day. I was surrounded by massive cranes — it was awesome!”\n\nFor Starrett, visiting the modular construction site in Kitimat was the culmination of years of hard work, education, job hunting, and support from organizations like Tribal Resources Investment Corporation (TRICORP).\n\n“A lot of people invested in me and my training. I’m trying to do my best for them.”\n\nBreaking barriers, facing fears\n\nMary Stroomer’s big moment wasn’t cranes in Kitimat, it was a pile of dirt in Maple Ridge. After years working as a flagger, Tricorp funded her Heavy Equipment Operator training with IUOE in Maple Ridge. She was keen to play with all the big toys, but driving an excavator up a steep pile and then digging the ground beneath her tracks was a little daunting.\n\n“I pushed myself to try new things in Maple Ridge. You need to be a sponge — watch and learn from those who already know,” she says.\n\nWhen she made it to the top she let out a little whoop on the radio, and then got right back to work.\n\n“For years I stood on the outside looking in. I’d rather be on the inside.”\n\nNever stop training\n\nStarrett trained to become a Heavy Equipment Operator in 2014, but still found it hard to get a job.\n\n“I thought that would open doors, but nobody wants to hire someone who’s green and doesn’t have the hours.”\n\nAfter three years handing out resumes, Tricorp helped Starrett re-take the Heavy Equipment Operator course, just to get more hours behind the wheel. Then she got her Class 3 driver’s license, and then her Class 1.\n\n“Within a week I was working. I listened to CFNR a lot while driving the highways, and I kept on hearing these Tricorp ads for crane operators. I was interested but thought it was hard to get into. But Tricorp funded me again!\n\nNow she’s working down her industry hours so she can get back to the cranes at the Kitimat modular construction project.\n\n“I want to see it grow. I want to be a part of it,” Starrett says.\n\nGet involved\n\nStroomer also found employers didn’t take her resume seriously, so when she saw a Facebook ad for Tricorp’s W.E.S.T. Training she threw her hat in the ring. That training qualified her for the Heavy Equipment Operator training in Maple Ridge, which led to her dream job with Bird Construction.\n\n“Bird is an awesome company. They’re all about safety. If you have a problem the supervisors are there to help — nobody’s giving me the gears because I’m new.”\n\nStroomer and Starrett both recently earned their Heavy Equipment Operator journeyman tickets, and are hoping more women join them in the field.\n\n“Now’s the time to do it with Kitimat hiring apprentices. Get your foot in the door!” Stroomer says.\n\ndevelopmentIndigenous",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-03-02 06:00:00-08:00",
    "title": "She’ll take the wheel: Women in trades – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/marketplace/shell-take-the-wheel-women-in-trades/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}