{
    "authors": [],
    "content": "This April is the third annual Construction and Skilled Trades Month in BC, recognizing the skilled trades people who work to build and maintain the structures we all rely on every day, to keep us functioning safely.\n\nAnd it’s more important than ever to recognize the hard work of this essential workforce\n\nIf we ever needed a reminder of how significant an industry construction is, and how important skilled trades people are to the lives we live, coronavirus is providing that reminder.\n\nIf you’re one of the many British Columbians who considers construction work as a lesser occupation, this article is for you.\n\nWe’re recognizing the essential services which are continuing to operate because they are “essential to preserving life, health, public safety and basic societal functioning…the services British Columbians come to rely on in their daily lives.”\n\nThis April is Construction Month and the 180,000 skilled trades people in BC have been officially designated as essential workers.\n\nBC’s health care workers and emergency responders are on the front lines of the war on COVID-19. They’re out there every day fighting the virus and risking their own lives in doing so, to care for the British Columbians who are ill and need their help.\n\nAnd make no mistake: the skilled trades people who work in construction are also out there on the front lines. The front lines of our economy and our resilience. They’re out there applying their hard-earned skills and experience to build and maintain the structures we all rely on every day, to keep us functioning safely.\n\nAt nearly 10 per cent of BC’s total workforce and GDP, construction is essential to the health of our communities. Not just because of the size of the payroll, but because the built environment is essential to our very functioning as a society.\n\nWhile we’re isolated at home because our businesses have been closed, or because we are caring for a loved one, we are – often invisibly – served by our tradespeople. Their work keeps the electricity and water and Netflix coming. It keeps the rain out and the heat in. It keeps the walls up and lights on.\n\nAnd BC’s construction industry is building the new critical infrastructure that will be essential to recovery.\n\nSo this April, the third annual Construction and Skilled Trades Month in BC, please join the BC Construction Association, four Regional Construction Associations, LNG Canada, and many other generous sponsors, in recognizing the efforts of the construction workers in your life and your community.\n\nNext time you’re passing a worksite (from a six-foot distance), give the workers a nod and a thank you. They’re doing an important job. They are essential.\n\nWe briefly considered cancelling Construction Month this year. But in the midst of extreme hardship it’s even more important to take a moment to thank people for the work they do to make our community strong. When your moment comes to say thank you, use it well.\n\nConstructionskilled trades",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-04-06 06:00:00-08:00",
    "title": "April is Construction Month in BC – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/marketplace/april-is-construction-month-in-bc/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}