{
    "authors": [],
    "content": "Terrace Art Gallery Coordinator Laura McGregor, Northwest Regional Airport Manager Carman Hendry and Skeena Salmon Arts Fest Society President Dave Gordon stand with one of three display cases installed throughout the airport in December.\n\nYXT is now the busiest art gallery in northwest B.C.\n\nThe Northwest Regional Airport in Terrace, which registers the highest passenger count in the region, now features rotating displays of local art from the check-in counter to departure vestibule to arrivals.\n\nThe displays were installed through a partnership between the airport, the Skeena Salmon Arts Fest Society and Terrace Art Gallery to bring more local art to Terrace.\n\n“You see a lot of art from northwest B.C. in the Vancouver airport,” Arts Fest Society president Dave Gordon says, giving woodcarver and sculptor Dempsey Bob as an example. “Some of Canada’s best artists live and work in Terrace, but if you walked around the Terrace airport in the past, you wouldn’t see their work.\n\n“Now you will.”\n\nMaking space for local art\n\nThe Terrace-Kitimat community airport installed a state-of-the-art aircraft landing system in 2001 to increase reliability of the airport landings to a 99.7 per cent efficiency rate.\n\nThis time last year, the airport also completed significant renovations. The $18-million project included a new building with drive-up access, affordable parking, a restaurant and a big blank wall destined for art.\n\nAirport Manager Carman Hendry says when the arts fest and gallery pitched a wall exhibition of rotating paintings, they were thrilled to cooperate.\n\n“We’re very happy to show art made in the community, to the community, right in our own backyard,” Hendry says.\n\nThe first installation — the wall of paintings inside the main terminal — went up in August for four months. The works by regional artists Suzo Hickey​, Lynn Cociani and Mark Tworow all illustrate the expansiveness of the water system surrounding YXT.\n\nNext, acrylic paintings by Manda Hugon and Marie-Christine Claveau will adorn the wall.\n\nThree display cases, two of which were donated by Rio Tinto, were also installed throughout the airport in December, as were carvings by Joerg Jung of JJs Woodart.\n\nThe prolific local artist carved regional tree species along with the wildlife that inhabit them — a red cedar with a wolverine, birch with an owl, alder with a beaver and hemlock with a red squirrel. Gordon says they will remain in the departure vestibule for one year.\n\n“When we need to refresh it, we’ll find something equally as exciting.”\n\nThe rotating displays are great exposure for local artists, he adds.\n\n“We have a history of training artists who then move south to make a living,” he says. “But our goal is to keep northwest artists living and working in the area.\n\n“The renovated Terrace airport creates opportunities for artists in the northwest and we hope as a result we can keep them here.”",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2019-12-09 06:00:00-08:00",
    "title": "Community airport becomes ‘busiest art gallery in northwest BC’ – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/marketplace/community-airport-becomes-busiest-art-gallery-in-northwest-bc/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}