{
    "authors": [],
    "content": "People take in the scenery at sunset on Kitsilano Beach in Vancouver, B.C. Thursday, March 19, 2020. The province of British Columbia and the provincial health minister are urging people to practice social distancing to help curb the spread of the coronavirus, and business leaders across the province are encouraging continued unity and commitment from all British Columbians. THE CANADIAN PRESS/Jonathan Hayward\n\nEight months ago, the world as every British Columbian knew it changed. The greatest health and economic crisis of our generation has impacted each and every one of us. We’ve had to adjust our lifestyles, how we work and how we connect with those we care about. Many have lost their paycheques and, most tragically, some have lost their lives.\n\nEvery single British Columbian has sacrificed.\n\nDespite these hardships, as organizations representing employers big and small, in urban centres and rural communities, what’s struck us most is the spirit of togetherness that has helped us through these challenging times.\n\nThe fact that every British Columbian – whether they’re on the front line, driving a truck, in a leadership position or running a household – is dealing with this pandemic in their own way, but, at the same time, continuing to find ways to show compassion and help each other has been extraordinary. People collectively caring for people – it’s that Team B.C. spirit that makes this province great.\n\nThat’s why, as we look to manage the next phase of the pandemic and the road to economic recovery, we need to seize that team spirit once again.\n\nWe also know we have other challenges in B.C. We’re concerned about inequality and divisiveness. We’re troubled by homelessness and mental health within our communities. And we are worried about the impact climate change will have on our planet and our children’s future.\n\nWe recognize we don’t have all the answers, but what we do know is we want to be a part of the solution. Now more than ever, we need to collaborate and focus on ensuring B.C. not only survives this pandemic, but that we thrive.\n\nIt’s why our organizations are committed to doubling down on our efforts to work together. By employing the same collective approach that’s kept workers and communities healthy and safe, we can help people get back on their feet economically and socially and help our province and our communities move forward.\n\nAs our B.C. MLAs of all stripes return to governing in the coming days, we’re here to work with you. Whether it’s in continuing to fight the pandemic, lifting up our economy and growing opportunities for meaningful work, tackling climate change or ensuring our workplaces and society are inclusive and diverse – there’s a role for all of us to play and we are here to help.\n\nWe are committed to continue working in partnership with health officials, government, Indigenous leaders, workers and communities to create a better British Columbia for everyone. Because the workers our members represent – the grocery clerks, construction workers, restaurant owners, entrepreneurs, forestry workers, data analysts, mining engineers and more – are also our family members, our neighbours and our friends.\n\nTime and time again, British Columbians have shown resolve and strength in coming together. By re-doubling our efforts now, we will get through this pandemic and build a brighter future for all.\n\nSusan Yurkovich, President and CEO, BC Council of Forest Industries\n\nGreg D’Avignon, President and CEO, Business Council of BC\n\nBridgitte Anderson, President and CEO, Greater Vancouver Board of Trade\n\nChris Gardner, President, Independent Contractors and Businesses Association\n\nMichael Goehring, President and CEO, Mining Association of BC\n\nDan Baxter, Interim President and CEO, BC Chamber of Commerce\n\nBryan Cox, President & CEO, Canadian LNG Alliance",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-18 07:00:00-08:00",
    "title": "LETTER: Together, for a brighter future for all British Columbians – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/opinion/letter-together-for-a-brighter-future-for-all-british-columbians/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}