{
    "authors": [],
    "content": "By Dr. Bonnie Henry\n\nVICTORIA – British Columbians have been nimble in adapting their individual actions to slow the spread of COVID-19 in our communities over the last 10 months, and it has had a big impact.\n\nOur actions have helped keep our hospitals, schools and workplaces open – and protect the ones we love.\n\nSuch essential actions include maintaining a safe distance from others, cleaning our hands and staying home if we get sick. Using masks appropriately is another important example of an individual act that results in a collective good. Each of these is a layer of protection to guard against a virus that never rests.\n\nSome people are asking when we will see masks mandated in B.C. The answer is that they already are. The mandate to use masks appropriately is a cornerstone of businesses’ and organizations’ COVID-19 safety plans, and is embedded in our health-care facilities’ operational policies and restart protocols in other public institutions.\n\nDespite how it might appear when we watch the news or go on social media, research shows that most of us in B.C. are doing the right things most of the time. Ordering universal mask use in all situations creates unnecessary challenges with enforcement and stigmatization. We need only look at the COVID-19 transmission rates in other jurisdictions that have tried using such orders to see what little benefit these orders by themselves have served. We also know that when orders and fines are in place, it is racialized people and those living in poverty or homeless who are most often targeted.\n\nEach day, we are continuing to learn more about the virus and how it spreads. Right now, we are seeing rapid transmission in social gatherings where masks would not be worn anyway, in certain workplaces and risky indoor settings, like group fitness activities. Provincial health officer orders are always a last resort and we have used them carefully to address these recent trends.\n\nRELATED: No ‘mask mandate’ as B.C. COVID-19 hits new highs\n\nRELATED: Influenza in Canada ‘exceptionally low’ so far\n\nThe orders we have in place now complement our clear and expressed expectation that people will wear masks in indoor public places like shopping malls, stores, on ferries and transit.\n\nOur orders also mandate that businesses and workplaces must have COVID-19 safety plans in place. These should include mask wearing, in addition to barriers, reduced numbers of people in spaces, screening of workers and the public and availability of hand cleaning and sanitation. Staff and customers must abide by these plans and businesses must offer virtual, online or contactless alternatives to customers who cannot wear a mask. COVID-19 safety plans are enforceable and something businesses and workplaces now plan for and have in place, in accordance with our orders.\n\nWe know that people want to do the right thing when they understand the reasons behind our thinking and have the tools they need to do what is asked of them. Mask use is important, and we need everyone to have the same understanding of our expectations. Wearing a mask will never eliminate all risks, but it is a significant part of the layers of protection that can help protect us, our loved ones and our community. Now more than ever, it is a measure we must all take.\n\nAn order can never replace our personal commitment. We need to be responsible for our own actions – that is how we all pull together. I wear a mask, and I expect each of you who can to wear one too.\n\nDr. Bonnie Henry is provincial health officer for British Columbia.\n\nBC legislatureCoronavirus",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-11-17 09:00:00-08:00",
    "title": "GUEST COLUMN: COVID-19 masks mandatory in B.C., but not everywhere – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/opinion/guest-column-covid-19-masks-mandatory-in-b-c-but-not-everywhere/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}