{
    "authors": [],
    "content": "It is the community firefighters who are going to show up and save the day.\n\nWho you gonna call?\n\nRealistically, it’s not the Ghostbusters. If you have a fire, or need medical assistance, it is the community firefighters who are going to show up and save the day.\n\nOf all of the occasions we acknowledge as a community and as a newspaper, we always think Fire Prevention Week is one of the most important. Not only is this our chance to say thank you to our incredibly hardworking volunteer firefighters, but it’s also a good time to figure out our own fire plan.\n\nOn the first point, we cannot say enough about how exceptional our community firefighters are in the Cowichan Valley. They spend countless hours practicing and keeping in shape, keeping the equipment in working order, and just generally making sure they are at the ready for when the siren on the firehall sounds. And sound it does, as anyone who lives near a firehall can attest. At all hours of the day and night, these quiet heroes head to the hall at the call of duty, never knowing what they might be stepping into.\n\nMany of these volunteers do more than just fight fires. They are first responders to crash sites, and are called out to provide medical aid or employ the jaws of life.\n\nAnd that’s on top of their day jobs that pay the bills.\n\nWith the advent of the COVID-19 pandemic, their work has become even more complicated, with COVID protocols to learn and adhere to, on top of all of their regular training.\n\nThese men and women deserve to be celebrated, at least once a year.\n\nThe other important part of Fire Prevention Week is that it’s a reminder. Change out your smoke alarm batteries. Check your fire extinguishers, and carbon monoxide monitors, if you have them. Are all of the entries and exits to your house useable, or have you piled junk in front of a door or window that should be moved? And, critically, do you have a plan for what you will do in case of a fire? Does your entire family know the plan and have the same plan? Now is the time to think about these things, not when you’re running for the door with a cloth over your nose to keep from breathing in the smoke. Everyone in your house needs to know how to get out. They need to know where you’re going to meet after exiting the building. What is the plan for any pets in your household?\n\nFor that matter, do you know what the fire plan is at your workplace? Do you know where the emergency exits are, and where you are to assemble if you have to evacuate? Something else to think about.\n\nAt some point this week, take a few minutes and give yourself a refresher. Prevention and preparedness can avert tragedy.\n\nEditorials",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-10-08 06:00:00-08:00",
    "title": "Editorial: Celebrating the hard work of our firefighters – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/opinion/editorial-celebrating-the-hard-work-of-our-firefighters/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}