{
    "authors": [],
    "content": "Call it the big gamble of 2020.\n\nNot the continuing lottery of who among us, masks and distancing notwithstanding, will test positive for the coronavirus next, but the high-stakes game B.C. NDP leader John Horgan has ushered in by calling a snap election for Oct. 24 – while the pandemic still rages.\n\nHorgan wants a strong mandate from the public for the next four years – for continued action on COVID-19 and economic recovery – unfettered by a power-sharing agreement with the B.C. Greens that has shored up the minority government he formed after the 2017 election. That marriage has been on shaky ground recently, particularly since the departure of former Green leader Andrew Weaver and the Greens’ moves to block or amend some NDP bills this past spring.\n\nFor Horgan, that’s sufficient justification to walk back on a promise to the Greens not to a call an election before the scheduled date in October 2021.\n\nREAD ALSO: Citing stability, B.C. premier calls snap election for Oct. 24\n\nHorgan is also looking for a majority – more than 44 seats as opposed to the current 41 seats in the Legislature – that will provide him more muscle against opposition BC Liberals and what he has termed “partisan hectoring and uncertainty about whether bills will pass or not.” But, make no mistake, he has chosen this hill to fight on, at this time, because of perceived unpreparedness of the other parties to go to war.\n\nInitial signs are that his Sept. 21 ambush has left both the Liberals and the Greens scrambling to assemble platforms, while Liberal leader Andrew Wilkinson and Green leader Sonia Furstenau publicly fumed that Horgan had reneged on a deal they feel would have ensured stability for the next year.\n\nAt best Wilkinson could say only that a Liberal platform and plan for economic recovery would start to roll out by the end of this week, while, as of Tuesday, the Greens had made no announcement when their program will be presented.\n\nIt’s clear that Horgan is counting on the public to want to stay the course on measures already taken, and hoping the early good impression of B.C.’s public health response to COVID-19 – piloted by provincial health officer Dr. Bonnie Henry – will linger, in spite of the tarnish of climbing case numbers this fall.\n\nThe downside – and it could be a big one – is the irritation that calling an election at such a vastly inconvenient time is already provoking. The public, reeling from the psychological and economic impacts of the pandemic, is probably even less prepared to go to the polls at this point than the political parties.\n\nAdd to that the potential that – through already-evident demand for mail-in ballots as a safety measure – B.C. voters may not even have the final numbers tabulated come election night, and we can see clearly how much Horgan is betting on a single roll of the dice.\n\nBC politicsBC Votes 2020Editorials",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-09-24 06:30:00-08:00",
    "title": "B.C. election bid a high-stakes game – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/opinion/b-c-election-bid-a-high-stakes-game/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}