{
    "authors": [
        "John Arendt"
    ],
    "content": "This pandemic is ultimately about people, not just about numbers\n\nCOVID-19 has resulted in a number of closures and cancellations. (File photo) COVID-19 has resulted in a number of closures and cancellations. (File photo)\n\nIt took six months for the world to reach the first 10 million confirmed COVID-19 cases.\n\nThe next 10 million confirmed cases happened just over six weeks later, on Aug. 10.\n\nAnd since that time, it has taken just one month and one week to add 10 million more confirmed COVID-19 cases. This figure was reached on Sept. 16.\n\nHow long will it take to reach the next 10 million cases?\n\nIn addition to the number of confirmed cases, another number must also be considered. We are approaching one million deaths from COVID-19.\n\nThese are not just numbers. Every person who has tested positive for COVID-19, and every person who has died as a result of this pandemic is, before all else, a person.\n\nREAD ALSO: Increase in average daily COVID-19 cases ‘a concern’ for Canada’s top doctor\n\nREAD ALSO: Worldwide virus cases top 20 million, doubling in six weeks\n\nThe numbers must still be considered, and the statistical analysis is important. But each of the COVID-19 numbers is about something affecting people.\n\nAfter more than half a year of COVID-19 precautions in Canada, the pandemic is not going away in this country. Instead, the numbers are continuing to increase, with no end in sight.\n\nIn the summer, case numbers in British Columbia began to rise. At the time, many hoped the increase would represent a spike in new cases.\n\nBut instead, the number of new cases has not shown any significant decrease since mid-July.\n\nWhile it is easy to focus on the number of cases and the number of deaths from COVID-19, it is important to remember that this pandemic is ultimately about people, not just about numbers.\n\nThis disease has affected people around the world. It is not limited on one geographic region or to one socio-economic segment.\n\nBy now, a growing number of people know one or more people who have had COVID-19. Some have recovered while others have not. And some of those who no longer have COVID-19 are still dealing with long-term health effects from this disease.\n\nOthers around us have underlying health problems, such as heart and lung issues, compromised immune systems or chronic ailments. If they were to contract the virus, the outcome could be much more serious than for an otherwise healthy young person.\n\nAnd even among those who are in good health, COVID-19 can be fatal.\n\nMore than 30 million people around the world have tested positive for this disease, and nearly one million have died as a result.\n\nThis pandemic isn’t just about numbers and statistics. It affects people like us.\n\nJohn Arendt, Black Press Media\n\nColumnistCoronavirus",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-09-24 06:00:00-08:00",
    "title": "COLUMN: COVID-19 statistics are the stories of people – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/opinion/column-covid-19-statistics-are-the-stories-of-people/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}