{
    "authors": [],
    "content": "From following health advice and ‘doing no harm,’ to not hiking fees – one business expert has a number of suggestions\n\nStatistics Canada’s July Labour Force Survey contained mostly good news for nervous British Columbians trying to adjust to life in the strange world of COVID-19.\n\nEmployment jumped by 70,000 for the month, meaning B.C. has recouped about 60 per cent of the 400,000 jobs lost between February and April. However, that still leaves us with 165,000 fewer jobs than six months ago, equivalent to three years of employment growth in normal economic circumstances. And most of the jobs added since April are part-time positions, which suggests a high level of “underemployment” in the province.\n\nOther data also points to a challenging economic environment. The tourism industry is on life support amid the worst business conditions on record. British Columbia’s merchandise exports have been falling over the course of 2020; in June, for example, they were 16 per cent lower than a year ago. The Canada-U.S. border remains shut with no sign it will be opening again anytime soon. And business insolvencies are mounting.\n\nAll of this underscores the risk that B.C.’s nascent economic recovery could stall in the coming months. Against this backdrop, what can the provincial government do to put the economy on a solid growth footing?\n\nSeveral suggestions come to mind.\n\nThe first is to follow the physician’s advice and “do no harm.” In particular, the next 6-12 months is not a time for governments to be hiking taxes or fees or adding to the heavy regulatory burdens that companies doing business in B.C. already face.\n\nSecond, the province should consider cutting the provincial sales tax (PST) to assist in bolstering the consumer spending that drives much of our economy.\n\nReducing the PST from 7 per cent to 3.5 per cent for two years would boost consumer outlays, notably on durable and semi-durable goods. It would also lower costs for businesses, which pay roughly 40 per cent of the PST taxes collected by the provincial government, thereby encouraging more companies to invest and expand in B.C. Meanwhile, over the next two years the province can explore options for long-term sales tax reform with a view to introducing a modernized, made-in-B.C. consumption tax in January 2023.\n\nAnother suggestion is to extend the provincial tax deferrals for businesses – covering the PST and the Employer Health Tax — announced in late March until the end of the year, instead of ending the deferrals on September 30. The government could also look at allowing companies that owe taxes to pay the monies owed over a 12 month period rather than all at once. These steps would give companies more time to strengthen liquidity and rebuild cash balances, thus reducing the number of firms that end up closing their doors for good.\n\nThe province can also support economic recovery by increasing its own $10 billion annual capital budget. Proceeding immediately with badly needed major projects — like the George Massey Tunnel replacement — makes sense.\n\nSo does a program to speed up the repair and refurbishment of existing public sector assets like buildings, highways, and post-secondary education facilities. Small-scale capital spending projects can be advanced more quickly than large projects because they don’t usually require permits or extensive up-front planning and engineering work.\n\nB.C. policymakers should also be looking to fast-track private sector investments wherever possible to help kick-start the economy and restore the 30,000 construction jobs lost since February. Many B.C. companies are willing and able to spend their own money on everything from pipelines and industrial plants to mines and research labs. In addition, there are dozens of multi-family residential development projects in the queue in municipalities across the lower mainland, Greater Victoria and the Okanagan. Now would be an excellent time for the province to work with and if necessary compel local governments to proceed with these projects with no or minimal delays.\n\nThe NDP government undoubtedly has other ideas for moving the economy forward. We’ll learn more when Finance Minister Carole James delivers her next economic and fiscal update in September.\n\nJock Finlayson is executive vice president and chief policy officer of the Business Council of British Columbia",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-08-17 14:30:00-08:00",
    "title": "FINLAYSON: Next 6-12 months not the time for government to hike taxes – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/opinion/finlayson-next-6-12-months-not-the-time-for-government-to-hike-taxes/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}