{
    "authors": [
        "The Canadian Press"
    ],
    "content": "Authors: Jessica Cooke, PhD Student, Department of Psychology, University of Calgary; Nicole Racine, Postdoctoral Research Fellow, Psychology, University of Calgary, and Sheri Madigan, Associate Professor, Canada Research Chair in Determinants of Child Development, Owerko Centre at the Alberta Children’s Hospital Research Institute, University of Calgary\n\nEvery fall, parents are tasked with managing back-to-school transitions. Usually this means shopping for or gathering school supplies or seasonal clothes, registering for activities or helping children manage back-to-school excitement or worries. But with COVID-19, the start of this school year feels very different.\n\nOur research shows that due to COVID-19, parents and children are experiencing greater levels of anxiety and stress. With contentious and sometimes shifting information about the process, these feelings of uncertainty may increase.\n\nParents and children may feel nervous about contracting and spreading COVID-19 at school, frustrated by vague reopening plans and skeptical of whether children are able to follow social-distancing and mask protocols.\n\nWhile levels of anxiety and stress may be high, parents play an influential role in helping children cope, encouraging a positive back-to-school transition and helping to reduce children’s anxiety and worries.\n\nHave honest and open discussions\n\nIn psychology, we use the phrase, “what you resist, persists” to describe how avoiding important discussions can actually lead to more persistent feelings of anxiety in children.\n\nIt’s important to have honest, factual and open conversations with your child about COVID-19 and its implications for returning to school. Tailor the depth and breadth of conversations based on your child’s age and maturity level.\n\nFor example, with a younger child in grades 1 to 3, you could spend some time talking about what might look different this year. Their class size may be smaller and teachers and educators may be wearing masks. Extra-curricular activities or regular school activities (such as some forms of music) might be cancelled.\n\nFor older children, you could ask if there are specific things they are worried or concerned about, and talk these through with them.\n\nYou can help children and youth identify their role in staying safe — such as avoiding touching their face, washing their hands or using hand-sanitizer and keeping their distance from others. Use coping-focused language that emphasizes the active role that children, youth and adults are taking to make sure things go well (following instructions, engaging in good hygiene), rather than focusing on things that are out of their control (like if a student gets COVID-19).\n\nName fears to tame fears\n\nAs child clinicians, we often encourage parents to use the “name-it-to-tame-it” strategy. First, parents can help their child identify their concerns by asking them what they’re worried about. Then, parents can help their child “name” the worry or concern by labelling it. For example, younger children might name their fear the Worry Monster. Simply labelling the emotion as anxiety can be helpful for older children and teenagers.\n\nNaming the worry often helps tame the fear by helping children build understanding about what they’re feeling. It also gives parents and children a common emotion language that can be used in future discussions, and provides an opportunity for parents to provide emotional support and coping strategies. These strategies include deep breathing and using coping-focused language like: “I feel better when I talk about my worries.”\n\nChildren often want reassurance their fears won’t come true. It may be tempting for parents to say “Everything will be OK!” or “No one will get sick!” But such words can prevent children from facing their fears and developing problem-solving and coping skills. They can also prevent children from taking COVID-19 preventative measures (like social distancing) as they may perceive the risk to be low or non-existent.\n\nAcknowledge and support your child in the discomfort that there are some things that may be out of our control, and that it’s best to focus on what we can control.\n\nREAD MORE: From masks to cohorting, a guide to back-to-school rules across the country\n\nREAD MORE: Teachers to get 2 extra days to prepare for students’ return, now set for Sept. 10\n\nListen, validate, help to problem-solve\n\nWhen your child expresses (or demonstrates) they’re struggling, start by listening carefully to their concern. Put devices away, so you can provide undivided attention. Then, try validating your child’s emotion by making a caring statement that reflects what they just said, such as: “I can understand why you feel worried about returning to school, especially when there are so many changes happening because of COVID-19.” Identifying reasons why your child might be feeling worried or anxious will make them feel understood.\n\nHelp your child face their fears by promoting problem-solving. Together, identify a few possible solutions and then help them identify which solution seems best. You can discuss different options or role-play solutions to help your child build confidence. Encourage your child to try out the solution in real life and discuss whether or not it worked. If not, try picking a different solution to test!\n\nFocus on things going well\n\nIt’s important to acknowledge children’s worries and anxieties, but parents should also motivate their children to focus on the things they might be looking forward to. Children are likely excited to see friends, peers or teachers in person. They may positively anticipate a daily school routine and take pride in their role as a student or in minimizing COVID-related risks.\n\nBefore school starts, you can ask, “What are you looking forward to on your first day of school?” or “What have you missed about school?” Once school starts, you can ask: “What was the best thing that happened today?”\n\nREAD MORE: B.C. school staff, older students required to wear masks in ‘high traffic areas’\n\nBuild a predictable routine\n\nUsually, things we can control makes us feel safe because they are predictable, while things that fall out of our control can lead to feelings of anxiety because they are unpredictable.\n\nOne way parents can help children build feelings of safety and security during COVID-19 is by creating a predictable daily routine, beginning with consistent times for meals, waking up and going to bed.\n\nBefore or after school, engage your child in planned, shared activities like making breakfast, reading together or going to the park.\n\nModel calm behaviour\n\nIt’s OK for parents to feel uncertain and worried. However, as much as possible, try to model calm and confident attitudes about returning to school for your child and use cheerful, positive messages when saying goodbye, and empathy when responding to tantrums, protests or crying.\n\nResearch suggests that children notice how their parents feel and pick up on subtle cues, such as scared facial expressions or cautious tones of voice.\n\nParents who care for their own well-being and mental health are better able to care for their children’s — so be kind to yourself and seek out those you can turn to when you are struggling or troubled by these unprecedented circumstances. You can also seek mental health services.\n\nWhile this year’s transition back to school is different, we can help children feel optimistic by listening to and validating their worries, teaching them coping strategies, reviewing safety protocols and supporting them when they find things difficult. Ultimately, our kids need us to lead the way for a successful back-to-school transition and to develop the lifelong skills they need for navigating challenges.\n\n___\n\nJessica Cooke, PhD Student, Department of Psychology, University of Calgary; Nicole Racine, Postdoctoral Research Fellow, Psychology, University of Calgary, and Sheri Madigan, Associate Professor, Canada Research Chair in Determinants of Child Development,, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirusSchools",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-08-18 11:45:00-08:00",
    "title": "How to help your child cope with the transition back to school during COVID-19 – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/opinion/how-to-help-your-child-cope-with-the-transition-back-to-school-during-covid-19/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}