{
    "authors": [],
    "content": "‘This year has reminded us all of just how utterly and completely our province relies on working people’\n\nLaird Cronk is the president and Sussanne Skidmore is the secretary-treasurer for the BC Federation of Labour. (File collage)\n\nBy Laird Cronk & Sussanne Skidmore\n\nThis Labour Day is a lot different from past years. You won’t see the big parades, rallies and parties we usually have. Instead it’s small, carefully-distanced backyard get-togethers and on-screen virtual celebrations.\n\nBut there’s a deeper change that’s happening too. Something important has shifted in British Columbia.\n\nThis year has reminded us all of just how utterly and completely our province relies on working people: to keep our economy going, to provide the necessities of life, to deliver the services families need.\n\n2020 has taught us that the front lines are much broader and deeper than many people assumed. Suddenly, many of the lowest-paid workers in the most precarious jobs in BC are finally getting some long-overdue recognition. And we’ve stopped seeing workplace safety as something that only affects individual workers, and recognizing it for what it is: a vital underpinning of public health.\n\nWhat’s more, we’re discovering that there’s a lot more we can be doing to make life better for all of us. The COVID-19 pandemic has prompted governments to come together with quick, dramatic action on a wide range of fronts: supporting the incomes of laid-off workers, protecting vulnerable British Columbians with increases to disability and income assistance rates, providing help for renters, subsidizing wages, investing in health care and education, improving employment standards and workplace safety, and even making the first moves toward paid sick leave.\n\nOf course, a lot of this has happened because BC has the benefit of a provincial government that listens to working people. The contrast with other provinces — and south of the border — is often stark.\n\nBut we’ve also had something else on our side: a strong, determined labour movement backed by working people across BC. And there’s every reason to believe that movement is gaining strength.\n\nThere’s a new momentum for organizing, and a big part of that comes as the pandemic shows working people that our lives are on the line. The stronger and more united we are, the better we’re able to press for safer workplaces, better working conditions and a fairer deal.\n\nAnd that’s doubly important now, because we’ve learned something else in the past several months.\n\nCOVID-19 exposed how deep and wide the gaps in our province are, and how many people have been left out and sold short in BC’s economy. Those gaps and inequities weren’t just unfair in and of themselves. They were vulnerabilities the virus exploited, and left us all more exposed and at risk.\n\nBut the way we’ve responded, as communities and through our governments, shows us we don’t have to just accept those gaps. And we don’t have to recreate those inequities.\n\nSo as much as 2020 has been about shutting down, it’s also increasingly about opening up — that is, opening up possibilities for positive, lasting changes. And this year, that’s what’s really worth celebrating: this new sense of possibility and potential in the strength we have together.\n\nThe pandemic is far from over, but the rebuilding in BC has begun. And as we rebuild, we can regain what we had — but we can also rebuild something stronger and fairer.\n\nWe can build stronger, more resilient communities that are better able to grapple with big challenges, whether it’s ending this pandemic, fighting off the next one or addressing the threat of climate change. We can build a fairer, greener economy where everyone can benefit — and where we make every job a good job. We can make investments that improve crucial services everywhere from classrooms to hospitals to transit.\n\nAnd thanks to the working people of British Columbia, we are going to emerge from this pandemic. So that we can hold out hope that next year, we’ll be able to truly celebrate together.\n\nHappy Labour Day, everyone.\n\nLaird Cronk is the president and Sussanne Skidmore is the secretary-treasurer for the BC Federation of Labour.\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-09-06 11:00:00-08:00",
    "title": "OPINION: Let’s celebrate working people — and work together for a fairer B.C. – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/opinion/opinion-lets-celebrate-working-people-and-work-together-for-a-fairer-b-c/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}