{
    "authors": [],
    "content": "From following health advice and ‘doing no harm,’ to not hiking fees – one business expert has a number of suggestions\n\nThe first three quarters of 2020 have been an eventful time for B.C. workers and the labour market generally.\n\nThe beginning of the year saw a near record-low unemployment rate, with employers in many sectors scrambling to find qualified people to fill vacant positions. Then COVID-19 arrived on the scene, throwing the global economy into a tailspin and prompting widespread business closures in Canada and other countries as governments sought to slow the spread of the virus.\n\nCanada and B.C. suddenly entered a recession, with the national unemployment rate soaring from roughly 5 per cent in late 2019 to more than 13 per cent in April and May and millions of workers losing their jobs — at least temporarily. Strikingly, here in B.C. the “employment rate” fell from an average of 62.5 per cent in 2019 to just 57.6 per cent by July 2020 – an unprecedent drop.\n\nIn contrast to previous recessions, women have been somewhat harder hit by the labour market pain delivered by the COVID-19 shock.\n\nIn the early stages of the lockdown, employment among females tumbled 17 per cent, which was three percentage points more than for males. But with the re-opening of most consumer-facing businesses, many jobs held by women have come back. In August, employment among men remained 5.8 per cent lower than in February while for women it was down by 6 per cent.\n\nFortunately, the tide of job losses that kept us glued to our computer screens in March and April proved to be relatively short-lived. By May, a labour market rebound had kicked into gear, and it continued over the summer months as the provincial government’s economic re-opening plan was gradually implemented.\n\nBut by the end of summer, most of the re-opening related employment gains were firmly in the rear-view mirror. Job growth in August slowed to just 15,000, down from 70,000 the month before.\n\nEmployment still sits 150,000 below February levels. In addition, tens of thousands of recent high school and post-secondary graduates are searching for work in what remains a difficult economic environment.\n\nAs for the job market recovery, the “low hanging fruit” has already been harvested as previously shuttered parts of the economy have reopened. Looking ahead, the Business Council anticipates sluggish job creation over the balance of 2020 and well into next year.\n\nThis reflects, in part, our expectation that waves of layoffs lie ahead as more companies close their doors while others adjust to “new normal” conditions that involve less use of labour.\n\nBy year end, we project that employment will still be down by 120,000 or so compared to where it stood back in February. Many tens of thousands of additional British Columbians will be employed but working fewer hours than in pre-COVID days.\n\nIn short, there is still a lot of ground to cover to get back to a healthy labour market. B.C. policymakers must be laser-focused on the critical task of re-employing people who lost their jobs in the spring. The province also needs to prioritize establishing the conditions that will prompt more companies and entrepreneurs to invest in the province.\n\nJock Finlayson is executive vice president and chief policy officer of the Business Council of British Columbia",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-09-10 08:30:00-08:00",
    "title": "FINLAYSON: A Labour Day snapshot of the B.C. job market – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/opinion/finlayson-a-labour-day-snapshot-of-the-b-c-job-market/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}