{
    "authors": [],
    "content": "Despite being one of the world’s great certainties, we often forget that taxes exist to generate the revenue that governments need to support public services – which enhance our quality of life and protect those vulnerable in society, as we have seen throughout this pandemic.\n\nOn the other hand, taxes are costly to administer, stifle investment, and are unevenly applied. This can bog down the very economic growth we rely on to generate much-needed government revenue.\n\nBritish Columbia’s Provincial Sales Tax (PST) is one of these taxes.\n\nB.C. introduced the PST when the Queen was a princess. A lot has changed over the last 70 years. Unfortunately, the PST has aged poorly and is now an archaic tool in a modern world that doesn’t meet the needs of people, the economy, or governments today. It unfairly impacts medium and low-income households and misses a large part of the new economy.\n\nSimply put, the PST needs to retire. It has become a web of rules, complexity, and layers that few understand – and some try to avoid. For example, a bicycle is PST exempt, but an E-bicycle or unicycle is not. Bike parts are exempt if bought with the original bike but require PST to be paid if bought on their own. Propane from the same tank if used for one business purpose is PST exempt but if used for another business purpose requires PST to be paid. How is that possible?\n\nAs we continue to fight COVID-19, we need to start taking bold action to rebuild our economy. This week, a coalition of community, post-secondary and business leaders from small and large firms released Stronger Today, Starting Tomorrow – an economic plan for BC families and businesses. Among the 24 recommendations included in this Plan is an immediate halving of the PST to 3.5 per cent for two years to help families, businesses, and our economy.\n\nPaying less tax will means British Columbians will have a bit more money to spend through these uncertain times. Reducing the PST will help families make ends meet, free up funds for household necessities or a take up a new family activity.\n\nThe question we should be asking in Dawson Creek, Kelowna, Nanaimo, and everywhere in between is if a PST cut should just be a temporary first step. For a truly lasting impact, the Stronger Tomorrow plan recommends evolving the almost 75-year-old PST into a made-in-B.C. value added tax system.\n\nTo be clear, this is not about bringing back the HST that was rejected by British Columbians and controlled by federal government rules. The recommendation is a plan is a made-in-B.C. tax where the decisions about how the tax system works – like determining which items are taxed and those that are exempt – would be decided by British Columbians, not Ottawa. For instance, all types of food consumption and food services could be tax-exempt and lower-income households could get a tax credit like the GST credit.\n\nReforming the sales tax system would bring two big benefits. First, a modern tax system would spread the tax across a wider array of goods or services, which means everyone pays their fair share across the economy, while creating a real opportunity to reduce the tax rate below the current seven per cent.\n\nThe second big benefit is job creation. With the sales tax system modernized, business wouldn’t be paying a provincial tax that has to be included in their prices. That cost would be removed, and customers won’t end up paying tax on taxes paid by the business. Businesses can put their savings into growing their company and creating more jobs – which in turn contributes to government revenues.\n\nThe next two years offer plenty of time for the provincial government to consult with British Columbians about real, meaningful tax reform.\n\nBut British Columbians struggling through the downturn don’t have two years to figure out how to make ends meet – they need help right now. B.C. families could get tangible help with their household costs by the government taking action and cutting the PST today.\n\nGreg D’Avignon is president and CEO of the Business Council of B.C., and Jeff Zweig is the president and chief executive officer of Mosaic Forest Management and chair of the Business Council of B.C.",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-08-05 19:00:00-08:00",
    "title": "Reforming the PST can be a powerful tool to get people, businesses back to work long-term – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/opinion/reforming-the-pst-can-be-a-powerful-tool-to-get-people-businesses-back-to-work-long-term/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}