{
    "authors": [
        "Marisca Bakker"
    ],
    "content": "More people have volunteered to send a gift to a senior than there are seniors participating\n\nAn initiative aimed at connecting Smithereens with lonely seniors this holiday season is being met with great success.\n\nThe Adopt A Senior program had more people wanting to help than there were seniors signed up as of Dec. 7.\n\nThe idea is to make cards, write a nice note or show some love in a creative and practical way because the COVID-19 pandemic has created a lot of isolation for many, especially seniors and especially during Christmas.\n\nThe program is being put on by WellSpring Home & Community Services, Bulkley Valley and one of the organizers helping out, Mark DeHoog, said the community response has been huge.\n\n“We are in need of more seniors at this point. In a matter of hours, we had 50 volunteers signed up and have another 30 on the waiting list.”\n\nKat Webster signed up to adopt a senior and she said her family is thrilled to help out.\n\n“We chose to participate to help spread some Christmas cheer and love to our seniors that have had such a tough last year,” she said. “I work as a registered nurse and I am aware of how challenging this last few months have been for everyone, however it has been particularly lonely and isolating for our seniors. We hope that the seniors that receive a little something from us feel connection, community, cared for and a little less lonely.”\n\nErin Colebank was also one of the lucky people to get a spot to sponsor a senior and she said she and her husband wanted to do something to help somebody out this holiday season.\n\n“Knowing how isolated and lonely seniors in our community are likely feeling, especially this year due to COVID, when I saw the post I thought it was the perfect place to help out,” she said. “To know that we are helping to make somebody’s holiday a little brighter is really a special feeling. I think the program is a fantastic idea and I hope that it is something that continues on year after year.”\n\nAnyone who knows a senior that would like to particpate, can call Lauren at 250-877-3269.\n\nMore information can found on WellSpring’s Facebook page.\n\nChristmas",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "Adopt a Senior program needs more seniors – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/community/adopt-a-senior-program-needs-more-seniors/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}