{
    "authors": [],
    "content": "One reader wants the province to create a more inclusive name for B.C.\n\nDear Editor,\n\nIt is now a practice, before a public event, to have an Indigenous land acknowledgement.\n\nIs this mere tokenism under the guise of “Truth and Reconciliation” with Indigenous communities even when our province continues to have a colonial name, flag and coat-of-arms?\n\n“British Columbia” was chosen on July 24, 1858, by Queen Victoria, a monarch who never set foot in these parts.\n\nHer decision, though said to be hesitant, was unilateral and without consultation with the mostly Indigenous people who lived here.\n\nVancouver Island was a British colony for just 22 years.\n\nThe mainland was a colony for 13 years.\n\nBritish rule ended in 1871.\n\nWATCH: Celebrating Metis culture and history at Louis Riel Day\n\nYet we cling to the “British” moniker while ignoring the more than 10,000 years that Indigenous communities inhabited these lands, and our 149 years in the Canadian Confederation.\n\nSome will argue that a name change will dishonour British roots and heritage, and, oh yes, tradition.\n\nThey conveniently forget the roots, heritage, and traditions of our Indigenous communities, who have lived here for more than 10,000 years, and, those of us who are not of British (today a minority) ancestry.\n\nWe are not British. And Columbus never came here.\n\nWe have laboured under this colonial pretension for too long.\n\nBesides the abbreviated “B.C.” commonly used today is meaningless.\n\nWhen can we take pride in our province’s name, flag, and coat-of-arms?\n\nThe government should ask the Indigenous peoples to come up with a new name that will reflect the province’s more than 10,000 years of history, awesome grandeur, diverse bio-geoclimatic zones, and its mosaic of multi-cultures.\n\nThe new name – hopefully easily pronounceable, spelled and short – could be proclaimed on the 150th anniversary of the province’s entry into the Canadian confederation on July 20, 2021.\n\nThis would be in accordance with Premier John Horgan’s recent challenge of “thinking outside the box” in the “new normal” after the COVID-19 pandemic.\n\nA new name will demonstrate solid confidence in ourselves as a province that is inclusive of all its residents, rather than clinging to coattails of British colonists.\n\nThe name, of course, cannot be fully changed overnight because it is a complex matter.\n\nHowever, many countries had the fortitude to make a start and go through a liberating process of choosing a new name – such as Ghana, Indonesia, Sri Lanka, Zambia, Mali – and implementing it fast.\n\nIf we keep the status quo, we are only confirming that all our talk about reconciliation with our Indigenous peoples is only tokenism and not full and respectful inclusion.\n\nBen Pires, Victoria\n\nDo you have an opinion you’d like to share? Please send us a letter to the editor, include your first and last name, your address, and your phone number.\n\nBritish ColumbiaLetter to the Editor",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-07-20 18:00:00-08:00",
    "title": "LETTER: Time to rename British Columbia – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/opinion/letter-time-to-rename-british-columbia/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}