{
    "authors": [
        "Associated Press"
    ],
    "content": "Finally, Washington’s NFL team would have a name everyone could cheer with pride\n\nNow that Washington’s NFL team has taken a long-overdue step toward changing its name, it’s time to start lining up some possible replacements.\n\nWashington Generals, anyone?\n\nAfter defiantly resisting all calls to change its offensive moniker, the Washington NFLers finally bowed to the only thing that really matters.\n\nThe bottom line.\n\nWith the nation embroiled in social turmoil and economic upheaval, Nike stopped selling merchandise with the Washington nickname. For good measure, stadium title sponsor FedEx called on the team to come up with a moniker that would be more in tune with the current times rather than, say, the 1800s.\n\nSo, while Washington’s NFL team conducts what it calls a “thorough review” that almost will surely lead to a replacement by 2021 at the latest, let’s explore a few possibilities:\n\nGENERALS — This would be a nod to the lovable losers who spent decades serving as the Harlem Globetrotters’ nightly pushovers, compiling a record of one win and somewhere north of 16,000 losses before they went out of business in 2015. Washington’s NFL team hasn’t been quite that bad in recent years, but it did go 3-13 a year ago and last won a playoff game in 2005. If Generals doesn’t work out, how about the Federals? They were Washington’s entry in the USFL during the 1980s, going 7-29 over two seasons in the ill-fated spring football league. A seamless transition, that would be.\n\nGRIDLOCK — The District of Columbia has some of the worst traffic congestion in the nation, so this would seem fitting to all those commuters who’ve been spent roughly the time it takes to play an NFL game just trying to get to work. Also, it sums up our current political climate.\n\nBLAZE — During the War of 1812, the British invaded Washington and set fire to numerous government buildings including the White House and the Capitol. Not necessarily a proud moment in the nation’s history, but probably a notch above Dan Snyder’s embarrassing tenure as team owner.\n\nBUREAUCRATS — The team could pay tribute to all those nameless workers who keep the wheels of government droning along through turbulent times. They’ve certainly shown more imagination than some of Washington’s offensive schemes over the past couple of decades.\n\nFOGGY BOTTOM BOYS — Foggy Bottom is one of the city’s oldest neighbourhoods, which would give Washington’s NFL team a chance to play off the fictional band created for the Coen Brothers’ classic movie “O Brother, Where Art Thou?” The Soggy Bottom Boys were fronted by a lip-syncing George Clooney, who hopefully could be persuaded to cut a video for the team’s new right song, “I Am a Man of Constant Sorrow.” It’s a catchier tune (and certainly more appropriate for the long-suffering fan base) than the hokey “Hail to the ….”\n\nBLOSSOMS — While perhaps lacking the machismo of other potential monikers, the city’s famed cherry blossoms are in full bloom for roughly as long as the hopes of a Washington NFL fan each season. About two weeks.\n\nSENATORS — Washington’s longtime baseball franchise was so horrible most years that its derisive motto became, “First in war, first in peace, last in the American League.” Hmm, that sounds familiar. Other names that were once used by pro sports franchises in the district include the Diplomats (a long-forgotten soccer team from the 1970s) and the Ambassadors (a team that never got off the ground in the World Football League). But forget about the Bullets, the NBA Wizards’ former name. That one was dropped because of its association with gun violence. It ain’t coming back.\n\nHOGS — This name hearkens back to the team’s most glorious era, when a group of down-and-dirty behemoths dominated the offensive line of scrimmage and bullied Washington to three Super Bowl titles under Joe Gibbs. This might be the best way to appease those fans who are sure to object to changing the offensive moniker.\n\nMONUMENTS — C’mon, how can you not like the Washington Monuments! A worthy tribute to the city’s stunning array of marble and granite remembrances, which honour everyone from the first president to Martin Luther King Jr. to the veterans of the Vietnam War. Some great logo possibilities, for sure.\n\nRED TAILS — This is our pick. It maintains a link to the team’s current abomination of a name but also salutes the famed Tuskegee Airmen, the group of African American fighter pilots who broke down racial stereotypes during World War II.\n\nFinally, Washington’s NFL team would have a name everyone could cheer with pride.\n\nPaul Newberry, The Associated Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nNFL",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-07-04 11:30:00-08:00",
    "title": "COLUMN: Some more appropriate names for Washington NFL team – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/opinion/column-some-more-appropriate-names-for-washington-nfl-team/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}