{
    "authors": [
        "Katya Slepian"
    ],
    "content": "There are 57 outbreaks in long-term care and eight in acute care units\n\nHealth Minister Adrian Dix looks on as Dr. Bonnie Henry gives her daily media briefing regarding Covid-19 for the province of British Columbia in Victoria, B.C, Monday, December 7, 2020. THE CANADIAN PRESS/Jonathan Hayward\n\nB.C. has reported 619 new cases and 16 deaths due to COVID-19, provincial health officer Dr. Bonnie Henry said during a press conference Wednesday (Dec. 9).\n\nThe news came on the same day as Health Canada approved the Pfizer vaccine against the virus, and B.C. unveiled its immunization plan.\n\nThere have now been a total of 39,337 confirmed cases of the virus in B.C., and 559 deaths. There are currently 9,329 active cases; 338 people are in hospital, of whom 75 are in critical care or ICU.\n\nOf the new cases, there were 121 in Vancouver Coastal Health, 384 in Fraser Health, 81 in Interior Health, 5 in Island Health and 27 in Northern Health, and one new case in someone who resides outside of Canada.\n\nThere are 57 outbreaks in long-term care and eight in acute care units.\n\nHealth officials said that while B.C. has not bent the curve, they have flattened it with the current measures. Henry noted that public health modified restrictions as needed in response to the crisis.\n\n“I still don’t feel like we’re at a place where we can start second-guessing what we did,” said Henry of B.C.’s response to the virus.\n\nREAD MORE: B.C.’s earliest COVID-19 vaccines go to health care workers first\n\nREAD MORE: Health Canada approves Pfizer-BioNTech COVID-19 vaccine\n\n@katslepian\n\nkatya.slepian@bpdigital.ca\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirus",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-09 16:00:00-08:00",
    "title": "B.C. records 619 new COVID cases, 16 deaths as B.C. unveils vaccine plans – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/b-c-records-619-new-covid-cases-16-deaths-as-b-c-unveils-vaccine-plans/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}