{
    "authors": [
        "The Canadian Press"
    ],
    "content": "NDP landed a decisive victory in the Oct. 24 provincial election, securing 57 of the legislature’s 87 seats\n\nB.C. Premier John Horgan listens during a postelection news conference in Vancouver on Sunday, Oct. 25, 2020. Horgan says the election promise to provide COVID-19 recovery benefit dollars to British Columbia families and individuals will be the focus of Monday’s return to the legislature for a brief session. THE CANADIAN PRESS/Darryl Dyck\n\nPremier John Horgan says his newly re-elected government will focus on ensuring families and individuals start receiving COVID-19 recovery benefits when the legislature resumes for a shortened session on Monday.\n\nHorgan said he expects the session, the first since his New Democrats were re-elected with a majority mandate, to sit for just two weeks before adjourning for the holidays.\n\nDuring that time, politicians are expected to pass legislation that would grant the government the authority to fulfil a campaign promise and begin delivering pandemic relief funds.\n\nThe proposed legislation earmarks one-time, tax-free payments of $1,000 for eligible families and $500 for qualifying individuals.\n\nThe brief legislative session is set to begin with a Monday throne speech mapping out the government’s priorities.\n\nBut Horgan says getting financial aid into the hands of the province’s residents must be his administration’s most pressing goal.\n\n“The priority is getting the supply bill passed so we can flow dollars to families and individuals,” Horgan said at a recent news conference. “We don’t have any anticipated additional legislation.”\n\nHorgan said the money would ideally reach residents before Christmas, but acknowledged such a timeline may be overly ambitious.\n\nThe relief funds, he said, will help both the province’s residents and the regional economy as B.C. grapples with the effects of the global pandemic.\n\n“It’s putting dollars into peoples pockets so they can continue to get through the most challenging time British Columbians have ever known,” Horgan said. “We believe it’s good economics. We campaigned on it.”\n\nThe NDP landed a decisive victory in the Oct. 24 provincial election, securing 57 of the legislature’s 87 seats.\n\nALSO READ: National Student Loan Service Centre plagued by delays as requests for help soar\n\nThe Opposition Liberals, who lost considerable ground during the election and saw Andrew Wilkinson step down as leader after the party’s poor showing, are questioning the need to reconvene the legislature to pass a single bill. The move, they said, comes as the province faces a record budget deficit.\n\n“I think British Columbians would expect that if we are going to open the legislature, bring MLAs from across the province with limited numbers, and with COVID-19 protocols that there should be a substantive agenda,” said interim Liberal Leader Shirley Bond.\n\nB.C. politicians participated in a hybrid, summer session before the election that saw just 20 members attend debates and question periods at the legislature while others participated remotely.\n\nThe government should use the new session to provide an update of the province’s finances, Bond said.\n\nLast September, the government’s first quarterly report forecast a deficit of about $13 billion, but there has been no word on the timing of the next financial report, she said.\n\n“Instead, what we got was the finance minister musing about whether or not she might actually push her budget presentation off until later in the year,” said Bond.\n\nB.C. budgets have traditionally been tabled on the third Tuesday of February. But the legislature changed a law last summer to allow a budget to be tabled later when there is a fall election.\n\nBond said the Liberals plan to hold the NDP to their election promises to cap the fees food delivery companies charge to restaurants for takeout orders and they may also introduce their own private members bills.\n\nHorgan said the NDP will nominate Burnaby New Democrat Raj Chouhan to serve as the Speaker of the legislature.\n\nDirk Meissner, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirus",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-06 15:50:00-08:00",
    "title": "Horgan says COVID-19 relief promise top priority of short B.C. legislature session – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/horgan-says-covid-19-relief-promise-top-priority-of-short-b-c-legislature-session/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}