{
    "authors": [
        "Katya Slepian"
    ],
    "content": "Two-thirds of the new 2,020 cases are in Fraser Health\n\nA woman wearing a protective face mask to curb the spread of COVID-19 walks past a mural in Victoria, B.C., on Monday, Dec. 7, 2020. THE CANADIAN PRESS/Marissa Tiel\n\nThere will be few holiday events this year as B.C.’s top doctor extended COVID-19 restrictions on events and gatherings through the new year on Monday (Dec. 7).\n\nAt the same briefing, provincial health officer Dr. Bonnie Henry said that 2,020 British Columbians had been diagnosed with COVID-19 over the weekend, while 35 people had died due to the virus.\n\nBy day, there were 647 cases reported Saturday, 726 cases Sunday and 647 cases Monday, with 10 epi-linked cases. The weekend’s deaths bring the total COVID-19 death toll in B.C. to 527.\n\nBy region, the weekend’s cases break down to 1,362 in Fraser Health, 304 in Vancouver Coastal Health, 203 in Interior Health, 45 in Island Health and 106 in Northern Health.\n\nThere are 9,380 active cases of COVID-19 following the weekend. Currently, there are 349 people in hospital, of whom 77 are in critical care or ICU.\n\nHenry said there were six new health-care facility outbreaks, with 1,073 long-term care residents and 605 employees infected with the virus. There was also a community outbreak at a mink farm in the Fraser Valley, something that Henry said was very concerning to health officials as COVID-19 can pass back-and-forth between minks and humans.\n\nHenry said that while the morning’s news of a Pfizer vaccine coming this month is heartening, the virus is still running rampant through the province and “straining our system.” Health officials are expected to reveal plans for B.C.’s share of the 249,000 vaccine doses later this week.\n\n“We are not yet through this storm,” Henry said, but added that “the measures… are starting to work.”\n\nRecent COVID-19 measures, which prohibit gatherings and events as well as meeting up with people outside of your immediate household, are now extended until midnight on Jan. 8. However, some drive-through, drive-in and drop-off events with COVID safety plans will now be allowed with up to 50 people who must stay inside their vehicles. Schools will remain open until their usual holiday break time.\n\nThe extended measures mean there will be no multi-household Christmas dinners, Hanukkah celebrations or New Year’s Eve gatherings. People who live alone may form a bubble with another unit, but all others are being asked to stick to their immediate household.\n\n“This year, ‘home for the holidays’ means staying home for the holidays,” said Health Minister Adrian Dix.\n\nOn the fitness front, spin classes, hot yoga and high intensity interval training (HIIT) are suspended indefinitely. Other activities, such as gymnastics, dance studios, martial arts, yoga, pilates, strength and conditioning and cheerleading are on pause until new guidance can be developed. Regular gyms and individual training may stay open.\n\nFor youth, activities like educational programs, music, art, dance, drama, recreational programs outdoor fitness and social activities may continue to operate with a COVID-19 safety plan in place.\n\nAll adult indoor and outdoor team sports also remain banned, while youth sports have return to phase two of ViaSport’s Return to Sport guidelines.\n\n“This is what we need to do for each other. This is a challenging time, I know that,” Henry said.\n\nREAD MORE: Race-based data needed to make sound COVID vaccine, policy decisions: B.C. prof\n\nREAD MORE: Christmas in a pandemic: Most Canadians plan to stay closer to home, poll suggests\n\nREAD MORE: Canada to get 249,000 doses of Pfizer vaccine in December, Trudeau says\n\nREAD MORE: All adult dance studios, other indoor group fitness facilities must close amid updated COVID-19 rules\n\nREAD MORE: Outdoor and indoor adult team sports banned as B.C. battles surge in COVID cases\n\n@katslepian\n\nkatya.slepian@bpdigital.ca\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirusvideo",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-07 15:35:00-08:00",
    "title": "Events, gatherings banned through Christmas, New Year’s in B.C. with no COVID reprieve in sight – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/b-c-reports-2020-covid-cases-35-new-deaths-over-the-weekend/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}