{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "‘Virus is not letting up and neither can we’\n\nPickleball game in Vancouver on Sunday, November 8, 2020. B.C.’s public health restrictions for COVID-19 have been extended to adult team sports, indoors and outside. THE CANADIAN PRESS/Darryl Dyck\n\nB.C. public health officials reported another 711 cases of COVID-19 Friday, as the province considers whether to extend its ban on adult team sports, non-essential travel and other restrictions on Monday.\n\nFraser Health region continues to have the bulk of community infections, with 427 more cases from the latest daily total. Another 143 are in Vancouver Coastal region, 81 in Interior Health, 50 in Northern Health and 10 on Vancouver Island.\n\nThere were 11 more coronavirus deaths recorded, for a total of 492 in B.C. since the pandemic began. There are now 331 people in hospital, up 11 from Thursday, and 76 in intensive care, down four from Thursday.\n\nTwo new outbreaks were declared in the health care system, at Peace Arch Hospital Foundation Lodge and Richmond Hospital. An outbreak at Youville Residence in Vancouver has been declared over.\n\n“We continue to face a significant surge in community transmission and new cases of COVID-19, which means following the provincial health officer’s orders and using all our layers of protection is necessary for every person in our province right now,” provincial health officer Dr. Bonnie Henry and Health Minister Adrian Dix said in a statement Dec. 4.\n\n“The virus is not letting up and neither can we. This weekend, let’s stay small and stay local, so we can slow the spread of the virus in our province.”\n\nRELATED: Next $1.5B in COVID-19 cash ‘prudent,’ Premier says\n\nRELATED: ‘People need to start listening,’ Interior Health doctor says\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC legislatureCoronavirus",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-04 15:26:00-08:00",
    "title": "711 more COVID-19 cases detected in B.C. Friday – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/711-more-covid-19-cases-detected-in-b-c-friday/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}