{
    "authors": [
        "Marisca Bakker"
    ],
    "content": "Depot is now open at the corner of Main St. and Hwy 16.\n\nThe Christmas Hamper Program is in full swing.\n\nThe program has been running for more than 30 years and provides food, the ingredients for a Christmas dinner, toys and books. Each year, around 300 hampers go out, benefiting approximately 1,000 people from Witset to Telkwa. Around 30 per cent of those people are children.\n\nHowever, program coordinator Anne Harfenist said they are receiving more applications this year.\n\n“We won’t know the exact numbers until after the Dec. 11 application deadline,” she said. “Although we don’t ask applicants to explain why they are requesting a hamper, some have included a note on their application telling us about how hard it has been this year for reasons like having to take care of and doing the shopping etc. for elderly parents who they are trying to keep out of stores and safe.”\n\nLike everything else going on this holiday season, the program has had to implement COVID-19 health precautions.\n\n“Sponsors and volunteers have adapted well to all of the changes to the program related to COVID,” she added. “However, many hamper applicants have been having difficulty navigating the changes to the application process that we had to institute.”\n\nREAD MORE: Christmas hamper program ramps up\n\nThe program is still in need of more donations.\n\n“The most useful contribution would be cash donations,” Harfensit said. “We bought food and toys for the hampers to make up for the lack of donations that normally come in through the many events that were cancelled this year.”\n\nThe depot is located at 1330 Main Street. It’s open Monday through Saturday, 10 a.m. to 5:30 p.m.\n\nHampers this year will go out the weekend before Christmas.\n\n@MariscaDekkema\n\nmarisca.bakker@interior-news.com\n\nLike us on Facebook and follow us on Twitter.\n\nChristmas",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "Christmas Hamper program sees increase in applications – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/community/christmas-hamper-program-sees-increase-in-applications/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}