{
    "authors": [
        "Nina Grossman"
    ],
    "content": "An untitled Emily Carr painting of Finlayson Point was donated to the Art Gallery of Greater Victoria by brothers Ian and Andrew Burchett. The painting had been in their family for several decades. (Courtesy of the Art Gallery of Greater Victoria)\n\nArt-lovers can feast their eyes on a never-before-seen Emily Carr creation, recently donated to the Art Gallery of Greater Victoria (AGGV).\n\nThe untitled painting of Finlayson Point off Dallas Road in Victoria was purchased directly from Carr by Bets Burchett, who had connected with the famous painter over a shared passion for dogs. The painting was handed down to their son Peter and his new wife Damaris Burchett as a wedding gift in 1958. The painting was hung over the fireplace mantle in their North Saanich living room after it was built in 1960, and there it stayed until their respective deaths in 2013 and 2019.\n\nNow, thanks to the couple’s sons Ian and Andrew Burchett, the painting hangs on the walls of the Victoria gallery, along with a second Emily Carr, two works from Group of Seven member Lawren S. Harris and others.\n\nAlso included in the gift to AGGV are works purchased by Enid Hendrie Owen, Damaris’ mother. Those paintings include Angidah Naas River by Emily Carr, Moutain Sketch LI and Mountain Sketch XCII by Lawren S. Harris, an untitled painting by Stanley Cosgrove and Village Street, Ste. Adele, OQ 1936 by Robert Wakeham Pilot.\n\nREAD ALSO: What it’s been like living in Emily Carr’s house for 23 years\n\n“It is with considerable pride that these artworks, which graced our family home, are now part of the AGGV’s collection – an institution that clearly held a special place for our parents given their long association and various gifts over the years,” the brothers wrote in a statement. “These gifts span two generations on both sides of our family – maternal and paternal – and we hope that they can be enjoyed by others in the community and all visitors to the Gallery.”\n\nAGGV Director Jon Tupper said this is the first time these works are on display for the public.\n\n“It’s very significant for us and very significant for the visitors,” Tupper told Black Press Media. “For me personally, I love Emily Carr … she painted with such loving care.”\n\nTupper noted how iconic Carr’s portrayal of south Vancouver Island’s landscape is both for locals and all Canadians.\n\n“We live in that landscape – it’s ours, it’s us. Whether you’ve been here three days or all your life, it’s for all of us,” he said.\n\nThe AGGV also revealed that it was Peter and Damaris Burchett who, in the late ’90s, anonymously purchased Carr’s work Odd and Ends from the Greater Victoria Public Library collection as a gift to the AGGV, hoping the purchase would keep the painting in Victoria for the community to enjoy.\n\nThe AGGV first opened in 1951 in the historic Spencer Mansion, adjacent to its current exhibition galleries. The gallery boasts the largest collection in the province, with almost 20,000 works of art in its possession. A proposal for a new gallery received $6 million funding from the provincial government in June 2018.\n\nREAD ALSO: Victoria author pens biography on Emily Carr’s monkey, Woo\n\nDo you have a story tip? Email: vnc.editorial@blackpress.ca.\n\nFollow us on Twitter and Instagram, and like us on Facebook.\n\nArt Gallery of Greater Victoria",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-10-28 17:45:00-08:00",
    "title": "Never-before-seen painting by famed B.C. artist Emily Carr gifted to Victoria gallery – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/entertainment/never-before-seen-painting-by-famed-b-c-artist-emily-carr-gifted-to-victoria-gallery/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}