{
    "authors": [
        "Aaron Guillen"
    ],
    "content": "Paul Larouche, 29, with over 215,000 subscribers, opens up about his journey\n\nSooke’s Paul Larouche, aka PioneerPauly on YouTube, uses a metal detector in hopes to find gold flakes along his claim of the Sooke River. (Aaron Guillen/News Staff)\n\nPaul Larouche has been hunting for treasures since he was young, but now the Sooke man has hit the mother lode.\n\nWith more than 215,000 subscribers on YouTube, the 29-year-old spends his time creating content around finding gold, gems and odd treasures from his travels under the name PioneerPauly.\n\nYou won’t find many videos where he isn’t wearing his signature red and white toque with Canada written across the front.\n\nHe’s found an old pickaxe, Spanish coins, jewelry and obsidian arrowheads during his travels across the province and into several American states. He’s even visited Australia for gold.\n\nBut all the treasures in the world couldn’t convince him to get out of bed four years ago.\n\nAt the age of 25, he was living a different life. He was working as a security worker after leaving the film and TV production industry. As someone who struggles with anxiety and depression, he felt like he was hitting a wall.\n\nREAD MORE: Gold panning means getting back to the land\n\n“I wasn’t doing much with my life,” Larouche said. “I was at a point where I just felt so lost and completely stuck. I was staying inside and didn’t want to leave the house.”\n\nThat is until his uncle, who lives in Langford, tried to get him outside and unearthed a passion for gold panning.\n\nThe 29-year-old remembers that day he first went out with his uncle back in 2017.\n\n“It felt so strange just digging in the mud I thought I was wasting my time,” Larouche said. “The first time I washed out my pan, I saw something so bright and shiny. It was surreal when I found my first speck of gold. I was almost speechless. I didn’t know that this stuff still existed out here.”\n\nSince then, he’s dedicated his time to be an expert at the hobby-turned-career.\n\nHe scoops a mound of dirt into a gold pan at the water’s edge along Sooke River, where he bought a gold claim. He pointed out that because gold is heavy, the metal will drop to the pan’s bottom. He always looks for low-pressure spots along the river whenever he goes out.\n\nHe brought a metal detector to use on land and a diving suit to gold snipe, where he uses a mask and snorkel to find pieces of gold in the water.\n\nALSO READ: The golden rule of Goldstream: there is no gold\n\nNot too far down the same river is where he found one of the biggest pieces he owns, clocking in at 7.5 grams. In one instance, he found 13 grams tucked into a crevice of bedrock underwater. He assumes a gold miner visited decades ago but couldn’t continue looking into that spot, as he also found a broken pickaxe nearby.\n\nLooking to the future, Larouche dreams of one day pitching a documentary-style show to a major broadcasting company or a streaming service, like Netflix.\n\nHe’s hosted several celebrities on his channel, including DALLMYD, an adventure YouTuber with more than 11 million subscribers and Michael Einziger, co-founder and lead guitarist for the American rock band INCUBUS.\n\nHe’s planning to travel to Alaska when the borders reopen, and he’s got his eyes set on Africa as well.\n\n“I’m hoping to convince him to go up north into Nunavut and the Arctic Circle soon,” said Jeremy Woolsey, his second cousin who lives in Ladysmith and grew up gold panning.\n\n“It’s all about timing, though, because we don’t want all the ice to freeze over. We can pan in one of the glacier creeks, and it would be a first for both of us. Since they’ve got long days and nights up there, I’d rather go up when we can get the most sunlight.”\n\nUntil then, Larouche doesn’t mind filling his days with dreams of buried treasure, just waiting to be unearthed.\n\nRELATED: Shifting the lens on Sooke’s gold rush\n\nDo you have a story tip? Email: vnc.editorial@blackpress.ca.\n\nFollow us on Twitter and Instagram, and like us on Facebook.\n\naaron.guillen@goldstreamgazette.com\n\nSookeYouTube\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.\n\nSooke’s Paul Larouche gold snipes along Sooke River, a process in which he uses a mask and snorkel to find pieces of gold. (Aaron Guillen/News Staff)",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-10-30 07:00:00-08:00",
    "title": "VIDEO: Island man finds niche audience by gold-panning on YouTube – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/entertainment/video-island-man-finds-niche-audience-by-gold-panning-on-youtube/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}