{
    "authors": [
        "The Canadian Press"
    ],
    "content": "The company says new members who sign up will see the updated prices effective immediately\n\nThis July 17, 2017, file photo shows a Netflix logo on an iPhone in Philadelphia. THE CANADIAN PRESS/AP-Matt Rourke\n\nNetflix Canada is increasing some of its prices again.\n\nThe streaming giant says the basic plan for subscribers remains unchanged at $9.99 a month, but the standard monthly plan is going up by one dollar to $14.99, and the premium by two dollars to $18.99.\n\nNetflix says it’s implementing the price increase so it “can invest more in films and shows as well as the quality of members’ product experience.”\n\nThe company says new members who sign up will see the updated prices effective immediately.\n\nThe new charges will roll out to existing members according to their billing cycle over the coming weeks.\n\nExisting members will be notified about the change via email and the Netflix app 30 days before the new prices are applied to them.\n\nNetflix has cancelled some of its programming recently due to COVID-19 pandemic-related issues, including “Glow,” “The Society” and “I Am Not Okay With This.”\n\nThe company’s last price increase in Canada was announced in November 2018. At that time it bumped up the basic monthly plan by a dollar to $9.99, the standard by $3 to $13.99, and the premium by $3 to $16.99.\n\nThe basic plan lets subscribers watch on one screen at a time at a lower-quality resolution. The standard plan allows two screens with high-definition resolution. And the premium offers four-screen usage and ultra HD, 4K video.\n\n“Canadians have never had more choices when it comes to entertainment and we’re more committed than ever to delivering an experience that exceeds their expectations,” Netflix said in a statement about Thursday’s price increase.\n\n“Members tell us how much they value variety and we’re updating our prices so that we can continue to invest in more shows and films. As always we will continue to offer a range of plans so that people can pick a price that works for their budget.”\n\nNetflix launched in Canada in September 2010, charging $7.99 for unlimited TV shows and movies per month.\n\nREAD MORE: Netflix adds 16 million global subscribers partly during start of pandemic\n\nVictoria Ahearn, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nEntertainment",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-10-08 07:40:00-08:00",
    "title": "Netflix Canada increases prices for its monthly standard, premium plans – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/entertainment/netflix-canada-increases-prices-for-its-monthly-standard-premium-plans/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}