{
    "authors": [],
    "content": "Please join us in ensuring no one is forgotten this holiday season\n\nCOVID-19 has affected the Bulkley Valley just as it has all communities across B.C. and around the world.\n\nBritish Columbians continue to work hard to flatten the curve of the pandemic’s second and full vaccination is still some time away, but an end to this inconceivable time in our lives does grow closer.\n\nIsolation hits especially hard as the holidays come around. Among the most impacted groups is one of our most vulnerable – seniors. Some of them have not been able to see their loved ones for months, and with that isolation comes heartbreak, despair, or worse.\n\nThe Interior News extends a call to action. We would like to dedicate editorial space in upcoming issues at least until New Year’s Eve to personal messages or photos from family to seniors who are in isolation.\n\nMessages should be no more than 50 words and can be addressed to a specific person or people, or be general sentiments.\n\nPhotos should be in jpeg or tif format and accompanied by a description, including names of people in the photo and the name(s) of the person or people for whom it is intended.\n\nSubmit your messages and photos of love and care to editor@interior-news.com.\n\nThis holiday season especially, we want to ensure no one is forgotten. Please join us!\n\n– Thom Barker, Editor, The Interior News\n\n\n\neditor@interior-news.com\n\nLike us on Facebook and follow us on Twitter\n\nAgassizHarrison Hot Springs",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-04 17:10:00-08:00",
    "title": "Interior News seeks messages for isolated Bulkley Valley seniors – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/community/interior-news-seeks-messages-for-isolated-bulkley-valley-seniors/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}