{
    "authors": [
        "The Canadian Press"
    ],
    "content": "Menno Place is recruiting residents’ families because so many employees have been diagnosed with COVID-19\n\nLynne Smith and her dog Chester pose in this undated handout photo. Smith has applied for a job at a long-term care facility in Abbotsford, B.C., and says she’ll even clean toilets so she can see her husband. THE CANADIAN PRESS/HO, Lynne Smith *MANDATORY CREDIT*\n\nLynne Smith’s daily visits to a long-term care home ended abruptly after a COVID-19 outbreak three weeks ago but she jumped at the chance to work at the facility that is hiring family members so she can see her husband.\n\n“I felt so powerless and unhelpful. Laundry and being in dietary and being a housekeeper are not really my forte but I mean, I’ll do anything.” Smith said. “I’ll wash dishes, I’ll clean toilets.”\n\nSmith’s husband, Derrick Smith, 72, has been living at Menno Place in Abbotsford, B.C., since February 2018 after moving there from another facility following a stroke and brain surgery.\n\nMenno Place is recruiting residents’ families because so many employees have been diagnosed with COVID-19 in an outbreak that started on Nov. 17 after one resident became ill following treatment in hospital.\n\nSmith said she’d visited her husband daily with their dog, Chester, even as they were forced to see each other through a window when visits were limited.\n\n“I’ll do it for free. Just get me in there so I could help somebody,” said Smith, who had already been doing some of her husband’s laundry and cleaned his hearing aids and teeth.\n\nKaren Biggs, CEO of Menno Place, said 31 residents and 21 staff had become ill on a unit that is home to 45 people but the care home began putting together a plan to hire families after the first few infections to avoid a staffing crisis that has hit other facilities.\n\n“We’re getting very, very tight because staff are going off sick or they’re going off with pending swabs,” she said of those awaiting the results of COVID-19 tests.\n\nThe home’s director of human resources, the manager of housekeeping and laundry and the executive director of finance have come in on days off to work for staff who were sick or doing extra duties for patients confined to their rooms, Biggs said.\n\nMenno Place had been trying to hire staff for months, she said.\n\n“Because of the single-site order, it’s very, very hard to recruit people right now,” Biggs said of a policy by the provincial health officer for staff in care homes to work in only one facility to reduce the risk of COVID-19 spreading from place to place, as was the case earlier in the pandemic.\n\nBiggs said 54 applicants, including residents’ grandchildren, had responded to a request on the facility’s website to work in laundry service, delivering food trays to rooms and doing housekeeping duties because of enhanced cleaning requirements during the outbreak.\n\nTwo people have so far been hired to do housekeeping, including a former care aide who once worked at Menno Place and whose mother is a resident at the facility, Biggs said, adding families in Alberta whose loved ones also live there have inquired about whether they’d need to quarantine for two weeks before starting work.\n\nResidents’ families would get the same safety training offered to other employees around infection control and the use of personal protective equipment, she said.\n\nThe added bonus is those who work at the facility would get to see their loved one while cleaning their room, for example, but not having direct contact with them.\n\n“I’d clean spotless If my mother was on the unit,” Biggs said.\n\nREAD MORE: 32 family members respond to Abbotsford care home’s plea for staffing help during COVID-19 outbreak\n\nIsobel Mackenzie, the advocate for seniors in British Columbia, said Menno Place seems to be the first long-term care facility in Canada to hire families.\n\nThe important role of families who help with everything from feeding to helping care for their loved ones has been acknowledged during the pandemic, she said, adding getting to see people while working at a care home may be the only hope for those who have been forced to stay away.\n\n“I think Menno Place is showing a flexibility and ingenuity around how to get some extra hands in there quickly.”\n\nCamille Bains, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirus",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-10 08:40:00-08:00",
    "title": "Woman says she’d clean toilets to work at B.C. care home and see husband – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/woman-says-shed-clean-toilets-to-work-at-b-c-care-home-and-see-husband/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}