{
    "authors": [],
    "content": "The lakes and rivers haven’t frozen yet, but Lorraine Dorion has managed to walk on water. She is hunkering down in Prince George and has a fit bit strapped to her ankle to keep track of the miles she puts in, recording them daily and every month or so she puts them on a map picking out the nearest city.\n\nShe is travelling along the USA and Canada border walking her line even walking across lakes and rivers.She will adjust the mileage at the end to truly acknowledge that she walked across Canada.She is in Saskatchewan.\n\nWalnut Park Elementary School Grade 6 students with Leone MacDonald, as part of their curriculum, had to choose a project to learn something new and to be passionate about.\n\nPayton Ferguson and Brooke Richmond teamed together to learn service and to be a volunteer.We can support them as they support the community.Watch for food drives and kettles as they raise money for the Salvation Army.For an update watch this column next week.\n\nWe may have an upcoming star. Lily Alliston took up the challenge of the Passion Project. She is preforming as a ventriloquist this week for the school assembly and she has practiced every day.\n\nThe projects are fun and each student has chosen their own: build a skate park out of popscicle sticks, make tech decks (miniature skateboard), cursive writing, learn French, photography, robotics, build a model of Smithers buildings and learn to paint on canvas.\n\nOur last Remembrance Day had to have a new twist for the seniors at the Meadows. COVID-19 restrictions didn’t allow them to go to Muheim Elementary school as they had for the last four years.\n\nLiliana Pesce’s class in division five brainstormed.They would go to the Meadows. They had a lot of activities and surprises for their big buddies of the Buddy Program.\n\nThe Meadows seated residents in the dining room as students and staff from the school made a procession trek. Leading the way was one of the moms, Joanne Sear, on the bagpipes and after opening one small window to say hello and pass in gifts they started with a song.The class recited In Flanders Fields. They waved goodbye and the bagpipes played again.\n\nAs I turned the page on my calendar to December I had a feeling of excitement; the next time I turn the page it will be 2021.\n\nPlease call 250-847-4414 or 250-643-9749 or e-mail Sonja.lester.b.c@gmail.com if you have an item to contribute.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-03 01:30:00-08:00",
    "title": "Walnut Park Grade 6 students find their passions – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/walnut-park-grade-6-students-find-their-passions/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}