{
    "authors": [
        "Thom Barker"
    ],
    "content": "The other day, my mind took me down memory lane.\n\nWhen I first wrote about growing petunias from seed, it was very detailed, to say the least, but necessary.\n\nA few years ago, I had some hanging baskets, with trailing petunias. As you probably know, in order to keep them blooming, it is necessary to remove the nearly dead flowers, also referred to as deadheading. When doing this with one basket, located over the pea gravel in my parking area, I would just drop the dead flowers on the ground.\n\nI should properly add, I don’t like weeds growing there. The following spring, I noticed some green shoots just underneath were the hanging basket was the year before. So, getting into my “killer instinct” ready with my garden hoe. But with a closer look, I noticed, those were not regular weeds, but looked more like poetunia plants.\n\nSo, decided to wait and sure enough the petunia plants spread to a two feet diameter of flowers and was for me the show of year. Remember also, the seeds had been exposed to -20C most of the winter.\n\nPerhaps you have an experience you would like to share with your reader friends. You can send it to my email address. I will not reveal your name.\n\nI visited some friends the other day and admired their African violets in the window sill. Because the flowers were spent, I was asked, how one would get them to flower again, so I will let you know as well.\n\nBy the way, those plants can for sure help us to forget this present uncertainty, as they remind us better times will come.\n\nModerate to bright, indirect, indoor light, during the winter months, allow more sunlight.\n\nThin dark green leaves and leggy stems, too little light; light green or bleached leaves indicate too much.\n\nPrefer warm conditions 65°F / 18°C or warmer\n\nPinch off spent blossoms and blossom stems to encourage development of new blooms\n\nWater from the bottom with room temperature water.\n\nFertilize every two weeks with a high phosphorous plant food, but only during spring and summer.\n\nI went downstairs to examine my tuberous begonia. The tubers, have cured now for several weeks. I cleaned them up by removing most the garden soil sticking to them and stored them away in peat moss. These tubers will multiply after the second year of bloom.\n\nDon’t you think nature is confused, with this mild weather, are we coming or going? On my way into the house just now, I noticed some of buds on the lilac bush, had started to turn green. So, I said to the bush: “You better be careful, when the weather turns cold, or you will have your “buds” frozen off.”\n\nIt you have any questions or suggestions for topics, please email me: e.jacobsen85@yahoo.com.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-03 01:30:00-08:00",
    "title": "Some tips on African violets and more petunia stories – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/some-tips-on-african-violets-and-more-petunia-stories/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}