{
    "authors": [],
    "content": "How are doing with this world of sadness and anger? I think most of us are doing the best we can. I still find that negative thoughts go right along with events that show us the great struggles of many.\n\nFor instance, just the other day I looked at a scene of long lines of people waiting for food from a food bank. Another scene showed a group of church members giving three meals to many who would not have had a Thanksgiving meal. These pictures came to me from the USA. Breaks my heart.\n\nI was brought back to reality when I was shopping at No Frills. A young man was going through the 50 per cent off rack of vegetables and fruit. He told me he had lost his job and was now looking after his family the best way he could. He selected yellow peppers, carrots, broccoli and onions from the display area of food.\n\nHe then went to where the fruit was. This time he chose a couple bags of bananas and some slightly bruised apples. He told me with his selection he could make soup or Chinese food. The bananas he would freeze and then make a banana cake.\n\nAs we spoke he noticed bread at the 50 per cent off range. Perfect, he said.\n\nWith all the negativity we see and hear it set me up for the rest of the day to talk to this young dad who was so thankful for the reduced prices on food.\n\n“Wouldn’t make it without this.” Did we complain about the mask law? No. Did we say the whole COVID-19 issue is a hoax? No. Did he try on a few conspiracy theories I could ingest and allow to fester to make my mood change. Absolutely not.\n\nI hope all our stores have a place for marked down food items for those in need. If you do, good for you. To, No Frills, thanks for this bit of help. Always ask where you shop if they have any reduced price food.\n\nI know there are many stories about families with their struggles. If you are having your troubles and need help check with the Salvation Army or find some good clothes at New to You.\n\nCheck around the valley and I am sure you will find help. It’s a small town and we are all connected in some way. Help might be right around the corner.\n\nOne little added note is for those who wear hearing aids. Watch when you remove your mask that you don’t hook onto your hearing aid. Heard a couple stories where hearing aids were lost this way.\n\nGood luck to all of you . Be well and mind your way.\n\nCall 250-846-5095 or email a note to mallory@bulkley.net",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-03 01:30:00-08:00",
    "title": "Young dad grateful and positive despite hardship – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/young-dad-grateful-and-positive-despite-hardship/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}