{
    "authors": [
        "Rod Link",
        "Local News"
    ],
    "content": "New devices to help local firefighters extract people as needed when responding to motor vehicle or other incidents on area roads should be in the offing thanks to a provincial grant program released Dec. 1.\n\nEligible fire departments can apply for up to $50,000 for equipment and/or training from the $1 million road rescue program.\n\n“Road rescue is part of the services we offer,” explained Houston Volunteer Fire Department chief Jim Daigneault in indicating the department’s wish to update its extraction equipment.\n\n“Because we are an all-volunteer department the costs to cover this service are minimal, just some fuel and when we are dispatched out for a call we request a task number from Emergency Measures B.C.,” he said.\n\nThat enables the department to offset any costs associated with the call.\n\nThe department’s road rescue service covers a large portion of the area, from Wakefield Road west of Houston to the top of the Six Mile Summit although Topley fire department volunteers may also respond to Six Mile, said Daigneault.\n\nAnd Houston’s volunteers will also cover past Granisle and south past Morice Lake.\n\nHighway rescue services within local areas are generally financed through local taxes with the province helping to offset response costs through Emergency Measures B.C. and by providing coverage through WorkSafe B.C.\n\nThe province also said it will continue to work with fire chiefs around the province to increase the amount of money dedicated to road rescue.\n\nIn recent years the province also increased the amount of money being provide to local search and rescue groups which, like smaller fire departments in smaller and more rural communities, are made up of volunteers.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-09 01:30:00-08:00",
    "title": "New road rescue equipment requested – Houston Today",
    "url": [
        "https://www.houston-today.com/news/new-road-rescue-equipment-requested/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}