{
    "authors": [
        "Marisca Bakker"
    ],
    "content": "Cancelled Santa’s Breakfast usually a big help to fill the shelves, Sally Ann looks to other events\n\nKelly Spurway hands out bag lunches on Main Street in Smithers out of the Salvation Army’s mobile community service unit earlier this year. (Thom Barker photo)\n\nThe 21st annual Santa’s Breakfast was cancelled amid COVID- 19 health concerns, leaving the recipient of the charity event scrambling.\n\nThe event is always held at the Prestige Hudson Bay Lodge in Smithers and people stop in for a breakfast, see Santa, listen to local music and make a donation of food or money to The Bulkley Valley Salvation Army.\n\nLast year, almost 10,000 pounds of food was donated to the food bank.\n\nCommunity family services coordinator for the Bulkley Valley Kelly Spurway said it helps them through the winter months.\n\nShe added demand for their services has gone up since the pandemic hit earlier this year by about 34 per cent. That percentage doesn’t include the increase they’ve seen for their kids lunch program.\n\nThey have also been delivering more food hampers to Witset lately.\n\nHowever, this year another event that brings in donations will be expanded to hopefully help fill some of the need.\n\n“We are very lucky this year, the first responders have partnered with us for Stuff the Truck. So now there will be Stuff the Truck at all three grocery stores instead of one,” said Spurway. “We are hoping with that we will bring in more food than normal to help replace the food that we would normally receive during Santa’s breakfast. We know it won’t be the same amount but every little bit helps.”\n\nShe knows it won’t be the same but nothing has really been the same since the coronavirus crept into the country.\n\n“Seeing the local musicians like the fiddlers, and Sweet Harmony at the breakfast will be missed,” she added. “Just getting together to see each other and celebrate, it was a pretty hard decision. [to cancel]”\n\nStuff the Truck will take place outside of Safeway, No Frills and BV Wholesale on Dec. 11 from 10 a.m. to 6 p.m.\n\nThere is a wish list for their top 15 in demand items at the food bank.\n\n“A lot of people like donating produce at Christmas time but we are asking people to donate a gift card instead so we can buy as we need,” added Spurway.\n\n“We are trying to provide lunch meat, bread, apples in our kids hamper program every week, instead of delivering the lunches to the school daily. So the kids are making their own lunches at home now. We are so busy right now, we can’t physically do it, we’d be at work 12 hours a day and it has a lot to do with COVID, not trying to touch the kids food.”\n\nThe Salvation Army’s Kettle Campaign is also in full swing.\n\n“Living in the Bulkley Valley is the most generous community I’ve lived in,” she said. “When we think we are going to run out of everything, we suddenly have a bountiful of what we need. That is this community. If you saw you need something, we end up with it. I thank everyone for that.”",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-03 06:30:00-08:00",
    "title": "Christmas food donations threatened as demand soars – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/community/christmas-food-donations-threatened-as-demand-soars/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}