{
    "authors": [
        "Katya Slepian",
        "Canada"
    ],
    "content": "A nurse prepares to administer the Pfizer-BioNTech COVID-19 vaccine at Guy’s Hospital in London, Tuesday, Dec. 8, 2020. U.K. health authorities rolled out the first doses of a widely tested and independently reviewed COVID-19 vaccine Tuesday, starting a global immunization program that is expected to gain momentum as more serums win approval. (AP Photo/Frank Augstein, Pool)\n\nThe news of Canada approving the Pfizer COVID-19 vaccine came with a sigh of relief for many, a glimmer of hope in a nearly year-long pandemic that has left more than 13,000 dead across the country.\n\nPeople in the U.K. have already begun to get inoculated with the vaccine, which Pfizer said is 95 per cent effective after two doses, given three weeks apart.\n\nBut as Health Canada chief medical adviser Dr. Supriya Sharma said, “even the best vaccine is only effective if people trust it and take it.”\n\nHeidi Tworek, an associate professor at the University of B.C. School of Public Policy and Global Affairs, agreed, but said the work needs to start now.\n\n“If officials are in the position of trying to combat weird information that’s floating around, you’re already in a losing position,” Tworek.\n\n“What you really want to be doing is setting your own frame of what this vaccine is doing. It does require a substantial communication effort that goes beyond press conferences.”\n\nREAD MORE: Health Canada authorizes use of Pfizer-BioNTech COVID-19 vaccine\n\nWhat’s key, Tworek said, is not to dismiss concerns outright and to try and engage people on an individual level, whether they are newly concerned or long-time skeptics. It’s also important to keep in mind, she noted, that typical anti-vaccine groups are usually filled with parents, since most vaccines are targeted at children. The COVID vaccines, however, will be targeted at adults for a long time before they may become available to kids.\n\n“We find that people have many, many reasons [to be skeptical of vaccines]. They have half-heard something, they’re worried because of other vaccines, they themselves have had an adverse reaction to a vaccine. It can really span the whole gamut.”\n\nREAD MORE: UK probing if allergic reactions linked to Pfizer vaccine\n\nThere are also many in Canada, especially Indigenous and racialized Canadians, who are worried about how they are treated by the health care system as a whole.\n\n“[This is] a group of people who have really legitimate concerns based on tragically recent experiences that causes them to be very skeptical,” Tworek said. She added that apologies and investigations into cases like the death of Joyce Echaquan in a Quebec hospital, and allegations of a blood alcohol guess game at a B.C. hospital, can help show that authorities are taking racism in health care seriously.\n\n“People can feel that there are actually steps forward, you have an acknowledgement of what has been their lived experience and there is a commitment to change.”\n\nIt’s also important to learn from the introduction of masks and other COVID measures, which have faced some opposition. Tworek said there’s lesson to take away from more successful jurisdictions.\n\n“The most effective places from the very beginning used social media… they tried to meet people where they were by being on as many channels as possible,” she said. “In New Zealand, [Prime Minister] Jacinda Ardern would do ‘Conversations through COVID’ where she would invite guests from a wide variety of professions and interests to talk to her about COVID, so it was a two-way conversation.”\n\nVisuals or graphics, rather than science-heavy language, can make information more accessible to people who “really have never needed to know about these scientific processes but might want that kind of information in ways that might make sense to them.”\n\nCommon worries about vaccines, and how to dispel them:\n\n1. Watching science happen in real time\n\nOne part of the conversation she feels hasn’t been handle well is explaining to the public how science works in real time. Tworek dubbed this the “science meta narrative, which is that when you tell people your advice, [you’re] also explaining to them how it was arrived at and what they might expect.”\n\nIn B.C. and Canada, shifting recommendations, sometimes delayed or without notice or explanation, led to confusion. Changing guidelines, Tworek said, should have been positioned as a sign of strength as the scientific community learned more about what was a new diseases.\n\n2. How quickly vaccines were approved\n\n“Help people understand why was it so quick,” Tworek said, whether it’s explaining that vaccine phases that usually run one after the other were done at the same time for COVID vaccines, or that manufacturing was done the same time as the clinical trial, instead of afterwards.\n\n3. Adverse reactions\n\nExplaining, rather than brushing off, adverse reactions to vaccines is more helpful. Tworek said that people can be rightfully worried about allergic reactions, especially serious ones, but it’s important to put it into context.\n\n“When you vaccine 35 million people, what is a 0.00001 per cent? It’s people, it’s humans. So you need to figure out how to convey the risks around that,” she said. A helpful comparison can be allergies to other things, whether medicines like penicillin or foods like nuts.\n\n4. Be kind, don’t ridicule\n\nWhile it may be easy to make assumptions, Tworek said it’s important to listen and address concerns seriously.\n\n“Try to respond to them… with empathy, so you don’t end up unintentionally hardening people’s hesitancy into an anti-vaxx stance,” she said.\n\n5. Start before vaccines are widely available\n\n“We should have started working some time ago, but we really need to start working to make sure that people understand if there are any risks, and we try to address vaccine hesitancy now, even though it will be months before many of those people would be eligible to get a vaccine,” Tworek said. The last thing health officials will want is vaccines sitting in storage while they try to figure out how to get people to take them.\n\nREAD MORE: ‘Route out’ of pandemic: 90-year-old woman receives UK’s 1st COVID-19 vaccine dose\n\n@katslepian\n\nkatya.slepian@bpdigital.ca\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirusvaccines",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-11 05:30:00-08:00",
    "title": "‘Respond with empathy’: B.C. expert breaks down COVID vaccine myths, reasons for hesitancy – Houston Today",
    "url": [
        "https://www.houston-today.com/news/respond-with-empathy-b-c-expert-breaks-down-covid-vaccine-myths-reasons-for-hesitancy/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}