{
    "authors": [],
    "content": "Construction at the Kitimat Meter Station is nearing completion with the final weld of the meter station’s piping completed in November.\n\nThe end of the Coastal GasLink pipeline is marked by the Kitimat Meter Station, a facility that will measure natural gas to be delivered to the LNG Canada plant, and at the end of 2020, construction of this facility will be mostly complete.\n\n“The Wilde Lake Compressor station has been compared as the ‘beating heart’ for Coastal GasLink. If that’s the case, then the Kitimat Meter Station takes the pulse,” joked Matthew Shanks, project manager for the metering station.\n\nWhile Wilde Lake facility construction is just beginning, Kitimat Meter Station construction is nearly complete.\n\n“We began construction in June working with our prime contractor, Aecon. Over the past five months, we’ve worked through a lot of wet weather, held a groundbreaking ceremony in August, and made significant construction progress. In fact, we’ve now completed five of the seven stages of facility construction, finishing with pipe installation,” said Shanks.\n\nThe work was completed with no reportable safety incidents over 36,000 person-hours and an excess of 61,000 km, and in accordance with robust health and safety measures based on Dr. Bonnie Henry’s guidance.\n\n“A big highlight was the final weld on the meter station piping performed near the end of November. With that complete, we will now take a pause on construction activities on the facility until we return for pressure testing the pipe, scheduled for the second quarter of 2021. In the meantime, we will construct the powerline infrastructure for the station,” added Shanks.\n\nCoastal GasLink is proud to be building more than just infrastructure. Our workers are committed to protecting the environment and supporting local communities as we progress the project.\n\nOver the course of construction, significant effort was made to protect the environment, including relocating approximately 40,000 tadpoles locally for safe maturing.\n\nAdditionally, the team formed relationships with the District of Kitimat community, participating in volunteer activities such as a river clean-up. The team also raised money for the Kitimat Food Bank and the Tamitik Status of Women organization, which was matched by TC Energy as well as Aecon Group for a $12,400 donation, divided equally between the two groups.\n\nFor M.J. Zimmerman, construction manager at the Kitimat Meter Station, the legacy of safety and quality Coastal GasLink is leaving behind is one that he is really proud of.\n\nThis commitment is part of our extraordinary legacy in action. As M.J. Zimmerman, construction manager at the Kitimat Meter Station, put it, “the legacy, the initiatives that Coastal GasLink is putting forward, it’s about doing things safe with quality, and being really proud of it when you’re done.” He added that it’s, “something you can talk about with your friends and colleagues, that we did it right.”\n\nSign up today for construction updates at CoastalGasLink.com/construction-updates.\n\nenergy sector",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-07 06:00:00-08:00",
    "title": "Coastal GasLink meter station nears completion in Kitimat – Houston Today",
    "url": [
        "https://www.houston-today.com/marketplace/coastal-gaslink-meter-station-nears-completion-in-kitimat/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}