{
    "authors": [
        "Aman Parhar"
    ],
    "content": "Low lumber prices and the high cost of fibre are the cause of curtailment, according to the company\n\nCanfor has announced it will be temporarily closing down operations at almost all of its B.C. dimension mills.\n\nThe company said in a news release Wednesday, it will be shutting down operations for one week starting April 29. WynnWood mill outside of Creston will be the only facility of 13 to remain open.\n\nCanfor cited low lumber prices and the high cost of fibre for the cause in having to curtail operations, which will impact 2,000 hourly employees.\n\n“We regret the impact the curtailments will have on our employees, their families and their communities. We appreciate the hard work of our employees and contractors across all our operations,” said Michelle Ward, director of corporate communications.\n\nShe said two other mills in Mackenzie and Isle Pierre will be down for a second week in May.\n\nThis is the fourth curtailment that has been announced by Canfor since November of last year.\n\nREAD MORE: Canfor curtailing sawmill operations in B.C.\n\nREAD MORE: Canfor adds to mill curtailments with brief B.C. Interior shutdowns\n\nLocal 1-2017 President Brian O’Rourke said the union doesn’t feel good about the news.\n\n“We heard today that they are going to be curtailing all their operations in B.C. and they are citing low lumber prices and high logging costs. They will be curtailing for one week,” he said.\n\nHe added that previous curtailments by Canfor in December were all due to fibre and lumber costs, as well. However, the union has no control over temporary shutdowns.\n\n“We are hoping it will only be short term, a one week thing, and hopefully things will pick up and run as they did normally,” O’Rourke said.\n\nMeanwhile, UNBC economist Dr. Paul Bowles said the scale of the shutdown is unexpected, however, there were signs that something along these lines would continue to happen.\n\n“The price of lumber has fallen by 40 per cent from a year ago, so with weakening demand, big companies are worried about how many losses they are able to sustain in the short run,” he said.\n\nBowles explained that the point of the curtailment is to bring companies back into profitability by getting the price to go up and taking out some supply from the market.\n\n“Which would eventually be felt by consumers as well,” he said.\n\n“It is going to mean that workers, their income is going to be reduced and interrupted because of this. So that is going to have an impact on the provincial economy but especially in those communities such as Vanderhoof, that are heavily reliant on the lumber industry. It is going to mean less demand there and less activity in the services in the community,” Bowles added.\n\nDr. Kathy Lewis, Chair of Ecosystem Science and Management and a forestry professor at UNBC, said she doesn’t find the curtailment surprising.\n\n“We have known for quite a long time that there was going to be a short fall in timber supply, so this was no surprise at all. But it is a short, middle-term problem,” she said.\n\nLewis said in the long run, the industry is going to be strong.\n\n“In fact the industry itself is working to change what they are doing to make better use of wood that is available. So I think the long term prognosis is pretty good, but there will be some short-term problems,” she added.\n\nIn terms of timber supply, Lewis said forests are a renewable resource which leads to a fairly good picture for the industry in the long term. However, if various disturbances are added to climate change, it brings more elements of uncertainty.\n\n“So there will always be uncertainty around timber supply and so the industry has to adapt to that and they have been,” Lewis added.\n\n“We have major mills that have been making dimensional lumber, but they are also engaged in making other products from the forest such as pellets and chemicals and different kinds of solid wood products and so on, that allow them to make more of the trees that they cut,” she said.\n\nCanfor Corporation has 13 sawmills in Canada with the total annual capacity of approximately 3.8 billion board fleet.\n\nWith files from Blair McBride\n\nAman Parhar\n\nEditor, Vanderhoof Omineca Express\n\n\n\naman.parhar@ominecaexpress.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2019-04-24 17:14:00-08:00",
    "title": "Canfor temporarily shutting down lumber mills across B.C. – Houston Today",
    "url": [
        "https://www.houston-today.com/news/canfor-curtailing-operations-across-b-c/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}