{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "Donnelly has been performing for NHL club since 2001\n\nMark Donnelly, who has been the anthem singer for the Vancouver Canucks NHL hockey team since 2001, performs O Canada at a protest against measures taken by public health authorities to curb the spread of COVID-19, in Vancouver, B.C., Saturday, Dec. 5, 2020. THE CANADIAN PRESS/Darryl Dyck\n\nThe popular singer of O Canada at the Vancouver Canucks hockey games says he knew he might lose his job for standing up against what he describes as the “tyranny” of COVID-19 restrictions.\n\nMark Donnelly sang the anthem at an event called the Christmas Freedom Rally in Vancouver on Saturday, where hundreds of people protested restrictions imposed by B.C.’s provincial health officer.\n\nVancouver Canucks owner Francesco Aquilini tweeted late Friday that Donnelly was now the former Canucks anthem singer, followed by the hashtag #wearamask.\n\nDonnelly told the crowd, many of whom weren’t wearing masks or social distancing, that he decided to sing because he questions the “draconian lockdown protocols.”\n\n“What was originally sold as 15-day hunkering down sprint for the common good has turned into a 10-month marathon from hell, where the finish line is constantly being moved further into the distance,” he said.\n\nHe said he doesn’t think health officials have done a cost-benefit analysis looking at the harms of the restrictions compared with preventing the spread of COVID-19.\n\n“As someone known for singing our great national anthem, I’m standing up against what I feel is tyranny, plain and simple,” he said to applause and cheers from the crowd.\n\nDonnelly said his firing is censorship by an institution that he’s followed for 50 years and been publicly associated with since 2001.\n\n“Sports figures, entertainers, politicians, et cetera, can stand for anything as long as it supports the narrative. You can support rioting, looting, destructions of livelihoods and reputation, but take a position against the narrative and you are worthy of exile or worse.”\n\nDonnelly said he hasn’t had direct contact with Aquilini or the Canucks and if he is no longer with the team, a phone call would have been a more respectful way to find out his reasons for taking part in the rally.\n\nHe had hoped the ownership and management of the Canucks would have had the “courage to support the freedom to express science-based position that is for the greater good of the country,” he said.\n\nNo one from the Canucks responded to a request for comment.\n\nThe protesters then took to the streets in a march.\n\nVancouver police spokeswoman Tania Visintin said police need to exercise discretion with large groups of protesters violating public health orders, saying public safety is the priority.\n\nShe said mass arrests or ticketing could escalate an already tense situation.\n\n“This position does not automatically guarantee anyone special privileges at a protest. The bottom line is people who are contravening the public health order, they could be issued a ticket. Officers are using discretion with each situation that arises.”\n\nB.C. health officer Dr. Bonnie Henry said last month that she has “no time for people who believe that wearing a mask somehow makes them ill or is a sign of lack of freedom.”\n\nInstead, she said wearing a mask is about respect for those who suffering through the pandemic together.\n\n—with files from News 1130.\n\nThe Canadian Press\n\nREAD MORE: Canucks unveil redesigned jersey as part of NHL’s ‘Reverse Retro’ collection\n\nLike us on Facebook and follow us on Twitter\n\nCanucksCoronavirusvideo",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-04 21:30:00-08:00",
    "title": "Vancouver Canucks owner cuts ties with anthem singer who planned to sing at COVID protest – Houston Today",
    "url": [
        "https://www.houston-today.com/sports/vancouver-canucks-owner-cuts-ties-with-anthem-singer-who-planned-to-sing-at-covid-protest/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}