{
    "authors": [
        "Trending Now"
    ],
    "content": "A group of Can-iwis – Rose, Jen and Mel – report from the other side of the world\n\nWhether a Canuck in Canada or a Kiwi in New Zealand, the emotional impact of living through COVID-19 lockdown has been universal. A group of Can-iwis – Rose, Jen and Mel – report from the other side of the world.\n\nDuring COVID lockdown, Rose Mirza’s mother died in Montreal of cancer. No one from her family could go to the funeral.\n\nRose was 15,209 km away, in Albert Town, New Zealand, where she has lived for years, raising her two children.\n\nPre-COVID, Rose had booked flights to visit her mum, but was delayed because of an issue with passports for her children. Just as that was resolved, COVID struck.\n\n“It was horrible. My mum died July 8. She had lung cancer and I hadn’t seen her in two years. It sucks. My dad is in a home in Canada and my brother is in the States, and he couldn’t cross the border. My dad has dementia, so he didn’t know what was going on.”\n\nHer grief is still raw, knowing her mother died unsupported by close family. Seven months since COVID -19 claimed the life of its first Canadian victim – an elderly British Columbian rest home resident – more than 10,000 Canadian families have had similar experiences, unable to properly participate in grief by honouring a loved one with a get-together and ceremonial farewell.\n\nGathered together, this is the first time Rose’s friends have heard her story.\n\n“She was in hospital and luckily she had a retired friend who had been running a nursing home … And my mum called her and asked, ‘Can you take care of me?’ That was the only way she was able to get out of hospital. She lasted 45 days in her house.”\n\nThe tale is told. There are hugs from Canadian neighbours Jen and Mel. Soon the chat is flowing again, assisted by a glass of wine, a toast to mothers and laughter at the antics of Rose’s young daughter cartwheeling around the lounge, dressed in a long cape.\n\nStaying apart, keeping in touch\n\nNo matter where you were in March or April, the fear of being alone was just the same.\n\nWhile the Can-iwis kept in touch with family over phones or laptops, actual experiences ended up being worlds apart.\n\nMidwife Jen is from British Columbia and has lived with her Kiwi fishing guide husband Calum and their children in Albert Town for eight years.\n\nDuring lockdown, Jen was one of the few people allowed out as an essential worker.\n\n“The babies kept coming. They didn’t get the note.”\n\nShe had to get a “midwife on call” sticker for her car to protect her from complaints she was breaking lockdown protocols.\n\nMeanwhile, her husband was on “on holiday” at home with the kids.\n\nFormer hospitality worker Mel Morden, of Atikokan, Ontario, has lived in Albert Town with her Kiwi husband Craig for more than 10 years. They have two young sons.\n\nShe lost her job during COVID lockdown. Hospitality businesses weren’t allowed to open, and New Zealand’s border closures and loss of international visitors forced business restructuring once restrictions lifted. Mel has since found work with a hardware chain.\n\nShe and her family enjoy fishing in the Clutha River, playing with hula hoops on the law, and dropping in unannounced on neighbours and friends.\n\n“Once we got out of level four and were able to meet more people outside the family bubble, I noticed Carter (aged four) wanted to cuddle the people we were meeting, and was confused about whether he was allowed to.\n\n“It didn’t occur to me, how much he had missed human contact. He would be in tears. He wanted to cuddle the girls who worked at the local recycling centre and he wasn’t allowed.\n\n“Poor Carter. I told him when we got to level one, he could go for it.”\n\nAs a nation, the country is still locking out the rest of the world, unless you have a Kiwi passport, are an essential worker or need to enter for medical reasons.\n\nThe ministry of health says border controls will not be relaxed until a successful mass immunization program has been completed.\n\nStrict quarantine requirements, plus Canada heading into another period of lockdown, doesn’t inspire the Can-iwis into booking tickets home anytime soon, because no one wants to spend 14 days in a hotel room when they get back to New Zealand.\n\nJen believes the New Zealand borders may not open until 2022.\n\nGo hard, go early, get lucky\n\nWhen New Zealand’s Prime Minister Jacinda Ardern decided in March to “go hard and go early” into lockdown, the Can-iwis heard some criticism from folks back home.\n\nJen’s dad told her New Zealand was being ridiculous, and that the Kiwis were going to kill their economy.\n\n“Everyone had a thought about whether New Zealand was doing it right or wrong and so there were funny conversations at home.”\n\nMel Morden and Jen. (Submitted to Black Press Media)\n\nNow, as New Zealand has resumed a near normal life and Canada remains in quasi-lockdown, the Can-iwis find it hard to watch their loved ones continue to suffer.\n\nThe Kiwis have been moving freely since June (early October for Auckland, New Zealand’s largest city).\n\nJen feels awkward telling her parents she just went to an event or her kid’s games.\n\n“So I have just quit talking about what we are doing down here. I just send them funny videos, just some entertainment.”\n\nMel noticed that despite being able to call, there is a disconnect in terms of truly understanding each others’ experiences, and the emotional impact of words.\n\nHer mother kept reminding Mel’s kids to wear masks, even though they are not being deemed necessary in New Zealand. In Albert Town (population about 2,500), there’s been life without masks in public since April – unless you still want to wear one.\n\nThat caused confusion for young Carter, who worried about whether his New Zealand and Canadian families were safe.\n\n“We had to have a whole lot of chat about what she could say to Carter. It makes it harder to understand when they can’t leave home without a mask. Equally, it was hard for me to listen to their stories because I didn’t get what they were going through either.”\n\nIn New Zealand, there is just one source of official information about COVID-19: the colloquially named “Jacinda and Ashley Show.”\n\nEvery day during lockdown level four, the prime minister and the Director-General of Health, Ashley Bloomfield, stood before the nation and explained what was happening.\n\nIn comparison, Canada had a variety of responses, depending on the province you lived in. That made it confusing for Can-iwis trying to find out how Canada was faring.\n\n“In Canada, there were provinces doing their own thing and their prime minister wasn’t giving a talk every night. Here, we all tuned in and some of us now have a crush on Jacinda!” Calum said.\n\nThe Can-iwis definitely feel New Zealand is a “lucky” country. Mel wasn’t prepared for how patriotic she would feel for her adopted home.\n\n“It never occurred to me. It was my parents kept saying it to me. New Zealand is doing it right. You are pretty lucky. And we were, yeah! Maybe we are.”\n\nEventually, New Zealand’s flow of COVID information became overwhelming. Mel stopped following the bulletins.\n\n“I don’t want to bury my head about what I should do. But I can’t keep burdening myself with the rest of the world when I have two young kids. I am in a happy place. Why put myself in a dark place?”\n\nDespite their freedoms in New Zealand, none of the Can-iwi families feel out of the woods with COVID.\n\n“Until the borders reopen, we are all dreaming of when we can unite again.”\n\nStory by Nathan Weathington\n\n1964\n\nmountain culture / new zealand aotearoa",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-08 20:30:00-08:00",
    "title": "Canadians in New Zealand reflect on the global COVID-19 pandemic – Houston Today",
    "url": [
        "https://www.houston-today.com/trending-now/canadians-in-new-zealand-reflect-on-the-global-covid-19-pandemic/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}