{
    "authors": [
        "Associated Press",
        "Trending Now"
    ],
    "content": "FILE - Olivia Jade Giannulli arrives at the 5th annual People Magazine “Ones To Watch” party in Los Angeles on Oct. 4, 2017. Giannulli, the daughter of the “Full House” actor Lori Loughlin and fashion designer Mossimo Giannulli, discussed on the Facebook Watch series “Red Table Talk” how she’s been affected by the college admissions scandal involving her parents. (Photo by Richard Shotwell/Invision/AP, File)\n\nMaybe Olivia Jade Giannulli had hoped for kid-glove treatment in choosing the family vibe of “Red Table Talk” for her first public comments about the college admissions scandal involving her famous parents.\n\nIf so, she was quickly enlightened during Tuesday’s episode of the Facebook Watch series.\n\n“What were some of the repercussions throughout this whole situation?” asked a skeptical Adrienne Banfield Norris, mom of series host Jada Pinkett Smith. “Because you’re a beautiful young white woman who’s been born into privilege, and there would be some people that would feel like, she’ll be fine. I feel that way.”\n\nGiannulli, 21, who admitted to nerves but said she considered the show a safe and open space, denied that she was seeking sympathy. Her parents, “Full House” actor Lori Loughlin and fashion designer Mossimo Giannulli, are behind bars after pleading guilty to paying a half-million dollars to get Olivia Jade and sister Isabella, 22, into the University of Southern California as crew recruits, though neither were rowers.\n\n“I’m not trying to victimize myself. I don’t want pity. I don’t deserve pity,” Giannulli replied to Norris. “We messed up. I just want a second chance to be like, ‘I recognize I messed up.’ And for so long I wasn’t able to talk about this because of the legalities behind it.\n\n“I never got to say I’m really sorry that this happened, or I really own that this was a big mess-up on everybody’s part. But I think everybody feels that way in my family right now,” said the onetime social influencer, who lost deals with prominent brands and left USC in the scandal’s aftermath.\n\n“What’s so important to me is … to learn from the mistake, not to be shamed and punished and never given a second chance,” said an earnest Giannulli, dressed in a bright pink pantsuit.\n\nShe’s said trying to overcome her sheltered perspective and find a way to contribute.\n\n“I understand that I, just based off my skin colour, I already had my foot in the door and I was already ahead of everybody else. … I can recognize that going forward. I do want to do stuff to change that and to help that,” she said, adding that had worked with children in an afterschool program in the Watts section of Los Angeles recently.\n\nPinkett Smith, who said she had agreed to bring Giannulli on her show over her mother’s objections, struck an understanding tone with her. So did Pinkett Smith’s daughter, Willow, also part of the series.\n\nGiannulli was asked about seeing both parents incarcerated.\n\n“No matter what the situation is, you don’t want to see your parents go to prison…. But also, I think it’s necessary for us to move on and move forward,” she said. She hasn’t been in touch with either of them since they entered prison, which she said may have to do with COVID-19 quarantine restrictions.\n\nLoughlin began serving her two-month sentence in a federal prison in California on Oct. 30, while her husband’s five-month term, also in the state, began Nov. 19. Plea deals also called for fines and community service for the pair.\n\nThey were among some 30 prominent people, including actor Felicity Huffman, to plead guilty in the case federal prosecutors dubbed Operation Varsity Blues. It uncovered hefty bribes to get kids into elite colleges with rigged test scores or fake athletic credentials.\n\nLynn Elber, The Associated Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\ncollege admission scandal",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-08 18:00:00-08:00",
    "title": "Lori Loughlin’s daughter, Oliva Jade Giannulli, speaks out for 1st time about college scandal – Houston Today",
    "url": [
        "https://www.houston-today.com/trending-now/lori-loughlins-daughter-oliva-jade-giannulli-speaks-out-for-1st-time-about-college-scandal/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}