{
    "authors": [
        "Priyanka Ketkar"
    ],
    "content": "Juno and Umbrella Academy fame Canadian actor Elliot Page, revealed through a social media post last week that he is a transgender person.\n\n“I am trans, my pronouns are he/they and my name is Elliot. I feel lucky to be writing this. To be here. To have arrived at this place in my life,” said Page in the post that talked about his joy but also his fears around invasiveness, the hate, the jokes and the violence that is attached to his coming out.\n\nWhy should a person be made to feel afraid of coming out and accepting or sharing who he really is? Why should anyone else decide what you identify with? Just because you look a certain way, and fit the box of a particular gender, doesn’t mean you feel that way or are that way.\n\nSounds simple enough in theory, but is not so in reality. In reality, it turns out that coming out and accepting or expecting others to accept who you are is extremely difficult, if not impossible.\n\nIn Canada, it wasn’t until 1996 that “sexual orientation” as a category was added to the Canadian Human Rights Act and not until Bill C-16, some two decades later in 2017 that trans and non-binary folks were included in the Canadian Human Rights Act.\n\nBut there is still a long way to go.\n\nA lot of people these days have started adding pronouns they identify with in their information on social media, in email signatures, etc. It seems unnecessary, but it is really not.\n\nIf someone doesn’t fit in the box we created, we don’t need to try and fit them in or completely cancel them out. We just need to let them choose their own shape. So what if someone is different or has ideologies different from what we believe in, we are all still human beings and apparently beings who have the power of “choice”. Then why point fingers or call names when someone chooses to exercise their power of choice?\n\nAnd, how can we be a better ally to people different from us?\n\nBe it a person from a different country, language, culture or gender, give them an opportunity to introduce themselves the way they want instead of deciding for them. No matter who you think they are, let them tell you what pronouns they prefer to use and if you don’t know, ask. It is also no one’s business as to a person’s sexuality, surgical status or sex life.\n\nAnd don’t hide under the garb of ignorance. Learn. Learn the new and evolving concepts, learn the new ways in which people are identifying themselves, learn about the different cultures and places and names.\n\nMost importantly, remember that we are all humans and are splendidly imperfect. So making mistakes, being aware of those mistakes and learning from those mistakes is the only correct way to move towards perfection. Just be respectful of the choices made by those around you and you will have one half the battle towards being better allies.\n\nPriyanka Ketkar\n\nMultimedia journalist\n\n@PriyankaKetkar\n\n\n\npriyanka.ketkar@ldnews.net\n\nLike us on Facebook and follows us on Twitter.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-09 01:30:00-08:00",
    "title": "Being better allies to those different from us – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/being-better-allies-to-those-different-from-us/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}