{
    "authors": [],
    "content": "Valaura Jones\n\nQuick facts:\n\nDesign time: 7 months\n\nBuild time: 24 months\n\nSquare feet: 5,000\n\nBedrooms: 3\n\nBathrooms: 4\n\nNotable features:\n\nRaw steel staircase, concrete panel wall with Bocci lights, dog spa, guest suite with living room and wet bar, custom headboard, three-sided gas fireplace.\n\nFew people could stand on a former gravel lot site and declare that the rough, bare land is an ideal location to build a dream home. The land may border some of Kelowna’s most beloved agri-tourism businesses, but a defunct gravel yard still has the bleak feeling of a dog run. Then again, not many people are building a minimalist dream home designed for wolves.\n\nPhilanthropist, runner and lawyer Christy Lovig and her firefighting husband Trent have always wanted to build a home, but finding the perfect property was proving difficult. Through her office, Christy learned that an industrial site in Southeast Kelowna was being subdivided. The property would need a lot of work, but it boasted lake views and three acres of land. It seemed perfect for Trent’s farming endeavours and would provide room for the couple’s timber wolf-husky cross dogs to roam.\n\n“The dogs are present in so much of the design,” explains Christy. “As we were in this process, we lost my old girl, Kona. The master bedroom in our old house was on the second floor, and in her later years, we had to carry her up and down the stairs. That experience inspired the main-floor living in this house.”\n\nWith help from the Begrand Fast Design team’s talents, the canine-friendly touches don’t stop at the floor plan. The heated concrete floors stay cool in the summer and warm in the winter while remaining perfectly suited to muddy paws and the wear and tear of claws. Located off of the kitchen, the dogs have a sort of dedicated dining room of their own, with careful thought going into the placement of their dishes. An electronic dog door grants the furry family members access to their own dedicated space, complete with a “dog spa” shower.\n\nFor the family’s human members, a light-filled open floor plan offers lake views from every room in the house. The modern, minimalist design uses raw materials and thoughtful touches that keep the space joyful rather than cold.\n\n“Trent really loves plants indoors and bringing them into the interior, and I do as well. It softens and makes the space feel alive,” says Nicole Begrand-Fast, principal of Begrand Fast Design. “Green became a bit of a neutral colour, and the green swivel chair in front of the fireplace is Trent’s chair.”\n\nLike a modern art museum, the house is restrained, with fewer pieces that offer maximum impact. With so little noise, each element and detail can command attention. An 11-foot, live-edge sequoia slab table, crafted by Eternal Timber Design, stands beneath a Vibia light fixture that is stunningly dramatic in both its scale and simplicity. Emerging like a constellation, Bocci lights are dotted across concrete panels, illuminating a magnificent raw steel staircase that was welded on-site.\n\nA QLOCKTWO word clock holds pride of place in the kitchen. A lacquer and wood appliance wall conceals all the day-to-day tools, while a walk-in butler’s pantry around the corner has plenty of storage space for ingredients. The double islands with matte-quartz countertops and stainless steel toe kicks allow the views to take centre stage.\n\nA generous second-floor guest suite includes a private living area, wet bar, walk-in closet and en suite. Houseguests also have the best views of Trent’s reclamation “dogscaping,” including a burgeoning tree farm, blueberry and nut groves, and a vegetable garden.\n\nWhat the home may lack in individual decor pieces and knickknacks is more than made up for by infusions of colour.\n\n“I love the splash of bright rainbow colours, and I love stripes,” Christy smiles. “I fully acknowledge that I lean towards things being too plain sometimes. I need to be brought out of that more, and Nicole is great at making sure that I’m not too industrial or institutional. I just love it. That bright colour makes me really happy.”\n\nThe vibrant, striped Paul Smith area rug in the living room was a crucial piece in the design inspiration throughout the house, as was the hot pink Freedom chair in Christy’s second-floor office, and artwork in the gym.\n\nWhen you think of a wolf den, this modern home isn’t what springs to mind. But tell that to the wolf hybrids lying in front of the fireplace on the concrete floor in the morning, as their humans drink coffee and watch the colours change with the rising sun. They seem right at home.\n\nAs Christy says, “Where we are, the dogs are.”\n\nNotable Suppliers:\n\nOkanagan Planning Solutions\n\n(home designer)\n\nWilson & Company (builder)\n\nBegrand Fast Design (interior design)\n\nLike us on Facebook and follow us on Twitter.\n\nLifestyle",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-24 09:55:00-08:00",
    "title": "Magical living in the Lovig ‘wolf den’ – Houston Today",
    "url": [
        "https://www.houston-today.com/life/magical-living-in-the-lovig-wolf-den/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}