{
    "authors": [],
    "content": "Sculptor David Hunwick. (Lia Crowe) Sculptor David Hunwick. (Lia Crowe) Sculptor David Hunwick. (Lia Crowe) Sculptor David Hunwick. (Lia Crowe) Sculptor David Hunwick. (Lia Crowe) Sculptor David Hunwick. (Lia Crowe) Sculptor David Hunwick. (Lia Crowe) Sculptor David Hunwick. (Lia Crowe) Sculptor David Hunwick. (Lia Crowe) Sculptor David Hunwick. (Lia Crowe) Sculptor David Hunwick. (Lia Crowe) Sculptor David Hunwick. (Lia Crowe)\n\nBy David Wylie, photos by Lia Crowe\n\nIt took years for sculptor David Hunwick to understand the deep personal significance of hares as they’ve reappeared throughout his life, his art and his introspection.\n\nThe Victoria-based artist—seen recently in West Kelowna at Grizzli Winery’s art in the park event—created his first hare near the beginning of his sculpting journey, in the 1980s in London, where he completed his BA degree in sculpture at Ravensbourne College of Art and Design.\n\nToday, he is known for his sculptures throughout BC, and the hare continues to feature prominently in works such as his Dreams Can Come True sculpture, a piece of public art currently being exhibited on the Okanagan Lake waterway in Penticton.\n\nOf this piece, he says, in part: “All of my artwork reflects aspects of my own journey of discovery. The making of Dreams really represents a visual reminder to myself not to give up on the hopes and aspirations that quicken my step each day and inspire me to reach forward. Yet all change involves movement. Often the decision to jump or move is tempered by physical or other limitations. This piece is created to inspire to take that leap again. The hare, transcends the natural elements of the earth and ocean, and reaches over the moon.”\n\nIn high school, David studied drawing, animation, printmaking and etching; his portfolio was predominantly 2-D. He decided to try his hand at sculpting to explore its potential.\n\nAfter graduating from Ravensbourne, David was accepted for the PGCE teaching program at Bretton Hall College, located in the centre of the renowned Yorkshire Sculpture Park. He began teaching in 1987, continuing to hone his art and exhibiting each year. At this point, he says, his life centred around family, faith, teaching and art.\n\nEventually, life ushered David to Scotland, where he lived for a time above a converted sheep barn, invited as artist-resident and gallery manager. He describes this as an idyllic setting, where he awoke each morning to the sound of the bleating of sheep. He exhibited annually at the Royal Scottish Academy and worked on a number of public and private commissions. He still has pieces in some of the country’s castles. And during his nine years in Scotland, David noted the ever-present hares, a constant sight on the landscape.\n\nFeeling the pull to Canada, David and his family moved to Gibsons, BC in 2001, relocating soon afterwards to Victoria. In 2008, David decided to focus more fully on his art and established the Sculpture Studio in downtown Victoria.\n\nComing to Canada marked a turning point, and he became involved in one of his most notable projects soon after arriving here. Over two years, he moulded and cast more than 71 pieces of a blue whale skeleton for the Blue Whale Project, a permanent display at the Beaty Biodiversity Museum at UBC in Vancouver.\n\nAnd around this time, hares became a more prominent part of David’s work.\n\n“When I arrived in Canada, I thought, what should I sculpt? Thinking back to childhood memories of cycling in the Kent countryside, I remembered seeing the hares in the long grass, and the memories brought feelings of nostalgia and comfort,” he said.\n\nHe sculpted and cast in bronze his first meadow hare. It captured others’ imaginations and soon more hares followed. Still, he felt the hares weren’t his real work as a sculptor. They were just for fun—whimsical and playful.\n\n“I’d like to say my motivation was really deep and philosophical, but it wasn’t. I just felt like I should make a bunny,” he said. “I was in the period of self-denial—what I call bunny denial.”\n\nMany of the rabbits are done in David’s preferred medium; he loves working in bronze due to its permanence. He also works with concrete. David said he aspires to create visual poetry with the lines, shape, spaces and rhythm of the forms he makes, even including text at times. He’s been using more abstract elements, and incorporating steel and mixed media in his castings. Recently, he’s been putting combustible material into his pieces and then burning them, allowing the element of fire to complete the piece.\n\n“The fire will actually be the last artist,” he said.\n\nHe’s planning an exhibition in Italy where five of his works will go up in flames in front of onlookers. What is left when the embers die down is the final work.\n\nOften when creating and conceiving a new sculpture, David leaves some of the incidentals as evidence of the journey that has shaped the piece, so people can see the decisions made in its creation.\n\n“In many cases I want to leave them imperfect because I don’t really believe in perfection—I think perfection is an illusion. I believe in perfect imperfection. The human condition and experience is not perfect; although we strive for it, the reality is very different,” he said.\n\nHares continued to multiply over the years. He’s made more than a dozen variations: dancing hares, the thinker hare (a visual pun of Rodin’s famed sculpture) and a hare leaping over the moon.\n\nSlowly the realization sunk in. He saw himself in the hares; in fact, he shared many of the character qualities of the hare—elusive and more comfortable in the background. So he embraced the “inner” animal, accepting the hare as an expression of himself as an artist.\n\n“All of the hare sculptures that I’ve made are actually manifestations of me,” he said.\n\nIn the meantime, David has continued to keep teaching central to his work, taking on the role in 2012, for example, of artist-in-residence at the Gitxsan art centre in Hazelton, teaching First Nations carvers how to mould and cast their artifacts. He also co-teaches Sculpt Italy, a yearly 10-day workshop in Pietrasanta, Italy, alongside international sculptor Gabriel Vicari.\n\n“If you want to learn about sculpting, you go to Italy,” he said.\n\nFor the last 12 years, David has been a regular exhibitor at several fine art shows and won multiple awards. He has participated in the Sidney, Oak Bay, Kingsbrae and Castlegar sculpture walks for several years with a number of public sculptures on permanent display.\n\n“I feel like I’ve been given a gift, the opportunity to create. Life as an artist is not always easy and you question, how often do you want to push the wheelbarrow up the hill? Is it worth it? Then every time you get to that breaking point, you find something positive happens that allows you to continue the extra mile again,” he said.\n\nFor more info about his classes in Italy, visit icansculpt.com. For more information on the artist, visit davidhunwick.com.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-10-23 11:30:00-08:00",
    "title": "In Studio: Year(s) of the hare – Houston Today",
    "url": [
        "https://www.houston-today.com/life/in-studio-years-of-the-hare/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}