{
    "authors": [],
    "content": "By Angela Cowan\n\nPhotos by Lia Crowe\n\nLife is full of chapters; some chapters more interesting than others,” says Jennifer Lynch of Skin Sense Laser Aesthetics, and she’s certainly had a few different chapters through her life.\n\nA Kelowna resident since 2005, she’s a wife and a mom to an 18-year-old daughter, a French bulldog and a Holland lop bunny. And she’s in the midst of an entirely new career.\n\n“I worked for the RCMP for 18 years and took an early retirement due to severe PTSD from being exposed to a lot of terrible things,” she says. “While getting my mind healthy and gaining back control of my life, I decided to take on something completely different, but something I’ve always been interested in.”\n\nShe partnered with Dr. Cory Brown to develop Skin Sense Laser Aesthetics. Jennifer, a medical aesthetician, treats clients with scarring, pigment disorders, sun damage, acne and wrinkles using a variety of applications, including ICON and TempSure lasers, intense pulse light, micro-needling and more.\n\n“I love that I’m always learning and developing my mind and new skills,” she says. “Equally gratifying is being able to apply everything I’ve learned to help people unlock the beauty they possess inside, and giving them the confidence to shine. I love working closely with each and every one of my clients, earning their trust and learning their stories. Nothing is more rewarding than seeing my clients’ eyes light up when they see the beauty within themselves!”\n\nThe 7 Sins\n\nEnvy:\n\nWhose shoes would you like to walk in?\n\nIf I have learned one thing over the last few years, it is to never want to be anyone other than the best version of myself. Social media tends to depict sensationalized or embellished portrayals of other people’s lives, which is hard not to get caught up in. Finding confidence in who you are—and being able to love the person you are—holds far more value than wanting to be something that isn’t genuine.\n\nGluttony:\n\nWhat is the food you could eat over and over again?\n\nCharcuterie and a full-bodied red Okanagan wine!\n\nGreed:\n\nYou’re given $1 million that you have to spend selfishly. What would you spend it on?\n\nTravel! I would love to travel through Italy, experiencing the culture, art, food and wines with my family.\n\nWrath:\n\nPet peeves?\n\nWhen you park your vehicle far away from any other vehicle in a parking lot, and someone decides it would be a good idea to park right beside—super close to—the only other vehicle around!\n\nSloth:\n\nWhere would you spend a long time doing nothing?\n\nIn bed curled up with my French bulldog, Eve, watching Netflix.\n\nPride:\n\nWhat is the one thing you’re secretly proud of?\n\nI am so proud of my resilient little family. No matter what life event is thrown at us, we have stood by each other and persevered. And because of it, we have shared an incredible life together.\n\nLust:\n\nWhat makes your heart beat faster?\n\nIt definitely doesn’t fit the description of “lust,” but what makes my heart beat faster is cooking an amazing meal for family and friends, bringing us all together.\n\nLifestyle",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-10-20 16:00:00-08:00",
    "title": "Secrets and lives and the 7 sins: Jennifer Lynch – Houston Today",
    "url": [
        "https://www.houston-today.com/life/secrets-and-lives-and-the-7-sins-jennifer-lynch/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}