{
    "authors": [],
    "content": "As a year of uncertainty continues, it has become more critical than ever for small businesses to find creative ways to succeed, and many are turning to Export Navigator for advice and support. Operating across B.C., the free Export Navigator Program has been helping businesses grow since 2016 — now, it’s stepping in to help businesses like Bold Promotions from Fort St John to innovate and adapt.\n\nExport Navigator is a free program that connects business owners with a local export advisor who can help them find new customers beyond B.C. From growth planning to information about exporting, business owners across the province have applied free advisor support to expand with confidence.\n\nThroughout the uncertainty of the COVID-19 pandemic, the advisors at Export Navigator have been helping businesses find ways to pivot and succeed in the face of new challenges — such as taking advantage of e-commerce platforms and learning how to access government funding resources. With more businesses turning to the program, its success stories now span a range of industries and countries.\n\nHonorable Minister Mungall, responsible for the Ministry of Jobs, Economic Development and Competitiveness, believes it’s the local aspect of Export Navigator that has been fundamental to its success in helping small businesses:\n\n“As a resident of a rural community, I see so many innovative people creating products and services that deserve wider distribution. Every business and every community is different, and I think that’s why Export Navigator’s regional approach has been so valuable.”\n\nDawson Creek-based export advisor Lilia Hansen has been working with businesses across the Northeast to help them export. One of Lilia’s success stories is Bold Promotions, an outfit from Fort St. John that helps local companies promote their business by supplying branded products for conferences and events. The COVID-19 pandemic brought many of these activities to a grinding halt, and Bold Promotions found Samantha Warren needed to get creative to keep her business running. Supported by Lilia’s expert guidance, Samantha Warren applied for funding support from the Canadian Chamber of Commerce to pivot and sell sanitizing products to her community.\n\n“I switched gears to develop a Bold line of hand sanitizer that has allowed me to bring everyone back to work. This Relief Fund is a huge help in covering the costs of starting this new product line.”\n\nExport Navigator client Samantha Warran of Fort St John’s Bold Promotions was able to pivot her business for success\n\nFrom solo startups with a small customer base to larger corporations that already export to some select markets, Export Navigator is available to businesses of all sizes in Cariboo and the Northeast, and across B.C.\n\nTo continue helping businesses in Cariboo Region, the free program is accepting online applications. To support underrepresented groups, businesses owned by Indigenous Peoples, women, and youth can expect specialized support and are also encouraged to apply.\n\nExport Navigator gratefully acknowledges that we live, work, and play on the traditional territories of the Indigenous Peoples of British Columbia.\n\nSmall Business",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-09-21 06:00:00-08:00",
    "title": "Cariboo and Northeast businesses achieve international success with Export Navigator – Houston Today",
    "url": [
        "https://www.houston-today.com/marketplace/cariboo-and-northeast-businesses-achieve-international-success-with-export-navigator/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}