{
    "authors": [
        "Zoe Ducklow",
        "Local Journalism Initiative Reporter"
    ],
    "content": "Salla Sukow sings the women warrior song at a recent Gwa’sala-‘Nakwaxda’xw gathering. Ceremony will be part of the Indigenous Court process. (Zoe Ducklow photo)\n\nThere has been a renaissance of Indigenous legal systems across Canada over the last several years, showing up in the form of small community initiatives, new classes and degrees at law schools.\n\nIn B.C., there is an alternative judicial process called Indigenous Court.\n\nThe latest of these courts under development is on northern Vancouver Island, led by the Gwa’sala-‘Nakwaxda’xw First Nations in partnership with the RCMP, local Crown council, judges and other stakeholders.\n\nThe court plan is queued for final review by the Judicial Council of B.C. in January. If approved, it will be the eighth in B.C., after New Westminster, North Vancouver, Kamloops, Duncan, the Nicola Valley, Prince George and one in Williams Lake which has yet to open.\n\nIndigenous Court is an alternative sentencing method for people who accept responsibility for their crimes, and want to be sentenced by their community instead of the Crown.\n\n“In the standard court system the actual thing I’m accused of is breaking the law, not for the harm done. There’s nothing to address the actual harm caused. Indigenous Court is a way that can create balance back into relationship and undo harm,” said Dean Wilson, acting health director for Gwa’sala-‘Nakwaxda’xw, and coordinator for this project.\n\nIn Indigenous Court, the offender will sit in a circle with elders, possibly the victim, family members, neighbours, and a judge. Everyone gets a chance to share how they have been affected by the offender’s actions, which will often include a lifetime of relationship history. An uncle might share memories of when the person was growing up and reflect on how their life choices have changed them. The offender also gets to speak, to share what’s been going on in their life that led to this place.\n\nTogether, the elders and judge agree on a sentence with the goal of re-mediating the offender and healing the harm done. A sentence might be going to a remote place to live off the land, with periodic teaching visits from elders. It will include some punitive action, as well as healing for the person based on what’s needed.\n\nA system like this provides flexibility so the sentence makes sense for the people involved, rather than standard criminal code punishment. The intent is to be held accountable by the people directly affected, not an impersonal justice system.\n\n“There’s anonymity facing the court compared to facing my sister, my grandmother,” Wilson said.\n\nIt’s still a legal process, with a judge ordering the sentence, and the crime will still reflect on the person’s record. Crown counsel will act as the gatekeeper for which cases are allowed to be sentenced in Indigenous Court. Sexual offences or domestic abuse, for example, will not be allowed to proceed through Indigenous Court.\n\nPort Hardy’s acting Staff Sgt. Chris Voller says programs like this are part of reconciliation.\n\n“To show culturally competent policing, which is our goal, I think we need to understand their culture. And their culture is collaborative, it’s taking into account the voice of elders, it’s accountability, and there are traditional means of dealing with something, not a westernized colonial system that’s been pushed onto them.”\n\nThat system, Voller says, simply hasn’t worked.\n\nThere is a plethora of data showing how Indigenous people are over-represented in Canadian prisons. In B.C. over one-third of incarcerated people are Indigenous, despite being only 5.9 per cent of the overall population.\n\nCompared to all other categories of accused persons, Indigenous people continue to be jailed younger, denied bail more frequently, granted parole less often and hence released later in their sentence, over-represented in segregation, over-represented in remand custody, and more likely to be classified as higher risk offenders, according to a 2019 Department of Justice Canada report.\n\nJustice is inherently a family matter, and Indigenous Court will require intense involvement from the community for that reason. The Port Hardy Indigenous court will be available for any Indigenous person served by local courts. Individuals must choose this route, Wilson stressed. Those who don’t want to take responsibility and make changes in their lives can still choose to go through the regular court system, he said.\n\n“It’s not an easier route. It’s not about being let off by virtue of past hardships. It’s easier to go to court and take my penalty than having to face my sentence in my community. It’s about changing my behaviour,” says Wilson.\n\nDo you have something to add to this story or something else we should report on? Email: zoe.ducklow@blackpress.ca\n\n\n\nIndigenousLaw & Justice",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-03 10:57:00-08:00",
    "title": "Indigenous Court to offer alternative sentencing options for northern Vancouver Island – Houston Today",
    "url": [
        "https://www.houston-today.com/news/indigenous-court-to-offer-alternative-sentencing-options-for-northern-vancouver-island/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}