{
    "authors": [
        "Terry Farrell"
    ],
    "content": "Carolyn and Steve Touhey came across a pod of humpback whales while on their boat Sunday, Oct. 25. Photo supplied\n\nA Comox Valley family had a meeting with a humpback whale family recently, between Comox and Texada Island.\n\nCarolyn and Steve Touhey were out on their boat with a friend on Sunday, when they spotted the telltale whale spouts nearby.\n\n“I think there were four [in the pod] – at one point I thought maybe five, but there were definitely at least four,” Carolyn said. “We saw the blowholes so we slowed down, but the boat in idle, and just let them go past us.”\n\nCarolyn grabbed her camera, which is equipped with a 60x zoom lens, and recorded the show from a distance.\n\nCarolyn said she had a similar experience at this time last year.\n\n“On the same memory card I was looking back to November of 2019 and we saw some spectacular humpbacks that time too… I think people probably think it’s winter so there’s no whale-watching, but the whales don’t leave. We do.”\n\nThe Touheys, who own the Two Eagle Lodge, also had a memorable encounter with a pod of orcas earlier this year.\n\nRELATED: Orcas feeding, splashing and breaching near Hornby Island\n\nSo is it time to expand their bed and breakfast business to a B&B/adventure tours business?\n\n“Oh, I don’t think so,” said Carolyn with a laugh. “But I will never say never.”\n\n\n\nterry.farrell@blackpress.ca\n\nLike us on Facebook and follow us on Twitter\n\nComox ValleyWhales",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-10-27 11:30:00-08:00",
    "title": "VIDEO: Boaters encounter pod of humpbacks in Georgia Strait – Houston Today",
    "url": [
        "https://www.houston-today.com/community/video-boaters-encounter-pod-of-humpbacks-in-georgia-strait/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}