{
    "authors": [
        "Thom Barker"
    ],
    "content": "The 8mm reel included an incredible two minutes of the 1955 Fall Fair parade on Main Street\n\nVernon videographer Francois Arseneault is a collector of vintage film. Over the years, he has gathered more than 2,000 reels of amateur film footage dating to 1923.\n\nRecently he dug up an 8mm, colour reel from 1955 from the Bulkley Valley that includes rare footage from Telkwa and Smithers of agricultural and land clearing activities and an incredible two minutes of what was most likely the 1955 Fall Fair Parade on Main Street in Smithers.\n\n“This vintage BC reel continues on in central B.C. in 1955, during a time where the central interior was being opened for agriculture and development,” Arsenault wrote.\n\n“Roads were often still gravel or dirt and travel slow. Television was still new and available only in the south. Prince George wouldn’t have it’s first TV station for another six years. Food production was increasingly become mechanized. For better for worse, land was cleared to create agricultural land. More people were moving north. Parades and celebrations were the social events on many of the town calendars. Before social media, and next to the local newspaper, a parade was perhaps the best way to showcase local businesses.”\n\nREAD MORE: Vernon videographer an ‘accidental historian’\n\nThe video above was recently published on Arseneault’s YouTube channel called Reel Life.\n\n\n\neditor@interior-news.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-10-16 12:30:00-08:00",
    "title": "Vernon videographer digs up rare footage of Smithers in 1955 – Houston Today",
    "url": [
        "https://www.houston-today.com/community/vernon-videographer-digs-up-rare-footage-of-smithers-in-1955/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}