{
    "authors": [
        "Laurie Tritschler",
        "Local News"
    ],
    "content": "Kimberly Feeny and Lisa Valenta are nursing seven cats rescued east of Grand Forks, B.C.\n\nGrand Forks’ Kimberly Feeny rescued seven cats from a rural Grand Forks property Friday, Nov. 27.\n\nTwenty cats had been living in a feral colony there, a brood loosely watched over by a well-meaning homeowner who started feeding a pair of abandoned cats three years ago. Feeny said she will return to the property to rescue the remaining 13 cats at a later date.\n\nKimberly Feeny, left, rescues, fosters and homes cats with the Kootenay Animal Assistance Program. She and friend Lisa Valenta, right, spent Friday, Nov. 27 nursing seven rescued kitties at Feeny’s home in Grand Forks. Photo: Laurie Tritschler\n\nREAD MORE: Cat shot in face survives after rescue by Good Samaritan\n\nREAD MORE: 20 cats rescued after B.C. man allegedly tries to strangle them\n\nFeeny has been fostering local kitties and placing them in forever homes in Grand Forks and neighbouring Castlegar and Nelson because Grand Forks doesn’t have a proper cat shelter.\n\n“People seem to think that domestic cats can just fend for themselves outside as if they were wild, and that’s just not true,” she said.\n\nFeeny, who works with the Kootenay Animal Assistance Program (KAAP), is sheltering, feeding, cleaning and generally loving her foster cats in a heated trailer outside her home, where she said she keeps cats of her own. The rescues are recovering from eye infections Feeny said are common among outdoor cats who live in a large colonies.\n\nHer friend Lisa Valenta was busy administering the cats’ eye drops when The Grand Forks Gazette turned up Friday afternoon. Feeny had just arrived from picking up cat food and kitty litter donated by city residents. The pair hopes to nurse the cats to the point where they are well enough to be neutered, spayed and micro-chipped by a local veterinarian.\n\nThe cats are being sheltered in a heated trailer outside Feeny’s home. This cat was kept in a carrying crate while he waited for his eye drops from Feeny’s friend, Lisa Valenta. Photo: Laurie Tritschler\n\n“Kitties aren’t something you can throw away,” Valenta told The Gazette. “They’re forever,” she said.\n\nFeeny and Valenta are asking people to donate to the KAAP website at www.kaap.ca.\n\n@ltritsch1\n\nlaurie.tritschler@grandforksgazette.ca\n\nLike us on Facebook and follow us on Twitter.\n\nAnimal Sheltersanimal welfareAnimalsCatsGrand Forks",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-27 17:00:00-08:00",
    "title": "Kootenay women working to rescue 20 cats in feral colony – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/news/kootenay-women-working-to-rescue-20-cats-in-feral-colony/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}