{
    "authors": [
        "Dan Ferguson"
    ],
    "content": "Avid walker George Doi of Langley celebrated a milestone on Sept. 17, when he completed a virtual walk around the world (Special to Langley Advance Times)\n\nGeorge Doi tends to go through several walking shoes a year, wearing them out in as little as three or four months.\n\n“I enjoy brisk walking,” the 88-year-old Langley, BC, resident, a father of two and grandfather of four, explained.\n\n“Not slow walking, brisk walking.”\n\nThat may be an understatement.\n\nDoi just celebrated a singular accomplishment by completing a virtual walk around the world.\n\nREAD ALSO: Walking through Langley on Christmas Day\n\nHis affection for long walks probably all began when he was 15, and working at a logging camp.\n\nWhen an impatient Doi heard the Greyhound bus was going to be several hours late, he set out, on foot.\n\n“I wanted to be home before the bus arrived,” he recalled.\n\nHe achieved his goal, “even with all my blisters.”\n\nAfter that, long, quick walks became a habit.\n\nREAD ALSO: Early morning walks resume at Willowbrook shopping centre\n\nRecently, when Doi dropped his van off at a shop in Surrey, he made the trip home on foot.\n\n“The guy [shop manager] told me, ‘we have a courtesy car.” I said, ‘I’d rather walk home.’ He thought that was crazy.”\n\nAfter Doi wound up a career with what was then known as the B.C. Forest Service he began making long, brisk strolls through his community.\n\n“I didn’t have a goal when I retired,” Doi recalled, reasoning that setting targets might take the fun out of it.\n\nBut he did keep track of his mileage, and one day, realized he was nearing an interesting milestone.\n\nIf he kept it up, he would have walked a distance equivalent to the circumference of the earth – 24,901 miles or 40,075 kilometres.\n\n“In 2018, I decided that would be my goal,” Doi related.\n\nHe upped his pace, walking twice a day, once in the morning and once in the evening, four miles each time.\n\nOn Sept. 17, about 21 years after he began, he achieved his goal.\n\n“I was thinking about having some champagne, [but] I’m a low-key fellow,” Doi confided.\n\nHe has scaled back his walking since he achieved his goal, to a single 3.2 round-trip from his townhouse.\n\n“I’m not going to do it again,” he laughed.\n\n\n\ndan.ferguson@langleyadvancetimes.com\n\nLike us on Facebook and follow us on Twitter\n\nCommunityLangley",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-09-27 11:30:00-08:00",
    "title": "A (virtual) walk around the world by 88-year-old B.C. man – Houston Today",
    "url": [
        "https://www.houston-today.com/community/a-virtual-walk-around-the-world-by-88-year-old-b-c-man/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}