{
    "authors": [
        "Monique Tamminga"
    ],
    "content": "A black bear similar to this one charged at a Summerland woman bike riding on Conkle Mountain in Summerland (September 2020.) (Black Press file photo)\n\nSummerland resident Janice Kitson is still shaken after being chased by a bear while biking on Conkle Mountain recently.\n\nIt was a more intimate encounter with nature than she was expecting.\n\n“He is beside my back wheel and I could have put my arm around his neck, he was that close.”\n\nKitson was coming down Conkle Bonk on the canyon above the rodeo grounds, at around 11 a.m. on Sept. 16, when the bear came out of nowhere.\n\n“I was having an excellent ride and thinking about what time I would finish it in, when I heard some sort of crashing in the bush to the right of the trail, above me,” Kitson recalls.\n\n“It is a narrow area, so I chanced a quick look behind me and saw the bear galloping full speed at me – I could hear him huffing and breathing hard and see the whites of his eyes.”\n\nWith the bear behind her, Kitson pedalled as fast as she could, going off the trail and down towards the canyon.\n\n“I think that because a small tree and patch of bush came between us, he went a bit left then ran past me and stopped six to eight feet away,” said Kitson. “I stopped and was thinking omg, omg he’s going to come back.”\n\nThat’s when the big bear stood up and snorted a number of times.\n\nKitson stood very still beside the little tree, thinking that if she could keep the bike between her and the bear, she might not get too mauled.\n\nThen the dark brown bruin turned and ran off.\n\nKitson tried to get back on her bike and ride away but then the severity of the incident set in.\n\n“I had to sit down for about 15 minutes, I was shaking so violently. How he didn’t hit me is a mystery to me – the way he came crashing out of the bush with dust flying everywhere.”\n\nIt’s been over a week since Kitson’s encounter with the bear and the scene still plays out in her mind.\n\nREAD MORE: Bear sightings up in Central Okanagan\n\nKitson says the same bear was seen last week closer to the gazebo on the north side of the Trans Canada Trail, and she believes she saw the same bear two weeks ago.\n\nFor years, Kitson and other Summerland residents have enjoyed the many trails on Conkle Mountain without incident. There have always been bears there, she hasn’t heard of any aggressive ones.\n\nAccording to WildSafeBC, fall is when bears go through hyperphagia (“extreme eating”) when they require an average of 20,000 calories per day.\n\nA mother and cubs have been spotted near the rodeo grounds this week too and another bear has been spotted in town.\n\nREAD MORE: Bear closes popular park\n\nOne thing that makes this year different in Kitson’s opinion, is that with COVID-19 more people and dogs are trying to get outside in the fresh air, making the trails busier than other years.\n\n“Bears see canines as a threat to their cubs and their food,” said BC Conservation Officer Dave Cox.\n\nConservation officers have been getting calls about bear sightings, but not any calls about aggressive bears.\n\n“What happened with that bear is not normal behaviour for them. It could have been that the bear was being defensive of some nearby food or that she surprised him,” Cox said.\n\nHe always recommends calling the RAPP line at 1-877-952-7277 so they can investigate and warn people about the incident or area of bear sightings.\n\n“Calling us doesn’t necessarily mean that we are going to get that bear,” he added.\n\nThis time of year, bears are attracted to all the rotting fruit in the South Okanagan and so it isn’t unusual to see them this time of year.\n\n“We have another month of bears and then they go away to hibernate around Halloween,” said Cox.\n\nCox says if you are going out hiking in the mountains, it’s best to bring bells, talk and go in groups so you let bears know you are there. If you encounter a bear, talk calmly to it, don’t scream, back away and leave them an escape route if possible.\n\nTo report a typo, email: editor@pentictonwesternnews.com.\n\n@PentictonNews\n\nnewstips@pentictonwesternnews.com\n\nLike us on Facebook and follow us on Twitter.\n\nbearsWildlife",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-09-26 07:30:00-08:00",
    "title": "‘I could hear him huffing and see the whites of his eyes,’ says Okanagan woman about her bear encounter – Houston Today",
    "url": [
        "https://www.houston-today.com/community/i-could-hear-him-huffing-and-see-the-whites-of-his-eyes-says-okanagan-woman-about-her-bear-encounter/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}