{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "Kovrig and Spavor are marking two years in Chinese prisons on what Canada says are trumped-up charges\n\nA young man holds a sign bearing photographs of Michael Kovrig and Michael Spavor, who have been detained in China for more than a year, outside B.C. Supreme Court where Huawei chief financial officer Meng Wanzhou was attending a hearing, in Vancouver, on Tuesday January 21, 2020. In his darkest moments, Michael Kovrig draws strength from knowing that his fellow Canadians and people around the world are working to free him and Michael Spavor from their respective Chinese prison cells. THE CANADIAN PRESS/Darryl Dyck\n\nIn his darkest moments, Michael Kovrig draws strength from knowing that his fellow Canadians and people around the world are working to free him and Michael Spavor from their respective Chinese prison cells.\n\nAs much as that matters, Kovrig’s wife Vina Nadjibulla says he is also subjecting himself to a strict regimen to strengthen his mind and body because he views that as the key to his survival.\n\nShe says that not only is Kovrig determined to survive his ordeal, he wants to reclaim his freedom better and stronger than when he lost it.\n\nKovrig and Spavor are marking two years in separate Chinese prisons, on what Canada and dozens of its Western allies say are trumped-up espionage charges in retaliation for the RCMP’s December 2018 arrest of Chinese high-tech executive Meng Wanzhou on a U.S. extradition warrant.\n\nCanada’s ambassador to China, Dominic Barton, one of the few outsiders to see them, said this week Kovrig and Spavor are anything but broken men, and that seeing how they’ve endured their captivity was inspiring.\n\nKovrig is “marshalling every ounce of his willpower and strength” to cope with his difficult situation, Nadjibulla said in an interview this week.\n\n“He says that knowing that Canadians care, knowing that the world cares, and people are fighting for his release, makes him feel stronger, and keeps hope alive,” she said, drawing on letters that he has written in captivity.\n\n“He hopes that he will be able to come out from this experience not only having survived it, but with a commitment, with resolve to rebuild his life better, to contribute even more to society.”\n\nA statement from Global Affairs on Thursday to The Canadian Press said that Canadian Embassy officials in Beijing spoke directly with Chinese Ministry of Foreign Affairs officials to clarify a media report earlier in the morning that suggested the two Michaels had gone on trial in China.\n\nThe statement said that “contrary to what has been reported in the media this morning, there has been no development in the cases of Michael Kovrig and Michael Spavor.”\n\nThe statement also said that “the confusion was caused by an inaccurate characterization of the process made by the Chinese MFA spokesperson.”\n\nThe Canadian Press also reached out, through intermediaries, to request interviews with Spavor’s friends and family but was unsuccessful. Spavor worked as an entrepreneur in the Chinese city of Dandong, where he is imprisoned near the North Korean border.\n\nKovrig was most recently an analyst with the International Crisis Group in Washington and before that he was a member of Canada’s diplomatic corps, a career focused on preventing deadly conflicts.\n\n“He hopes that he can continue to do that, and he can rejoin the broader conversation in the world with life and not just continue to be isolated and cut off in the way that he is,” said Nadjibulla.\n\nShe said Kovrig is devouring books from the meditations of stoic philosopher Marcus Aurelius, to St. Paul’s Letter to the Romans, to Tolstoy’s “War and Peace,” to Nelson Mandela’s “Long Walk to Freedom.” He’s reread one of his pre-prison favourites, “Antifragile: Things That Gain From Disorder” by Nassim Nicholas Taleb, because it contains a key message for him.\n\n“It essentially posits that it’s important to cultivate an ability to not only survive traumas or disruptions but to become better and stronger as a result. So, this idea of building back better. I know it’s very much on the minds of many of us as we recover from the pandemic,” she said.\n\nREAD MORE: Kovrig, Spavor are ‘inspiring’ and ‘robust’ in Chinese prison, says Canada’s envoy\n\nKovrig is also drawing on stoic philosophical teaching that, among other things, calls for the transformation of “fear into prudence, pain into information,” said Nadjibulla. Kovrig has added “anger into the termination of grievance” to that philosophy.\n\nHe has been drawn to St. Paul’s Letter to the Romans, the sixth book of the New Testament, “which says suffering produces endurance, endurance produces character, character produces hope. And Michael is doing everything possible to keep hope alive,” said Nadjibulla.\n\nKovrig is subjecting himself to a strict physical regimen, forever on the move in his small cell striving to walk the equivalent of five kilometres daily because he knows his mind cannot thrive if his body is not strong, said Nadjibulla.\n\nRobert Malley, Kovrig’s boss at the International Crisis Group, says his imprisoned colleague can hold the plank, a core body exercise of endurance, for 18 minutes. In solidarity, Crisis Group colleagues recently had a plank competition but the closest anyone got was seven minutes. They’re also walking 7,000 steps a day, the equivalent of five kilometres.\n\nMalley said he and his colleagues are in awe of Kovrig’s discipline.\n\n“None of us can be prepared for that, unless you’re in the military and you’re told this could happen. But he seems to have had all of the reflexes, instincts that are necessary,” said Malley.\n\nWhen Kovrig is released one day his colleagues hope stories of their attempts to replicate some of his exercises will help him heal and, perhaps, bridge the gap growing between them and him, said Malley.\n\nKovrig only found out the scope of the global pandemic during Barton’s on-site virtual visit in October — his first contact with Canadian diplomats since January because Chinese authorities wouldn’t allow any contact due to COVID-19, said Nadjibulla.\n\nHe was shocked at the pandemic’s scale and compared it to a zombie apocalypse and the movie “Contagion.”\n\nKovrig is also aware that he is one of “two Michaels” and understands that both he and Spavor “are caught in this bigger situation,” she said. It’s not a topic that can be discussed during the now-resumed 30-minute consular visits.\n\nNadjibulla said she was happy to hear that Prime Minister Justin Trudeau spoke to U.S. president-elect Joe Biden about the two Michaels in their recent conversation. Trudeau refused to discuss the content of that conversation last week, or whether Biden might revisit the Justice Department’s attempted extradition and prosecution of Meng.\n\nIf the U.S. withdrew its charges, Meng could go free, and that might give China reason to free the two Michaels.\n\n“Our Michael and Michael Spavor are caught in a bigger geopolitical struggle,” Nadjibulla said. “They’re pawns in a bigger political game involving the U.S., China and Canada. And they have been in the situation for two long years, for no other reason than being Canadian citizens.”\n\nMike Blanchfield, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nChina",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-10 08:00:00-08:00",
    "title": "‘Two Michaels’ mark two jailed years in China, but Canada says reports of trial inaccurate – Houston Today",
    "url": [
        "https://www.houston-today.com/news/two-michaels-mark-two-jailed-years-in-china-but-canada-says-reports-of-trial-inaccurate/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}