{
    "authors": [],
    "content": "Preventive Medicine is a proactive method of health care delivery. Its’ aim is primarily to stop diseases from starting and progressing. It is a safe, effective, affordable, and widely accepted method of health care delivery.\n\nGovernments and health institutions are progressively leaning toward Preventive Medicine which includes the promotion of a healthy lifestyle and routine interval medical check. There are several publicly available information and services on preventive health care programs. Canadian Task Force on Preventive Health Care (CTFPHC) and other large Canadian organizations had developed standard and approved recommendations for routine screening of average-risk Canadian adults for some disease conditions. The practice of Preventive Medicine is an evidence-based reliable method of preventing diseases.\n\nThis article provides an overview of some of the diseases that require routine screening and could guide the reader in his/her discussion with his/her health providers on necessary screening.\n\nScreening for hypertension: The CTFPHC recommends that blood pressure (BP) be measured at all appropriate health care visits and according to the techniques described by the Canadian Hypertension Education Program (CHEP).\n\nScreening for cervical cancer: Papanicolaou test is recommended for women aged 25 to 69 years of age. The screening should occur every 3 years if the woman had been sexually active. For women aged 70 years or older who have been adequately screened (3 successive negative Papanicolaou tests in the previous 10 years), routine screening may cease. No routine cervical cancer screening is recommended for women 24 years of age or younger.\n\nScreening for breast cancer: Women aged 50 to 74 years should be screened with mammography every 2 to 3 years. Women aged 40 to 49 years should not routinely be screened (except indicated) with mammography because the false-positive rate of mammography is higher in this age group, leading to more follow-up testing including unnecessary biopsies. Clinical and self-breast examinations are not recommended, as there is no evidence that either reduces mortality. A self-breast examination could lead to increased harm (more benign breast biopsies).\n\nObesity in adults: The CTFPHC recommended measuring height and weight and calculating body mass index (BMI) in healthy adults. Adults of normal weight should not receive interventions to prevent weight gain. Adults who are overweight or obese, especially if they are at high risk of diabetes, should be offered structured behavioural interventions aimed at weight loss. The use of medications to treat weight loss is not recommended, as adverse effects are a concern.\n\nScreening for type 2 diabetes: The CTFPHC recommended that adults with a low to moderate risk should not be screened for type 2 diabetes. However, adults at high risk should be screened every 3 to 5 years, and adults at very high risk should be screened annually.\n\nScreening for dyslipidemia/abnormal cholesterol: The Canadian Cardiovascular Society recommended screening men aged 40 years and older and women aged 50 years and older. Younger adults with at least 1 risk factor might benefit from a risk assessment to motivate them to improve their lifestyles.\n\nScreening for colorectalcancer: Adults with no additional risk factors should be screened between the ages of 50 and 75 years, while individual opportunistic screening could be considered up to age 85 years. Stool screening tests every 1 to 2 years and flexible sigmoidoscopy are acceptable screening methods.\n\nScreening for prostate cancer: The CTFPHC continued to recommend not routinely screening for prostate cancer with the prostate-specific antigen (PSA) test. For men younger than 55 years, there is a lack of benefit, though evidence of harms exists from screening. For men aged 55 to 69 years, the risks and benefits of PSA screening and its consequences should be discussed with the patient. The CTFPHC makes its recommendation based on placing a lower value on the small and uncertain potential reduction in mortality and a higher relative value on the risk of false-positive results in this age group. For men aged 70 years and older, there is evidence of potential harms of screening and a lower life expectancy. British Columbia’s Medical Service Plan does not fund routine PSA screening tests; any person requesting the test is required to pay out of pocket.\n\nScreening for Sexual Transmitted Infection (STI) and HIV: Screening is recommended for STIs if risk factors are present and, to offer to screen for HIV if risk factors are present which includes ever been sexually active and on request.\n\nOther beneficial screening tests that required to be done when indicated are screening for lungcancer with low dose computerized (CT ) scan for heavy cigarette smoker between the age of 55-74 years, a one -time screening for abdominal aortic aneurysm (AAA) with an ultrasound scan for any man between the age of 65- 75 that ever smoked and women of same age group with a first-degree relative with a history of severe/ ruptured AAA. Also, screening forosteoporosis for eligible candidates.\n\nIt is recommended that adult Canadians discuss with their primary care providers the preventive health measures (lifestyles, medical exams and tests) appropriate for their age, gender, lifestyle, family history, medical conditions and other conditions.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-09-23 01:30:00-08:00",
    "title": "Routine medical check for adult canadians; what you need to know – Houston Today",
    "url": [
        "https://www.houston-today.com/news/routine-medical-check-for-adult-canadians-what-you-need-to-know/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}