{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "Ayham Abou Ammar and his wife Dima Naseraldeen pose for photos with their children Nour, 8, left, and Alan, 5, right, in their apartment Wednesday, December 9, 2020 in Montreal. Dima Naseraldeen arrived in Montreal less than three years ago with her husband and their two sons. Earlier this year, when they had started to enjoy their new life in Canada, the city went into a lockdown, forcing them to stay at home and to put their work plans on hold. THE CANADIAN PRESS/Ryan Remiorz\n\nFive years after the first of them arrived in Canada, tens of thousands of Syrian refugees have had to adapt to COVID-19 lockdowns that brought back the memories of war horrors and upset the lives they had begun to rebuild.\n\nOn Dec. 10, 2015, following a promise by the Liberals during the 2015 election campaign to make it much easier for them to reach Canada, the first plane bearing Syrian refugees landed in Toronto.\n\nA total of 45,919 Syrian refugees were resettled in Canada by April 2017 and more continued to arrive under other programs after that.\n\nDima Naseraldeen arrived in Montreal less than three years ago with her husband and their two sons. Earlier this year, when they had started to enjoy their new life in Canada, the city went into a lockdown, forcing them to stay at home and to put their work plans on hold.\n\n“In the beginning, we were worried and scared,” she said.\n\n“Suddenly, streets were empty, stores were shut down. It was something similar to war.”\n\nBefore coming to Canada, Naseraldeen spent years with her family in a suburb south of Damascus hiding from mortar shells.\n\nShe said the first few months of the COVID-19 pandemic put them in the same profound anxiety they had lived with in Syria.\n\n“We would always hear the sirens of ambulances and wait for the news,” she said. “We didn’t know what was going to happen next.”\n\nBayan Khatib, the co-founder and executive director of the Syrian Canadian Foundation, said Syrian newcomers she worked with told her they were locked down in their homes in Syria for months or a year at a time because of the constant bombings outside and their inability to leave town.\n\n“Everybody wearing masks must have been difficult to see, too, for people, perhaps, who are coming from areas that were attacked with chemical weapons,” she said.\n\nKhatib’s organization is based in Mississauga, Ont., and provides services for newcomers in several cities in Ontario.\n\nShe said a lot of Syrian families came from places where the schools were shut down because of war, so when the schools were closed earlier this year, they must have felt horrible.\n\n“Experiencing the second lockdown now in their new home as they’re trying to live life in a safe place, sure has been very challenging and extra stressful for them.”\n\nBefore the pandemic, Naseraldeen, 34, pursued a passion for drawing and participated in a few art shows with other artists in Montreal. Her first show of her own at the Montreal Art Centre was put off from May to December, then scrubbed.\n\n“It was a disappointment” she said. “First, (the show) was delayed and I thought that would give me more time to prepare, then it was a shock that it was cancelled.”\n\nHer husband Ayham Abou Ammar is an actor and a musician. In February, he finished shooting his part as the lead actor in a Canadian movie about a Syrian family that moved to Canada, but the movie release was also put off until next year.\n\n“It was supposed to be screened at several festivals, but it was all cancelled,” he said.\n\nAbou Ammar, 36, said he feels he lost the joy of watching his first movie on the big screen.\n\n“It’s a turning point to see your work in the cinema,” he said. “I still hope it will be released next year.”\n\nREAD MORE: Syrians gradually integrating into Canadian society, latest report finds\n\nAbou Ammar has taught music to youngsters in Montreal occasionally, but with limited participation due to physical-distancing rules.\n\nThe career shift was more dramatic for Noor Sakhniya, who finished his training to become a pilot last year in Ottawa, almost four years after landing in Canada with his family.\n\nSakhniya was hired by Buffalo Airways in Yellowknife in December 2019 but was laid off in March because of the pandemic.\n\nReturning to Ottawa, Sakhniya, 23, had to work in survival jobs including making deliveries and as a personal grocer.\n\n“You work hard for four years and you spend a lot of money on the training and on your dream … then, you (have) to let it all go,” he said.\n\n“I believe it’s not just my case. It’s the case of many pilots, whether they’re beginner pilots or pilots who have years of experience, they will have to let it go due to the pandemic.”\n\nHe used to be active in organizing events for the Syrian community in the city and he coached a soccer team for immigrant kids last year, but all of that was on hold this year.\n\n“In our countries, we were used to having a circle of support from family and friends … For many Syrians, during the war, they all moved together into their family houses to support each other,” he said. “During the pandemic, it’s really hard to do that, especially here in Canada (where) you don’t have family sometimes. Even though you have family sometimes, it’d be hard because you have to isolate yourself.”\n\nHe works now at a manager in a restaurant in downtown Ottawa. Expecting aviation to be slow for many years, he’s planning to study aerospace engineering at Carleton University next year.\n\nNaseraldeen also is creating a new career path for herself in case she is not able to make living of painting in the near future. She finished training as a makeup artist recently.\n\nShe said it’s difficult for her to paint artwork now, with the amount of uncertainty that COVID-19 pandemic has put her in. Yet she said she still has hope.\n\n“We were living in a war zone and we lost our jobs and homes and there was always hope,” she said. “I’m always optimistic … and I’m sure good things will follow.”\n\n———\n\nThis story was produced with the financial assistance of the Facebook and Canadian Press News Fellowship.\n\nMaan Alhmidi, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirusrefugeeSyria",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-10 08:00:00-08:00",
    "title": "Syrian refugees overcoming war memories brought back by COVID-19 – Houston Today",
    "url": [
        "https://www.houston-today.com/news/syrian-refugees-overcoming-war-memories-brought-back-by-covid-19/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}