{
    "authors": [
        "Deb Meissner",
        "Local News"
    ],
    "content": "As a virtual event this year, the festival runs from Dec. 1 through Dec. 12\n\nSmithers Festival of Trees has moved online this year, although the public may also view the trees from the pathway outside of Glacier Toyota’s windows from Dec. 1 to Dec. 12.\n\nThis will be the sixth year Glacier Toyota has hosted the the fundraiser. In the last five years, it has raised more than $143,000 for two local charities, the Salvation Army and Northwest Child Development Centre. Last year it raised a record-breaking $53,000 in 12 days.\n\nSome of the auction items and themed trees already online for viewing include a family outdoor fun tree, a pawesome tree, iPad Pro 12.9, wood furniture, a river float gourmet and a Destination Trip.\n\nAnna Ziegler, a member of the planning committee, and part of the Glacier Toyota team, said the array of trees is spectacular, and the themes of the decorated trees are as varied and creative as the businesses that donate them.\n\nREAD MORE: Festival of Trees Grows\n\nShe said they started in August asking local businesses if they were interested in having the event this year because it’s been a most uncommon year.\n\n“The overwhelming response was yes,” she said.\n\nZiegler said it became apparent about a month ago, with Covid-19 restrictions becoming tighter, that they would need to host the event online, out of an abundance of safety.\n\n“There will still be volunteers around in the evenings to answer questions and help people view the trees in a showcase shopping experience through the windows, although we encourage people to enjoy safely,” she said.\n\nREAD MORE: Salvation Army Christmas Kettle Campaign Started\n\nThere are more than 40 items up for bid this year, big and small, with the bidding set to start Dec. 1.\n\nThere is a feature on the site called a proxy bid that allows where you set your maximum bid and it will automatically keep bidding for you until your maximum is reached.\n\nZiegler said they did not set a specific goal this year because of the uncertainty created by changing the event and the pandemic, but hope to raise at least the value of everything donated.\n\n“Most of all we want everyone to have a good time, enjoy the beautiful trees from the windows and to stay safe and healty,” she said.\n\nAlthough bidding does not start for a few more days, the acution site is live so interested participants can register to bid by going to www.smithersfestivaloftrees.com.\n\n\n\ndeb.meissner@interior-news.com\n\nLike us on Facebook and follow us on Twitter\n\nCommunity",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-27 11:15:00-08:00",
    "title": "Smithers Festival of Trees approaches – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/community/smithers-festival-of-trees-although-online-this-year-can-still-be-viewed-through-the-glacier-toyota-showroom-windows/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}