{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "The federal government this year will transfer to the provinces nearly $42 billion for health care\n\nA first ministers meeting today that was supposed to be devoted to long-term, federal health care funding seems destined to be hijacked by a more urgent priority: surviving the COVID-19 pandemic.\n\nPremiers asked for the meeting in September and wanted it focused exclusively on their unanimous demand that Ottawa add at least $28 billion a year to its annual health transfer payment to provinces and territories.\n\nBut while Prime Minister Justin Trudeau says he’s willing to discuss the issue, he has been clear that getting through the pandemic is more pressing, as far as he’s concerned.\n\nAs host of the daylong meeting, he’s scheduled the first half to focus on the rollout of vaccines to inoculate Canadians against COVID-19, the first of which is slated to begin delivery next week.\n\nThe second half of the meeting, to be conducted via teleconference, will be devoted to health care funding and improving health care in general.\n\nOn Wednesday, premiers were scaling back expectations, saying it will take multiple meetings to come to any resolution on health transfers.\n\nOntario’s Doug Ford is hoping to persuade Trudeau to commit to a resolution in time for increased funding to be included in the next federal budget.\n\nThe premiers’ demand for more health care cash comes as the federal government is facing an unprecedented deficit approaching $400 billion, with more billions yet to be doled out to help Canadians weather the pandemic and the shattered economy to eventually bounce back.\n\nSo premiers can hardly be surprised that Trudeau doesn’t seem in any rush to deal with their decades-long complaint that Ottawa is not paying its fair share of annual health care costs.\n\nThe federal government this year will transfer to the provinces nearly $42 billion for health care, under an arrangement that sees the transfer increase by at least three per cent each year.\n\nBut the premiers contend that amounts to only 22 per cent of the actual cost of delivering health care and doesn’t keep pace with yearly cost increases of about six per cent.\n\nThey want Ottawa to increase its share to 35 per cent and maintain it at that level, which would mean an added $28 billion this year, rising by roughly another $4 billion in each subsequent year.\n\nIn calculating the federal share, the premiers include only the cash transfers they get from Ottawa. They do not include the billions in tax transfers they also get — essentially tax room vacated by the feds so that provinces and territories can increase their taxes to help pay for health care.\n\nIn a 2008 report, the auditor general of Canada pegged the value of the tax transfer for health care at $12.6 billion.\n\nNor do the premiers include any of the money the federal government has transferred to them specifically to combat the COVID-19 health crisis.\n\nOn top of the annual transfer this year, the federal government has given the provinces an extra $19 billion to help them cope with the fallout from the pandemic, including more than $10 billion specifically for pandemic-related health-care costs.\n\nFinance Minister Chrystia Freeland promised $1 billion more for long-term care homes, which have been hardest hit by the pandemic, in her fiscal update last month.\n\nThe federal government has also spent billions purchasing personal protective equipment, rapid testing kits and lining up purchases of potential vaccine candidates.\n\nTrudeau has noted repeatedly that Ottawa has footed the bill for 80 per cent of all the money spent by governments in Canada to fight COVID-19.\n\nBut the premiers say all that extra money is one-off; what they need is an increase in annual health transfers to ensure stable, predictable, long-term funding.\n\nJoan Bryden, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirusHealthcare",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-10 07:50:00-08:00",
    "title": "Premiers’ demands for long-term health funding increase takes back seat to pandemic – Houston Today",
    "url": [
        "https://www.houston-today.com/news/premiers-demands-for-long-term-health-funding-increase-takes-back-seat-to-pandemic/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}