{
    "authors": [
        "Deb Meissner",
        "Local News"
    ],
    "content": "A locally-sourced gift basket is up for grabs in the annual event promoting Smithers businesses\n\nLocal shoppers who wear plaid and spend more than $10 in a Love Smithers business will have a chance to win a $200 locally-sourced gift basket. (Jim Elliot photo)\n\nPlaid Friday is happening in Smithers Friday, November 27.\n\nEvery year, Love Northern BC takes part in a Plaid Friday campaign. This campaign is designed to support local independent business owners through a variety of Plaid Friday campaigns, contests and social media events.\n\nThe goal is to have community members spend their dollars locally, have some fun wearing plaid and to celebrate the diversity and creativity of local and independent businesses.\n\nPlaid Friday will look different this year and Love Smithers, operated by the Smithers Dictrict Chmber of Commerce, has come up with a locally-sourced gift basket, valued at over $200, for a lucky local shopper to win.\n\nAll shoppers need to do is spend more than $10 at a Love Smithers business, and wear plaid.\n\nPlaid Friday was conceptualized to bring back the days when shopping for friends and family during the holidays was a pleasurable and leisurely activity. Communities and businesses throughout the US and Canada now participate in the campaign.\n\nThe plaid pattern represents weaving the individual threads of small businesses together to create a strong fabric that celebrates the diversity and creativity of independent businesses.\n\nIt also is pretty much the de facto uniform of Northern BC.\n\ncommunity calendarShop Local",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-26 01:30:00-08:00",
    "title": "Plaid Friday offers local shoppers a chance to win – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/community/plaid-friday-offers-local-shoppers-a-chance-to-win/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}