{
    "authors": [
        "Cole Schisler",
        "Trending Now"
    ],
    "content": "There are approximately 13 mink farms in B.C., almost all of which are in the Fraser Valley\n\nPamela Anderson has penned a letter to B.C. Premier, John Horgan, asking him close down fur farms in British Columbia.\n\nAnderson’s letter comes after a COVID-19 outbreak was declared at a Chilliwack mink farm. Test results taken from five mink samples have all been confirmed positive for COVID-19 by the Ministry of Agriculture, Food, and Fisheries. Minks are among a small list of animals that can contract COVID-19.\n\nRELATED: COVID-19 outbreak declared at B.C. mink farm\n\nB.C.’s chief veterinarian has placed the farm under a quarantine order prohibiting the movement of animals and materials from the property. A plan is in place to provide feed and care to the mink during the outbreak. The plan respects the conditions of the quarantine and maintains worker and mink safety.\n\nThe farm was inspected by the chief veterinarian and ministry staff as part of a routine inspection process in September 2020 and was found to comply with all animal welfare and biosecurity standards. The outbreak at this farm is not considered to pose a health risk to other mink farms.\n\nAccording to the BC SPCA, there are 13 mink farms in B.C., almost all of which are in the Fraser Valley. In 2018, over 260,000 mink were killed for fur in B.C.\n\nAnderson implored Horgan to ban fur farms in B.C., saying that consumers, and the fashion industry as a whole, are moving away from fur products. She referenced mink farms around the world that have suffered COVID-19 outbreaks, and said that minks live in ‘filthy, cramped wire cages amid their own waste’.\n\n“The world is a much different place than it was even a few months ago. No one, including minks, deserves to die of COVID-19, and I hope to hear that you will make the lifesaving decision to shut down British Columbia’s mink farms without delay,” Anderson wrote.\n\nHorgan has not yet responded to Anderson’s letter. However, the Ministry of Agriculture, Food, and Fisheries said in a statement that it is looking at strategies to manage COVID-19 outbreaks at mink farms.\n\n“The susceptibility of mink to COVID-19 is a relatively new discovery and we will need to take the time to look at the relevant science and review how other jurisdictions are dealing with outbreaks. Keeping people and animals safe from COVID-19 remains our highest priority,” they said.\n\nRELATED: Pamela Anderson pledges to help build barn for RASTA Sanctuary in Chemainus\n\nAlan Herscovici is the founding editor of truthaboutfur.com, and spoke on behalf of the Canadian Mink Breeders Assocaition (CMBA).\n\nHe said that B.C. mink farms operate under national codes of practice for the care and handling of farmed mink, and denied that mink live in their own waste.\n\n“The reason there’s a wire bottom in the cage is so that the waste falls away from them,” Herscovici said. “The idea that mink live in miserable conditions is such stupidity. The only way you can produce high quality fur is by taking good care of the animals.”\n\nHerscovici also noted that mink farmers have enhanced their bio-security practices to prevent COVID-19 tranmission between humans and mink.\n\n“This is a time we should be supporting our farmers. I think it’s disgraceful that people will take advantage of a serious problem — where mink farmers are working to protect their mink, their familiess, and their livelihoods — and use it as a pretext to attack for their own ideological purposes,” Herscovici said.\n\nRead Pamela Anderson’s entire letter below:\n\n“I hope this letter finds you well. Thank you for all that you’re doing to help keep my fellow Canadians safe during these uncertain times. In light of the news that there’s currently a COVID-19 outbreak on a mink farm in British Columbia, I’m writing to ask that you close down fur farms in the province immediately.\n\nMinks on fur farms all over the world—including in Denmark, Greece, the Netherlands, Spain, and the U.S.—have been infected with the novel coronavirus by workers, and Denmark started killing all 17 million minks on its fur farms after a mutant strain of the virus spread from minks to humans. As you can see in this PETA video of Canadian mink farms, minks are warehoused inside filthy, cramped wire cages amid their own waste. These stressed, injured, and often sick animals are so closely packed together that blood, urine, and excrement can easily contaminate adjacent cages. Not only are these conditions extremely cruel to animals, they also create a perfect breeding ground for deadly diseases.\n\nEven before the pandemic, fur was a dying industry. In recent years, former fur-wearers, including Queen Elizabeth II, have had a change of heart and major fashion brands—including Chanel, Prada, Gucci, and Michael Kors—have ditched fur. More than a dozen countries around the world have shut down fur farms, and the world’s oldest and largest fur auction houses, North American Fur Auctions and Kopenhagen Fur, are exiting the industry.\n\nThe world is a much different place than it was even a few months ago. No one, including minks, deserves to die of COVID-19, and I hope to hear that you will make the lifesaving decision to shut down British Columbia’s mink farms without delay.”",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-08 16:45:00-08:00",
    "title": "Pamela Anderson calls on Horgan to ban fur farming in B.C. after COVID-19 outbreak at Fraser Valley mink farm – Houston Today",
    "url": [
        "https://www.houston-today.com/trending-now/pamela-anderson-calls-on-horgan-to-ban-fur-farming-in-b-c-after-covid-19-outbreak-at-fraser-valley-mink-farm/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}