{
    "authors": [],
    "content": "Sonja learns a cool lesson while getting used to living in real winter again\n\nI remember watching Brenda Mallory quite a few years ago as a stand-up comedian and I was laughing and then I couldn’t stop laughing.\n\nReading her column last week about the election results for the USA, I had a sudden burst of laughing out loud while I was all by myself.\n\nI had to phone my daughter and read her Brenda’s column. She, like Brenda, is not a Trump fan and had felt physical relief at the election results.\n\nIt shows how important good neighbors are.\n\nElena Goddard’s performance in London, England set for Nov. 21, 2020 was cancelled because of a COVID-19 lockdown over there.\n\nElena was born here in Smithers and home-schooled from start to finish: graduating at age seventeen. She won a place at Berkeley College of Music in Boston, Massachussets and majored in songwriting and production completing a four-year program in three, graduating with honours.\n\nShe has grit with her talent and is an inspiration, at this time, for parents wondering if home schooling could work.\n\nFor her graduation present, her dad, Keith Goddard, bought her a backpack and they hiked Mt. Edziza. He thought she was journaling along the way. They were each carrying a load they had carefully weighed out. Startlingly, she was finishing Grade 10 music theory — not even mentioning she had some extra books in her backpack.\n\nI have spent most of my winters for the last several years south of the border and I have forgotten how to live in a real winter. Our house numbers had fallen when a tree came down, and I had a delivery of propane coming, so I went to the end of the driveway with the numbers on a paper Safeway shopping bag, a nail and a hammer.\n\nI learned a cool lesson: do not stand directly under a tree that is over-burdened with snow and swing a hammer at it.\n\nTo contribute please call me at 250-847-4414 or 250-643-9749 or send an e-mail to Sonja.lester.b.c@gmail.com.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-26 01:30:00-08:00",
    "title": "Don’t stand under a heavily snow-burdened tree and swing a hammer at it – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/dont-stand-under-a-heavily-snow-burdened-tree-and-swing-a-hammer-at-it/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}