{
    "authors": [
        "Deb Meissner",
        "Local News"
    ],
    "content": "The two story building on the Frontage Road at Main Street will also include micro-suites\n\nCuriosity and speculation are building as the owners of a downtown property anticipate building next spring.\n\nAt its the regular meeting Nov. 24, town council approved the Form and Character Development Permit for a two-storey mixed-use building on the Frontage Road property adjacent to McDonalds and in front of Boston Pizza.\n\nThe next step in the process is the application for a building permit, which will set out an anticipated date to begin building.\n\nThe building is considered part of the downtown core and is therefore required to have an alpine theme.\n\nREAD MORE: Council Briefs: Regular Meeting, November 24, 2020\n\nIncluded with the restaurant plans are one or two micro-suites. The idea is for the owners and manager to be able to live there.\n\n“When we bought the land in 2019, we anticipated having a farmers market to mouth, take-out food, concept for the restaurant,” said Robert Wagner, owner of the land.\n\n“Then COVID-19 hit, building costs went up, and supply issues became more complicated. So, we have been in a wait and see mode.”\n\n“The final drawings for the building, the costs to build, and the cost for the kitchen, and all of the equipment will be finalized in January 2021, and then we can see when it’s feasible to go ahead.”\n\nWagner’s idea is to have a unique restaurant, unlike what you can get at other restaurants currently in Smithers.\n\n“It will be a beautiful building with a mostly glass front, and we would like to take advantage of that by allowing people to see their food being made.”\n\nWagner has been farming in the Suskwa area for more than 20 years and likes the idea of the Saturday Farmers Market in Smithers being so close to the restaurant.\n\n“We want to take advantage of supporting the market and local farms to supply the restaurant’s food and offering healthy fresh fares. We are still fully committed to the project, and the idea of a fresh-only restaurant, but it has to make financial sense.”\n\nREAD MORE: B.C. Farmers Markets move to online platform amid COVID-19 concerns\n\n“We are excited to get the plans in January 2021 from our architect Taylor Versteeg, to see our ideas through, and bring the Bulkley Valley a unique and special new restaurant.”\n\nMore to come.\n\nLocal Business",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "Council approves development application for new Smithers restaurant – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/news/unique-one-of-a-kind-restaurant-planned-for-smithers/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}