{
    "authors": [
        "The Canadian Press",
        "Trending Now"
    ],
    "content": "Parachutes for Pets says it has received 14 letters from children in the last week\n\nMelissa David, of Parachutes for Pets and her dogs Hudson and Charlie are trying to raise money for a homeless shelter that will allow pets and are seen in Calgary, Alta., Thursday, Feb. 6, 2020.THE CANADIAN PRESS/Jeff McIntosh\n\nOne child asks for a coat for her dog in case her family gets evicted. Another girl hopes Santa can bring her pet medication he needs. Another wishes for enough dog food.\n\nA charity that provides subsidized pet care, including food hampers and medical treatment, for low-income residents is receiving Christmas letters from children asking for help for their furry friends.\n\nParachutes for Pets in Calgary has delivered 2,000 pet food hampers since the COVID-19 pandemic hit in March. But demand, especially during the second wave of the pandemic, is taking its toll on both the organization and those receiving help.\n\n“Instead of Santa I wanted to write to you guys. My dog Badger is really cute and my best friend. He needs pills or he gets really, really sick. Could you bring me his pills for my Santa gift? I’ve been really good and so has he,” reads a letter signed Hanna and Badger.\n\nThe organization says it has received 14 letters from children in the last week that normally would have gone to Santa.\n\n“My Christmas wish this year is a coat for my dog Max. Mom says we can’t pay rent after this month and I want Max to be warm if we have to stay in our car,” wrote Kaylee.\n\n“I have a warm coat and I think one would be good for him to stay warm. Please tell Santa this is my only wish. Merry Christmas.”\n\nMelissa David, who founded the charity, said the messages from the kids are heartbreaking.\n\n“Instead of writing to Santa, they’ve written to us. Their Christmas wish is either for their dog to get medication and their dog to get food, so they don’t have to share their meal with them.”\n\nDavid said the charity referred Kaylee’s mom, who was at risk of being evicted, with an agency to deal with her rent arrears.\n\nShe said the charity made it through the first wave of the pandemic, but the resurgence of COVID-19 in the last months has resulted in demands coming at a “fast and furious rate.”\n\n“This second wave is going to cripple us. The amount of additional homeless with pets and domestic violence incidents involving pets is astronomical,” David said.\n\nPeople are still donating food items, she said, but there’s also a need for cash, which is in short supply.\n\n“This (pandemic) in addition to everyday challenges that are still here, such as cancer and illness, is really making it difficult for people to keep their pets at a time they can’t afford mentally to lose them.”\n\nDavid said she is reaching out in desperation since there are limits on what help the charity can arrange.\n\n“We were passed over for most COVID grants because animals were not considered essential.”\n\nThere are also messages asking for help from physically abused women who are afraid to leave their pets behind.\n\n“They want to take their pet with them. They’re at the lowest of lows and they don’t leave with anything but the clothes on their back. And if that pet stays, statistics are 80 per cent that it will be tortured or killed or used as some sort of revenge by the abuser.”\n\nThe head of the Calgary Women’s Emergency Shelter said crisis calls between April and September were up nearly 65 per cent compared with the year before.\n\nShelter CEO Kim Ruse confirms many women stay where they are for fear of their pets being harmed.\n\n“Not having a place for pets to go often stops women from leaving abusive and dangerous situations,” Ruse said. “Many are unaware that there are options for keeping pets safe while finding safety for themselves and their children.”\n\nShe said the agency does have pet-friendly rooms to accommodate small animals.\n\n“Allowing pets in the shelter will help provide emotional and healing support for women and their children during their stay.”\n\nBill Graveland, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-04 09:00:00-08:00",
    "title": "‘My only wish:’ Children asking pet charity to help their furry friends at Christmas – Houston Today",
    "url": [
        "https://www.houston-today.com/trending-now/my-only-wish-children-asking-pet-charity-to-help-their-furry-friends-at-christmas/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}