{
    "authors": [
        "Tom Zillich"
    ],
    "content": "Also featured is the Israeli-made ‘Valley of Tears,’ a 10-part war drama\n\nThe four Hollywood Suite television channels will be free to watch in December and early January, during a five-week “free preview.”\n\nThe HD channels feature “the iconic movies that defined the 70s, 80s, 90s and 2000s, plus essential Hollywood classics from the Golden Age, always uncut and commercial-free,” with on-demand available.\n\nThe Canada-wide free preview period will run from Dec. 1 to Jan. 5.\n\nNew to view is the critically-acclaimed HBO Max Original series, Valley of Tears, a 10-part war drama inspired by the true events of the 1973 Yom Kippur War in Israel. The series will debut Dec. 19 on the “Hollywood Suite ’00s” channel.\n\nDecember is also time for a “Keanussance,” with a number of movies featuring Canadian actor Keanu Reeves. Titles include Bill and Ted’s Excellent Adventure, Speed, The Matrix series, River’s Edge, Bram Stoker’s Dracula and more.\n\nNew episodes of “A Year in Film” will focus on landmark movies of 1975, 1986, 1994 and 2000.\n\nThe free-preview month will also feature “comfort films” for the family, including The Holiday (2006), Grease (1978), Labyrinth (1986), Little Women (1994), The Karate Kid (1984), Adam Sandler’s Eight Crazy Nights (2002), Ella Enchanted (2004), Grown Ups (2010), Pitch Perfect (2012) and The Princess Bride (1987).\n\nHollywood Suite is available to more than 10 million households across Canada, exclusively through TV service providers and Amazon Prime video channels. Visit hollywoodsuite.ca for more details.\n\n\n\ntom.zillich@surreynowleader.com\n\nLike us on Facebook Follow us on Instagram and follow Tom on Twitter\n\nMovies & TV",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-26 10:25:00-08:00",
    "title": "Free ‘Hollywood Suite’ movies in December include ‘Keanussance’ titles starring Keanu Reeves – Houston Today",
    "url": [
        "https://www.houston-today.com/entertainment/free-hollywood-suite-movies-in-december-include-keanussance-titles-starring-keanu-reeves/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}