{
    "authors": [
        "Jenna Hauck"
    ],
    "content": "Justin Louis with Section 35 clothing will present his collection at Indigenous Fashion Week Toronto\n\nJustin Louis of Chilliwack, seen here on Nov. 21, 2020 beside a mural of his wife Inez Louis, is one of the designers who will be featured on Nov. 26 as part of Indigenous Fashion Week Toronto. (Jenna Hauck/ Chilliwack Progress)\n\nAn Indigenous fashion designer from Chilliwack will be in the spotlight on a national level this week.\n\nJustin Louis, co-founder and creative director of clothing company Section 35, is one of 16 designers who will be featured at Indigenous Fashion Week Toronto Nov. 26 to 29.\n\nHe describes Section 35 as “Indigenous street style” clothing.\n\nLouis has five “looks” in the fashion show, and Section 35 will be one of five collections shown in the opening night runway film on Nov. 26.\n\nThe four-day long fashion week will showcase one film per day, each is water themed: Tu Gh’eh Nah (Water Is Life on Nov. 26), Tu Cho (Lake – Nov. 27), Tu Gh’eg Tl’e’th (Streams – Nov. 28), and Tu Gh’el T’ilhn (Water Carriers – Nov. 29).\n\nEach look in his collection (called Miyo Pimatisiwin – The Good Life) has one “statement” piece plus “supporting” pieces, Louis explains.\n\nHis work is inspired by sportswear, but also by his childhood.\n\n“A lot of it’s inspired by my upbringing being Cree from back in Alberta. I’ve made some patterns with syllabics [written characters representing syllables] that I thought turned out pretty cool.”\n\nThe collection also includes custom-made varsity letterman jackets with syllabics and chenille patchwork, plus hand-dyed garments.\n\nHe was scheduled to take part in the biannual event two years ago in its inaugural year, but Louis had to pull out for personal reasons. This year they invited him back.\n\nThe fashion week was supposed to take place during the summer, but because of the pandemic it’s virtual this year. That meant Louis could not fly out there, rather he shipped the garments out to the crew in Toronto.\n\n“Everyone was really amped for this year and with the pandemic pushing everything back, I was really bummed that we couldn’t go out there.\n\n“We did our best to curate them from a distance,” Louis added. “I trust the crew out there because I’ve seen them and I’ve worked closely with them before.”\n\nJustin Louis of Chilliwack, seen here on Nov. 21, 2020 beside a mural of his wife Inez Louis, is one of the designers who will be featured on Nov. 26 as part of Indigenous Fashion Week Toronto. (Jenna Hauck/ Chilliwack Progress)\n\nSection 35 started in late 2013 and is based in East Vancouver, but it didn’t go full bore until early 2016. The name refers to Section 35 of the Constitution Act of 1982, which protects and recognizes Indigenous and treaty rights.\n\nThe company consists of “two and a half” people and the clothing is made in East Van, while most of the designing takes place at Louis’s home office in Chilliwack.\n\nOriginally, Louis never anticipated doing fashion shows, but when they launched their first website in 2016 and began releasing multiple collections consistently throughout the year, runways became part of what they do.\n\nOver the years, he’s shown in Santa Fe, New Mexico, Los Angeles, Vancouver and Calgary.\n\nThe process to present his collection at Indigenous Fashion Week Toronto has been different than any other show. He hasn’t even seen the final runway video of his own work.\n\nLouis did, however, see a sneak peek of the film and said it was “really well done.” He figures he will see the final product on Nov. 26 when everyone else does.\n\n“Unless they send us a final version the day or two before,” he added.\n\nHe’s hoping the exposure will bring new followers, a new audience and more business to Section 35.\n\n“But I also think it’ll inspire me as well to keep creating, and doing what I do, and try and push the boundaries with what’s being done.”\n\nOn Nov. 26 at 7 p.m. EST (4 p.m. PST) folks can watch the opening night runway film featuring the Section 35 collection ‘Miyo Pimatisiwin.’\n\n“I hope they like what they see. There’s a bunch of really talented people on the roster that have been doing it for a while or are up-and-coming. I’m excited for everybody to be there.”\n\nIndigenous Fashion Week Toronto includes runways, a pop-up marketplace, and panels. Incorporating fashion, film, theatre and dance, the filmed runway presentations offer an intimate view of each garment from the 16 designers.\n\nTo watch, go to ifwtoronto.com/events_and_programs/tu-gheh-nah-water-is-life. Admission is free.\n\nALSO READ: Indigenous Hope designer is Paris-bound for world-renowned fashion week\n\nALSO READ: B.C. Indigenous teen model to walk in major Australian fashion show\n\nDo you have something to add to this story, or something else we should report on?\n\nEmail: jenna.hauck@theprogress.com\n\nTwitter: @PhotoJennalism\n\nLike us on Facebook and follow us on Twitter.\n\nFashionIndigenous",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-26 10:04:00-08:00",
    "title": "Indigenous B.C. fashion designer steps onto national stage – Houston Today",
    "url": [
        "https://www.houston-today.com/entertainment/indigenous-b-c-fashion-designer-steps-onto-national-stage/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}