{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "Vanderbilt’s Sarah Fuller, right, kicks off as Ryan McCord (27) holds to start the second half of an NCAA college football game against Missouri Saturday, Nov. 28, 2020, in Columbia, Mo. With the kick, Fuller became the first female to play in a Southeastern Conference football game. (AP Photo/L.G. Patterson)\n\nVanderbilt’s Sarah Fuller became the first woman to participate in a Power Five conference football game when she kicked off to start the second half against Missouri on Saturday in Columbia, Mo.\n\nFuller kicked off the turf with a holder rather than using a tee, and she sent a low kick to the 35-yard line where it was pounced on by Missouri’s Mason Pack. Fuller didn’t get any opportunities in the first half as the Tigers opened a 21-0 lead over the Commodores. Missouri won 41-0.\n\nFuller, a senior goalkeeper on the Vanderbilt soccer team, joined the football team this week after helping the Commodores win the Southeastern Conference Tournament last weekend. COVID-19 protocols and restrictions left Vandy football coach Derek Mason with a limited number of specialists available against Missouri. Mason reached out to soccer coach Darren Ambrose for some help.\n\nFuller agreed to give football a try and practised with the winless Commodores before making the trip to Missouri. She wore “Play Like A Girl” on the back of her helmet.\n\n\"I just want to tell all the girls out there that you can do anything you set your mind to, you really can. And if you have that mentality all the way through, you can do big things.\" Sarah Fuller is an inspiration 🙌 pic.twitter.com/rUi1hJYap9 — SEC Network (@SECNetwork) November 28, 2020\n\nNo woman had appeared in an SEC football game or for any Power Five team. Liz Heaston became the first woman to score with two extra points for Willamette in NAIA on Oct. 18, 1997.\n\nKatie Hnida was the first woman to score at the Football Bowl Subdivision level with two extra points for New Mexico on Aug. 30, 2003.\n\nREAD MORE: Vancouver Islander among first group of women inducted into B.C. Football Hall of Fame\n\nApril Goss was the second with an extra point for Kent State in 2015. Tonya Butler was the first woman to kick a field goal in an NCAA game for Division II West Alabama on Sept. 13, 2003.\n\n“Let’s make history,” she wrote Friday on Twitter with a photo of herself wearing a football jersey with a soccer ball between her feet while holding a football in her hands.\n\nTHE ASSOCIATED PRESS\n\nLike us on Facebook and follow us on Twitter\n\nCollege sportsFootballsoccer",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-28 13:30:00-08:00",
    "title": "Vanderbilt K Fuller becomes first woman to play in NCAA’s Power 5 football conference – Houston Today",
    "url": [
        "https://www.houston-today.com/sports/vanderbilt-k-fuller-becomes-first-woman-to-play-in-ncaas-power-5-football-conference/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}