{
    "authors": [
        "Jenna Hauck",
        "Trending Now"
    ],
    "content": "Mountain Day, Dewey Decimal System Day and Lard Day are all coming up this week\n\nA snow moon rises over Mt. Cheam in Chilliwack on Feb. 8, 2020. Friday, Dec. 11, 2020 is Mountain Day. (Jenna Hauck/ Chilliwack Progress file)\n\nEvery day of the year there are unofficial (and often weird and entertaining) holidays celebrated by groups and individuals around the world.\n\nAnd it’s not just one unique thing to celebrate each day. On any given day of the year, there are several to choose from.\n\nThere are also weekly and monthly celebrations. In December, for example, folks all over the globe are celebrating Operation Santa Paws and Pear Month.\n\nHere are some of the unofficial holidays for the coming week:\n\nSunday, Dec. 6: Microwave Oven Day, Put on Your Own Shoes Day, Mitten Tree Day, St. Nicholas Day.\n\nMonday, Dec. 7: Pearl Harbor Remembrance Day, Cotton Candy Day, Walt Disney Day.\n\nTuesday, Dec. 8: Brownie Day, Lard Day, Pretend to Be a Time Traveller Day.\n\nWednesday, Dec. 9: Christmas Card Day, Pastry Day, International Day of Veterinary Medicine.\n\nThursday, Dec. 10: Dewey Decimal System Day, Lager Day, Human Rights Day.\n\nFriday, Dec. 11: Mountain Day, Noodle Ring Day, Official Lost and Found Day, Have a Bagel Day.\n\nSaturday, Dec. 12: Gingerbread House Day, Poinsettia Day, Shareware Day.\n\nCheck back regularly for upcoming lists of international unofficial holidays.\n\nREAD MORE: Unofficial holidays: the weird and wonderful things people celebrate around the world\n\nDo you have something to add to this story, or something else we should report on?\n\nEmail: jenna.hauck@theprogress.com\n\nTwitter: @PhotoJennalism\n\nLike us on Facebook and follow us on Twitter.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-05 05:30:00-08:00",
    "title": "Unofficial holidays: Here’s what people are celebrating for the week of Dec. 6 to 12 – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/trending-now/unofficial-holidays-heres-what-people-are-celebrating-for-the-week-of-dec-6-to-12/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}