{
    "authors": [
        "Ashley Wadhwani",
        "Trending Now"
    ],
    "content": "The ranch, which borders both sides of Washington State’s Elwha River, is a hotspot for chinook salmon\n\nThere is new-found hope for the dwindling population of southern resident killer whales which reside part-time off B.C.’s coast, and it comes in the form of a 45-acre salmon ranch.\n\nDubbed BIG SALMON Ranch, the Center of Whale Research purchased the farm in October 2020, but only announced it Wednesday (Dec. 2).\n\nThe ranch, which borders both sides of Washington State’s Elwha River, is a hotspot for chinook salmon to spawn.\n\nThe goal is to take full advantage of the salmon abundance as it flows from Olympic National Park into the Strait of Juan de Fuca where the southern resident orcas often feed.\n\nKen Balcolmn, Center of Whale Research founder and senior scientist, says that approximately 7,400 chinook recently returned to the Elwha, creating roughly 900 nests, called “redds” each of which contained 5,000 fertilized eggs.\n\n“Optimally, over four million baby chinook smolts will be produced by the Elwha,” he said. “By 2024, this could result in 80,000 to 250,000 returning adult chinook salmon for the whales and ocean fishers to catch.”\n\nLatest statistics estimate that there are 74 southern resident killer whales left in the world. The species lives along B.C.’s coast and travels as far south as California through the year.\n\nPHOTOS: 2nd calf in a month confirmed among Southern Resident killer whale pod\n\n@ashwadhwani\n\nashley.wadhwani@bpdigital.ca\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nSouthern Resident Killer Whales",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-02 11:30:00-08:00",
    "title": "Non-profit buys Chinook ranch in hopes of increasing feed for southern resident killer whales – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/trending-now/non-profit-buys-chinook-ranch-in-hopes-of-increasing-feed-for-southern-resident-killer-whales/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}