{
    "authors": [
        "Katya Slepian",
        "Trending Now"
    ],
    "content": "Whether it was getting fit or ‘speaking moistly,’ Canadians had time to spare this year\n\nWere you glued to your screen in the early months of the pandemic? Or are you still?\n\nWell, you’re not alone, according to YouTube trends expert Zaitoon Murji.\n\n“We definitely saw more people come to YouTube this year to deep dive into issues,” Murji told Black Press Media by phone.\n\n“What we saw, mostly, is that Canadians came to YouTube for content that met a specific personal need.”\n\nThe top three reasons? To laugh, learn a new skill or to stay informed about what was happening around the world in 2020.\n\nThe year’s top video certainly reflects the abundance of time that many Canadians had as they locked down, isolated and tried to get through the pandemic.\n\n“The top video this year was an eight-part Ninja Warrior course to prevent squirrels from getting into a bird feeder,” Murji said.\n\n“That might not be the type of video someone might make when they didn’t have so much time on their hands.”\n\nThat video, recorded by former NASA engineer Mark Rober, has had more than 50 million views since it was posted near the end of May.\n\nThe third video on YouTube’s list of top trending videos was a parody video of a phrase that has made it onto masks, T-shirts and into the collective Canadian imagination this year.\n\nThat video was “actually a parody video someone made from a press conference of Prime Minister Trudeau,” Murji said.\n\nThat phrase?\n\n“Speaking moistly,” Trudeau said, perhaps not on purpose, during a press conference in April.\n\n“It was an example of people trying to find humour in a really serious moments,” Murji added.\n\nThe second video on the list of trending ones was, perhaps to no surprise to many, about gaming.\n\n“This was a very big year for gamers,” she said. While streaming replaced what may have been live events in a pre-pandemic world, it also met another need: connection.\n\n“Watching different creators do different gaming runs and then being able to implement or practice your own at home with that free time you did have.”\n\nBut some of the viewing took a more serious turn. A Dave Chappelle video titled simply “8:46” came out in the aftermath of George Floyd’s death at the hands of Minneapolis police and in the midst of Black Lives Matter protests.\n\n“It’s an example of the ways Canadians were looking to learn more about racial justice this year,” Murji said.\n\nBut while Canadians were watching a lot more videos, they were also trying to not spend their whole year on their couches, and no YouTube creator demonstrates that more than MadFit, whose channel grew exponentially in 2020.\n\nAlso known as Maddie Lymburner, the Ontario-based creator got people moving, grooving and doing their squats in 2020.\n\n“She really took her channel and adapted it so that she was able to provide her online community with what they needed,” Murji said.\n\n“Whether that was doing workouts in a condo-sized space or trying a workout at with home products… knowing that most people didn’t have workout equipment at home.”\n\nAnd as the pandemic continues for its ninth month, Murji said there’s been a bit of a shift in the videos blowing up on YouTube.\n\n“Earlier this year, we saw a lot of ‘workout with me, cook with me, clean with me,’ that was really strong on the platform,” she said.\n\n“The way we saw that change a little bit is it turns into ‘find a way with me… find a way to cope with me, find a way to meditate with me.’ It shifted a little bit in that the need for connection became even stronger.”\n\nALSO READ: Sorry, Grinch. Virus won’t stop NORAD from tracking Santa\n\n@katslepian\n\nkatya.slepian@bpdigital.ca\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirusYouTube",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-02 12:00:00-08:00",
    "title": "What did Canadians watch on Youtube during isolation? Workouts, bird feeders – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/trending-now/what-did-canadians-watch-on-youtube-during-isolation-workouts-bird-feeders/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}