{
    "authors": [
        "The Canadian Press"
    ],
    "content": "Whether any of the Juno events can be held indoors is yet to be determined\n\nSeveral Juno award statues sit in the photo room before the awards show, in Ottawa, Sunday, April 2, 2017. THE CANADIAN PRESS/Sean Kilpatrick\n\nThe 2021 Juno Awards are moving into May for their 50th anniversary.\n\nOrganizers behind Canada’s biggest night in music say the golden celebration, set to take place in Toronto, is being pushed to a later date due to the COVID-19 pandemic.\n\nThe televised show will take place on May 16, 2021, about a month and a half after its originally planned date in March.\n\nAllan Reid, head of the Canadian Academy of Recording Arts and Sciences, says the move is intended to give artists and the local community more options to celebrate in a time when physical distancing measures are expected to still be in place.\n\n“We also hope that the warmer weather will bring more opportunities for some unique outdoor programming,” he said in a press conference.\n\n“The COVID-19 pandemic continues to have a huge effect on the city and our music community, but we will be resilient and live music will return, and we will be there to help in any way we can.”\n\nThe return of the Juno Awards to Toronto, for the first time in a decade, was expected to be an especially splashy affair, with many past honourees returning for the momentous occasion, which was slated to be held inside the Scotiabank Arena.\n\nWhether any of the Juno events can be held indoors is yet to be determined, Reid said.\n\nThe organization also stopped short of announcing plans for Juno Week, a series of concerts and events leading up to the broadcast that in other years have proven to be a business boon for local bars and concert halls.\n\nA new look for the Juno statuette was also unveiled for its anniversary.\n\nThe updated design takes inspiration from designer Shirley Elford’s human-shaped molten-glass award, first handed out in 2000, but comes in three different versions.\n\nThe gold Juno will be given to Juno Award winners, while a silver version is for recipients of a special Juno prize, and a gold and silver variation is for Canadian Music Hall of Fame inductees.\n\nDavid Friend, The Canadian Press\n\nCoronavirusMusic",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-01 12:55:00-08:00",
    "title": "Juno Awards move Toronto show date to May 16, 2021 amid COVID-19 pandemic – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/entertainment/juno-awards-move-toronto-show-date-to-may-16-2021-amid-covid-19-pandemic/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}