{
    "authors": [
        "Marisca Bakker",
        "Local Entertainment"
    ],
    "content": "A Mountain of Change 1960-2020 has been in the making for over two years\n\nA book on the history of Hudson Bay Mountain will be ready to purchase soon.\n\nA Mountain of Change 1960-2020 took four women more than two years to put together and they are hoping it will make the perfect Christmas gift.\n\n“We are really excited to finally get it out into the hands of people to comb through and see what two and half years worth of work looks like,” said one of the authors, Connie Scott.\n\n“It is hard to put 60 years of life on a mountain on to 222 pages. I think we have as many pictures as text, it is just packed full what we hope people will look through and just recognize friends and fellow adventurers and it will bring the mountain back to them.”\n\nThe group went through newspaper and museum archives, ski corporation minutes, Ski Smithers scrapbooks and photo collections. They also interviewed community members and heard plenty of stories.\n\n“There was some innocence,” admitted Scott. “I had no idea the extent to what this book would turn into. I thought it was writing the history. I was assigned a 20-year chunk as was two other women. When we finished that, I thought that was it, but of course, the mountain is so much more than its history. It has turned into a cabin colony, many sports have been born and explored on the mountain, the social clubs, it just goes on and on.”\n\nThe book will be available in early December. It is currently at the printers and then it will be sent out to be bound.\n\n“We already have a list of preorders and we have books that will be sending out, some as far as Australia and the Carolinas. There has been an incredible response and the book isn’t even out yet,” she said.\n\nLocations to purchase it will be announced soon. She is also hoping to have copies for sell at the Hudson Bay Mountain Resort’s downtown office as well as on the ski hill.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-26 01:30:00-08:00",
    "title": "A book on the history of Hudson Bay Mountain to be released before Christmas – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/entertainment/a-book-on-the-history-of-hudson-bay-mountain-to-be-released-before-christmas/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}