{
    "authors": [
        "Marisca Bakker",
        "Local Entertainment"
    ],
    "content": "Lower Mainland filmmaker hopes to turn movie released last year about the Hazelton’s legendary Simon Gunanoot into a series. (Screen capture)\n\nThe producer of a short film inspired by a true story set in Hazelton in 1908 is hoping to turn it into a series.\n\nThe film, Shadow Trap, is about a failed prospector, desperate for money who decides to go out looking for Simon Gunanoot, an outlaw with a hefty reward on his head. The journey takes him into the Skeena Mountains during a brutally cold winter where the hunter becomes the hunted.\n\nThe film debuted at the 2019 Vancouver Film Festival.\n\nDamien Gillis who also co-directed the film said this 17-minute film is only the beginning.\n\n“It is one of the most fascinating stories in B.C. history,” he said.\n\nThe idea and support to start the film happened while he was making another film called Fractured Land, a documentary focusing on resource extraction through the eyes of a young Indigenous lawyer who walks in two different worlds, while also trying to protect his family’s connection to the land.\n\nGillis spent a lot of time in the region making that film and has family in northern B.C.\n\n“I spent a lot of time in the north as a kid hearing interesting stories about the north,” he said.\n\n“I kept hearing about the legend of Simon Gunanoot.”\n\nIn 2015, Fractured Land won an award at Vancouver International Film Festival and with that, it carried prize money to write a script for another film.\n\n“I thought this was a great opportunity to look into this story that I had been hearing so much about and kind of fallen in love with,” he said.\n\n“The first thing I did was meet with the decedents of Gunanoot in Hazelton.”\n\nHe did a lot of research and said the family was supportive of him telling the story.\n\n“It is very important to our whole team that we work in connection with the family, it is their story, he said. “Everything I’ve done with the film has had that in mind. I also brought on several Indigenous filmmakers early on in the process of making this short film. As a settler filmmaker, it isn’t my story to tell.\n\n“We put together a great team including my co-director Michael Bourquin, who is part Talhtan and part Gitxsan and lives in South Hazleton where this story is set.”\n\nIn the film, Simon Gunanoot is played by Hazelton’s own (and former Interior News reporter) Jermone Turner.\n\nGillis said the intention of this short film was a launching point for a series. He is hoping to move forward with the project into development next year.\n\nHe said there is huge appetite for good storytelling that is local and has its roots in the community the story is set in.\n\n“As well as Indigenous stories, there are some fantastic Indigenous filmmakers that are working today that have an opportunity to tell stories to a wider audience,” he added.\n\nHis goal is to eventually set back from the creative side and be sure that the story is being told by Indigenous story tellers.\n\nWhile Shadow Trap was film in Barkerville, Gillis is hoping to film the new series in the Hazelton region.\n\n“We filmed in Barkerville because of the good snow conditions, the perfectly preserved town with historical buildings from the correct period, and access to local dog sleds teams,” he said.\n\nBut the crew wants to ensure maximum authenticity moving forward and have as much benefit to the Gunaoot family and the surrounding community as possible while also leaving a positive legacy.\n\nShadow Trap can be viewed on the Crave TV app.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-19 01:30:00-08:00",
    "title": "The legend of Simon Gunanoot to be turned into a series – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/entertainment/the-legend-of-simon-gunanoot-to-be-turned-into-a-series/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}