{
    "authors": [
        "Associated Press"
    ],
    "content": "Host Dave Chappelle opened his monologue by lighting a cigarette and calling it ‘a pretty incredible day’\n\nJim Carrey as President-elect Joe Biden and Maya Rudolph as Vice President-elect Kamala Harris in the Nov. 7, 2020, episode of “Saturday Night Live.” (Twitter)\n\nIt didn’t take long for “Saturday Night Live” to come up with its comedic take on the presidential election results — complete with Maya Rudolph donning a white suit like Vice-President-elect Kamala Harris wore for her acceptance speech.\n\nJim Carrey played President-elect Joe Biden, taking the stage and poking fun at the five-day wait for results. He even offered a throwback to one of his infamous ’90s-era lines, calling President Donald Trump a “Looooosseer!” to laughs and applause.\n\nCarrey and Rudolph each made an L out of their hands and held them to their foreheads and were joined by Alec Baldwin, reprising his role as Trump.\n\nAt one point, Baldwin sat at a piano and sang a few lines from Village People’s “Macho Man,” a favourite of the president’s late campaign rallies.\n\nHost Dave Chappelle opened his monologue by lighting a cigarette and calling it “a pretty incredible day.”\n\nHe quickly got serious, saying he was thinking about his great-grandfather, who was born a slave in South Carolina and after being freed, devoted his life to three things: “education, freedom of Black people and Jesus Christ.”\n\n“I wish I could see him now, I wish he could see me,” Chappelle said before launching into a joke about how his popular Comedy Central series was on two streaming services and he wasn’t being paid for it.\n\n“Now Trump is gone,” Chappelle said, before joking about Trump’s response to the coronavirus. He cited Trump’s use of a racist name for the virus before saying, “I’m supposed to say that, not you.”\n\n“Saturday Night Live” aired a little over 12 hours after networks and The Associated Press declared Biden the winner of the 2020 election. The show quickly incorporated Harris’ look from her and Biden’s acceptance event.\n\nJoe and Kamala have a message for Donald Trump. pic.twitter.com/ybrPtFAyQM — Saturday Night Live – SNL (@nbcsnl) November 8, 2020\n\nThe highly-anticipated episode was delayed by the Clemson-Notre Dame game, which ran into double overtime, and in many markets, local news broadcasts.\n\nChappelle hosted “SNL” in November 2016 in its first episode after Trump’s election, pointedly critiquing the surprise over the result.\n\n“You know, I didn’t know Donald Trump was going to win the election,” Chapelle said four years ago. “I did suspect it. It seemed like Hillary was doing well in the polls and yet, I know the whites. You guys aren’t as full of surprises as you used to be.”\n\n“SNL” has regularly lampooned Trump and his presidency in recent years, enlisting Baldwin to play the commander in chief.\n\n“I don’t believe I’ve ever been this overjoyed to lose a job before,” Baldwin tweeted earlier Saturday.\n\n___\n\nThe Associated Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nDonald TrumpJoe BidenUSA",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-08 11:15:00-08:00",
    "title": "Jim Carrey, as Biden, mocks Trump loss on ‘SNL’ – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/entertainment/jim-carrey-as-biden-mocks-trump-loss-on-snl/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}