{
    "authors": [
        "Associated Press",
        "Canada"
    ],
    "content": "Vancouver Canucks’ Brandon Sutter (20) is stopped by Vegas Golden Knights goalie Robin Lehner (90) during third period NHL Western Conference Stanley Cup playoff action in Edmonton on Friday, September 4, 2020. THE CANADIAN PRESS/Jason Franson\n\nA far cry from the standings at Thanksgiving serving as a barometer of which teams are most likely to make the playoffs, the NHL heads into the U.S. holiday without a firm plan announced for next season.\n\nThe league and players are running out of time to start the season Jan. 1 as previously planned, with various pandemic-related problems standing in the way. There is uncertainty on many fronts.\n\n“The landscape is — there’s a lot of unknowns associated with where we’re going in the immediate future,” Boston Bruins general manager Don Sweeney said Monday. “Hopefully things, with all the positive news associated with vaccines and a hopeful climate that could potentially exist that we get back on track. But we have some ground to cover.”\n\nSome of the groundwork is already in place. Realignment featuring an all-Canadian division and regional play in the U.S. appears likely and should push the thorny issue of cross-border travel back to the playoffs. The NHL and NHL Players’ Association also agreed to a long-term extension of the collective bargaining agreement last summer to get hockey through the pandemic.\n\nBut with virus cases surging across North America and the prospect of an even bigger revenue shortfall than owners originally feared, questions have arisen about amending that agreement, which has put the start of the season in peril.\n\nPLAYER SALARIES\n\nMuch like Major League Baseball’s struggle to start the 2020 season, it’s all about the money. The CBA — which now runs through 2026 — ensures a 50/50 split of hockey-related revenue; includes players deferring 10% of their salary for the upcoming season; and puts a cap on how much money will be kept in escrow over the length of the deal.\n\nLess than five months since the CBA agreement, the league has asked players to increase salary deferrals to 20% or 26% and increasing the escrow caps, according to a person with knowledge of the discussions who spoke to The Associated Press on condition of anonymity because neither side is publicly announcing details of negotiations.\n\nAssuming the season is shorter than a full 82 games, players could balk at taking pro-rated salaries while escrow amounts are increased.\n\nSTART DATE\n\nThe two sides have targeted Jan. 1 to start the season. Some steps need to be taken soon for that to happen.\n\nA training camp of roughly two weeks would need to precede opening night. The later the season starts, the fewer games there might be. There could be as few as 50 or as many as 70-plus games for each team, with the stipulation that the Stanley Cup should probably be awarded before the Summer Olympics open in Tokyo on July 23.\n\nVIDEO: Canucks unveil redesigned jersey as part of NHL’s ‘Reverse Retro’ collection\n\n“What starts with me is: Let’s get the season started,” Nashville general manager David Poile said. “I’m up for however it looks. Whatever the league and the PA think is the best way to get us back playing, whether it’s with fans, some fans, no fans, TV being (more) relevant, if you will. Whatever it takes to get this season going and get it in place.”\n\nREALIGNMENT\n\nA division made up of the seven teams based in Canada — Montreal,, Toronto, Ottawa, Winnipeg, Calgary, Edmonton and Vancouver — makes the most sense given the border with the U.S. is closed to nonessential travel through Dec. 21 and possibly beyond. Bettman said earlier this month the NHL isn’t moving those seven teams south of the border “so we have to look at alternative ways to play.”\n\nREAD MORE: NHLers weigh in on the idea of an all-Canadian division: ‘It would be pretty unique’\n\nIf there was one Canadian division, three U.S. divisions to cut down on long-distance travel might look like this, though discussions are ongoing and nothing has been finalized:\n\n— A division with Arizona, Los Angeles, Anaheim, San Jose, Vegas, Colorado, Dallas and either Minnesota or St. Louis.\n\n— A division with St. Louis or Minnesota, Chicago, Nashville, Detroit, Columbus, Carolina, Tampa Bay and Florida.\n\n— A division with Pittsburgh, Philadelphia, Washington, New Jersey, Boston and all three New York teams.\n\nPlayoffs in the same divisions would determine the final four playing for the Stanley Cup.\n\n“Whatever it looks like, to me, I know it’ll be well thought out,” Poile said. “I just don’t know what it’s going to look like right now.”\n\nVIRUS CONCERNS\n\nMultiple Columbus Blue Jackets and Vegas Golden Knights recently tested positive for the coronavirus. Team facilities are open for voluntary workouts with protocols in place, though those teams had to close off-ice areas.\n\nAfter the NHL constructed tight bubbles for the post-season amid the summer surge, players testing positive — and how to deal with that like other leagues have — might be a factor early in 2021.\n\n___\n\nStephen Whyno And John Wawrow, The Associated Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirusNHL",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-25 07:45:00-08:00",
    "title": "Time running short for NHL to start next season Jan. 1 – Houston Today",
    "url": [
        "https://www.houston-today.com/sports/time-running-short-for-nhl-to-start-next-season-jan-1/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}