{
    "authors": [
        "The Canadian Press"
    ],
    "content": "FILE - In this file photo dated April 20, 1964, James Bond, alias, Sean Connery, finds himself in a sticky situation with actress Shirley Eaton at Pinewood Studios, near London. Miss Eaton was given a liberal coating of gold paint for a scene in the latest Bond thriller “Goldfinger,” with unidentified woman at top. Scottish actor Sean Connery, considered by many to have been the best James Bond, has died aged 90, according to an announcement from his family. (AP Photo/Victor Boynton)\n\nScottish actor Sean Connery, the first actor to play James Bond on film and for many fans the best, has died. He was 90.\n\nBond producers EON Productions confirmed his death, first reported by the BBC. Producers Michael G. Wilson and Barbara Broccoli said they were “devastated by the news.”\n\n“He was and shall always be remembered as the original James Bond whose indelible entrance into cinema history began when he announced those unforgettable words — ‘The name’s Bond… James Bond,’” they said in a statement.\n\nThe producers said Connery’s “gritty and witty portrayal of the sexy and charismatic secret agent” was largely responsible for the success of the series.\n\nThe Scottish actor rose to international superstardom as the suave and fearless secret agent, first playing Bond in “Dr No” in 1962. After a further four films, he abandoned the role, before being enticed back to play him twice more, finally in 1983’s “Never Say Never Again.”\n\nSir Sean Connery has died at the age of 90. He was the first actor to play James Bond on the big screen in Dr. No in 1962, From Russia With Love, Goldfinger, Thunderball, You Only Live Twice and Diamonds Are Forever followed. pic.twitter.com/VaFPHCM5Ou — James Bond (@007) October 31, 2020\n\nWhile he will be most remembered for his portrayal of Bond, Connery enjoyed a varied career, which included the best supporting actor Oscar for his portrayal of a tough Irish street cop in the 1987 movie “The Untouchables.”\n\nHe also had major roles in films including “Indiana Jones and the Last Crusade,” “Highlander” and “The Hunt for Red October.”\n\nScottish First Minister Nicola Sturgeon said she was “heartbroken” at the news.\n\n“Our nation today mourns one of her best loved sons,” she said.\n\nHe was knighted by Queen Elizabeth II in 2000 for services to film drama and in 2005 he was chosen for a lifetime achievement award by the American Film Institute.\n\nThomas Sean Connery was born Aug. 25, 1930, in Edinburgh, Scotland, the first of two sons of a long-distance truck driver and a domestic worker.\n\nHe left school at age 13 during World War II to help support his family.\n\n“I was a milkman, labourer, steel bender, cement mixer — virtually anything,” he said.\n\nWeary of day labour, he joined the British navy and was medically discharged after three years. The ailment: stomach ulcers.\n\nBack in Edinburgh, he lifted weights to build his body and compete in the Mr. Universe contest. He came in third, briefly considered becoming a professional soccer player, but chose acting because he reasoned his career would last longer.\n\nREAD MORE: James Bond film release pushed back due to coronavirus\n\nHe got his first big break singing and dancing to “There is Nothing Like a Dame” in “South Pacific” on the London stage and in a road production before going on to act in repertory, television and B movies.\n\nHe went to Hollywood for two early films, Disney’s “Darby O’Gill and the Little People” and “Tarzan’s Greatest Adventure.”\n\nWhen he decided to become an actor, he was told that Thomas Sean Connery wouldn’t fit on a theatre marquee so he dropped his first name.\n\nThen came the audition that changed his life. American producers Albert “Cubby” Broccoli and Harry Saltzman had bought the film rights to a string of post-World War II spy adventure novels by Ian Fleming.\n\nConnery was not their first choice for “Dr. No.” The producers had looked to Cary Grant, but decided they wanted an actor would commit to a series. The producers also realized they couldn’t afford a big-name star because United Artists had limited their film budget to $1 million a picture, so they started interviewing more obscure British performers.\n\nAmong them was the 6-foot-2 Connery. Without a screen test, Broccoli and Saltzman chose the actor, citing his “dark, cruel good looks,” a perfect match for the way Fleming described Bond.\n\nIt’s the way many will always remember Bond.\n\nFor more news from B.C. and beyond delivered daily into your inbox, please click here.\n\nJill Lawless And Hillel Italie, The Associated Press\n\nLike us on Facebook and follow us on Twitter\n\nArts and EntertainmentMoviesObituaries",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-10-31 06:30:00-08:00",
    "title": "Actor Sean Connery, the ‘original’ James Bond, dies at 90 – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/entertainment/actor-sean-connery-the-original-james-bond-dies-at-90/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}