{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "Boston Celtics’ Marcus Smart (36) moves around Toronto Raptors’ Serge Ibaka (9) in the second half of an NBA conference semifinal playoff basketball game Thursday, Sept 3, 2020, in Lake Buena Vista Fla. (AP Photo/Mark J. Terrill)\n\nHe may be leaving Toronto, but Serge Ibaka says he’ll always be a Raptor.\n\nThe 31-year-old took to social media Sunday to dole out thanks for his time with the team, saying “the love I have received on this journey I will never forget.”\n\n“I’ve had great teammates, front office and staff next to me. And of course, a fan base that is second to none,” said the post, which accompanied a black and white photo of Ibaka walking off the court and into a plethora of outstretched hands.\n\n“So thank you Toronto. Thank you, Canada. And thank you Raptors. I am one of yours forever. #WeTheNorth.”\n\nHis message comes amid multiple reports that Ibaka, a free agent, has signed a two-year, US$19-million contract with the Los Angeles Clippers.\n\nThe seven-foot forward came to Toronto in a trade with the Orlando Magic in 2017, and played a crucial role in helping the squad win its 2019 championship title.\n\nIbaka said in his post that he felt “at home from day one.”\n\n“I feel really blessed to have played for this city, these fans, and this organization,” he said.\n\n“It is really a great organization that takes care of its players and I’m thankful that I became an NBA Champion with them.”\n\nHow to explain what Toronto, Canada, and the Raptors mean to me? I was welcomed to a new country and a new team more than three years ago and I felt at home from day one. I feel really blessed to have played for this city, these fans, and this organization. pic.twitter.com/ptCtzVCs0c — Serge Ibaka (@sergeibaka) November 22, 2020\n\nIn 2017, he signed a three-year, US$65-million contract with the Raptors, cementing his place as Toronto’s centre.\n\nIbaka averaged 15.4 points per game and 8.2 rebounds a game with the Raptors last season.\n\nHe’s also well-known for his off-court personality, the Mafuzzy Chef, who gained notoriety for the YouTube series “How Hungry Are You?” where he cooked unique meals — including fried snake and a sandwich made of bull testicles — for his teammates and other NBA stars.\n\nHailing from the Republic of Congo, Ibaka was picked 24th overall by the Oklahoma City Thunber in the 2008 NBA draft after spending time playing basketball in Spain.\n\nREAD MORE: VanVleet staying with Raptors on 4-year deal\n\nThe Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nNBA",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-22 16:00:00-08:00",
    "title": "‘I am one of yours forever,’ departing Serge Ibaka tells Toronto Raptors fans – Houston Today",
    "url": [
        "https://www.houston-today.com/sports/i-am-one-of-yours-forever-departing-serge-ibaka-tells-toronto-raptors-fans/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}