{
    "authors": [
        "Jake Wray",
        "Local Business"
    ],
    "content": "The delivery service took off in Terrace and has since expanded to Smithers and Prince Rupert\n\nThere have been food delivery apps, such as Skip the Dishes and Uber Eats, in big Candian cities for a few years now, but no such service existed in the Smithers prior to 2020.\n\nThen, early in the year, an app burst onto the Terrace scene and has now expanded into Smithers — just in time for the COVID-19 pandemic. SPYCE is owned and operated by two young men from Smithers.\n\nThe concept behind this kind of app is straightforward. They provide a delivery service for restaurants and other establishments (fast food, liquor stores etc.) that do not have dedicated delivery services. Plus the apps feature maps that show the delivery driver’s location and other such digital conveniences.\n\nSPYCE is owned by cousins Rick Meima and Jacob Kort, both 28, who are originally from Smithers and now call Terrace home. They’ve dreamed of owning a business together ever since Meima moved to Canada from the Netherlands when both were in ninth grade.\n\n“Back then it was computer repair. We made this little sign out of plywood, and drew the mountain on it and stuff,” Meima said as they both chuckled.\n\nIn January and February of this year, the pair were spending a lot of time on the road as part of their job doing maintenance on ATMs and lotto ticket machines throughout the Northwest. That’s when they began to envision bringing a food delivery app to the area.\n\nMeima handled the coding of the app, although he had only minimal coding experience and learned as he went. Kort handled the client side, calling restaurant owners to get them on board with the app.\n\nKort said that restrauteurs were nervous at first about paying for SPYCE’s services because they were worried about adding extra expense just as the pandemic was picking up speed, but eventually some owners signed on.\n\n“I think during COVID, a lot of restaurant owners were nervous,” Kort said. “[But] you look at the statistics on how many restaurants have closed across B.C. and Canada during this pandemic, and this [app] was an opportunity for them to stay open.”\n\nThe app officially launched in April, but there were some bugs and hitches at first.\n\n“It’s funny, because the first order that we did, we didn’t even have the order total for the driver showing up,” Meima said. “”So the driver showed up at the customer’s house and is like ‘uhhh, what do I charge this customer?’”\n\nThe community responded warmly and business increased rapidly.\n\nMeima and Kort have since expanded their service to Prince Rupert and Smithers. They also began offering a grocery delivery service.\n\nThe pair said SPYCE fully embraces COVID-19 safety precautions. Drivers wear masks when appropriate and use hand sanitizer. Another method they use to keep customers safe is they don’t stack deliveries — Kort gave the example of a hypothetical pizza joint that waits until there are 10 pizza orders, then one driver takes one trip to deliver to 10 homes. SPYCE doesn’t do it that way. Each order is delivered individually, which helps reduce risk, Kort said.\n\nThe SPYCE guys said they want folks to know that SPYCE is not corporate.\n\n“It’s literally Rick and I. We started it from the ground up,” Kort said. “We’re in your guys’ community. We’re not some big dude from Vancouver.”",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "Smithereens find success with delivery apps – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/business/smithereens-find-success-with-delivery-apps/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}