{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "Lots of people need extra money to get through the COVID-19 pandemic and income losses, but the NDP government’s Christmas bonus program is poorly targeted and may miss those who need help most, B.C. Liberal finance critic Mike Bernier says.\n\nFinance Minister Selina Robinson tabled legislation Tuesday to delay a full budget until as late as April, and give the government another $2 billion in spending authority to pay for its $1,000 “B.C. recovery benefit.” Robinson also revealed that there will be an online application process that opens Dec. 18, a step not mentioned since Premier John Horgan announced the payments as an election promise in October.\n\nBernier said one big flaw is that the province has to use 2019 income data to decide who qualifies for a program that pays $1,000 to families with income up to $125,000, and $500 for single individuals who made up to $67,500 last year. Reduced payments are to go to families earning up to $175,000 and individuals making up to $87,000, but the reductions have not been detailed.\n\n“For the most part it’s a blank piece of paper,” Bernier told reporters from the legislature Dec. 8. “It’s the government trying to make good on an election promise with no information at all for the public to determine if they will qualify and what they will get.”\n\nThe NDP election platform cost estimate of $1.45 billion has now jumped to somewhere under $2 billion, on top of the $5 billion the legislature authorized for COVID-19 assistance this spring. Robinson said payments of $150 are being added for people who receive income and disability assistance, on top of the base benefit.\n\nRELATED: B.C. delays 2021 budget, moves to borrow $2B more\n\nRELATED: B.C. tourism, small business assistance ‘coming soon’\n\nBernier would not say if the B.C. Liberal opposition would vote for the payment program, expected to be pushed through the legislature as soon as this week in an effort to get money out to people by Christmas. That comes before a still-unspent $1.5 billion in business aid approved in spring, and could leave the most deserving out, he said.\n\n“You could have an individual who was working at a sawmill last year, working in the oil and gas sector last year making $80,000 as an individual,” Bernier said. “If they lost their job in February, they are going to have a hard time making their mortgage payments. Because they were working last year, they won’t qualify. That is completely inappropriate if we are genuinely going to be helping people who need it now.”\n\nDelaying the provincial budget until as late as April also restricts the government’s ability to come up with better-targeted assistance before May, he said.\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC legislatureBC politicsCoronavirus",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-08 14:20:00-08:00",
    "title": "Big holes in NDP’s COVID-19 Christmas bonus plan, B.C. Liberal says – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/business/big-holes-in-ndps-covid-19-christmas-bonus-plan-b-c-liberal-says/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}