{
    "authors": [
        "The Canadian Press"
    ],
    "content": "Vegetables could be particularly hard hit, with prices expected to jump as much as 6.5 per cent\n\nA customer shops at a meat counter in a grocery store in Montreal, on April 30, 2020. The average Canadian family will pay up to an extra $695 for food next year, as the pandemic, wildfires and changing consumer habits drive up grocery bills to the highest ever increase predicted by an annual food price report. THE CANADIAN PRESS/Paul Chiasson\n\nThe average Canadian family will pay up to an extra $695 for food next year, as the pandemic, wildfires and changing consumer habits drive up grocery bills to the highest increase ever predicted by an annual food price report.\n\nRising bread, meat and vegetable prices are expected to lead the overall food price increase of three to five per cent, according to Canada’s Food Price Report 2021 released Tuesday.\n\nFor an average family of four, that means a $13,907 grocery bill.\n\n“We don’t expect a break at the grocery store any time soon,” said Sylvain Charlebois, lead author and Dalhousie University professor of food distribution and policy.\n\n“This is the highest increase that we’ve ever expected.”\n\nThe 11th edition of the food price report, published annually by Dalhousie University and the University of Guelph, has expanded this year to include the University of Saskatchewan and the University of British Columbia, making it more national in scope.\n\nResearchers said in the study that COVID-19 will continue impacting food prices next year, with the meat industry particularly vulnerable to potential labour shortages, logistics disruptions, food plant and distribution centre slowdowns and shifts in consumer demand.\n\nWhile meat prices could increase as much as 6.5 per cent overall, the biggest price hike could be for poultry, a supply managed industry in Canada.\n\nPoultry prices are up seven per cent since July, Charlebois said, adding that as production costs continue to rise, so will retail prices.\n\n“We are expecting poultry prices to be a bit of an issue,” he said.“If farmers are asked to spend more on equipment and COVID-19 cleaning protocols, consumers will eventually have to pay more.”\n\nMeanwhile, climate change, including heat waves, ice loss, wildfires, floods and droughts, will also influence how much we pay for groceries next year.\n\nVegetables could be particularly hard hit, with prices expected to jump as much as 6.5 per cent, according to the report.\n\nMuch of the produce Canadians consume comes from California, a state that has been ravaged by one of the worst wildfire seasons on record.\n\nWith California’s crops heavily compromised by smoke and ongoing challenges with COVID-19, Stuart Smyth with the University of Saskatchewan said prices will be pushed up.\n\n“Vegetables are where people are going to notice the greatest impact,” said Smyth, associate professor in the Department of Agricultural and Resource Economics.\n\nWhile the price of root crops like potatoes and carrots should remain stable, he said leafy greens and more perishable produce like tomatoes and cucumbers will be more expensive.\n\nYet some of the biggest price increases could be for vegetables like cabbage, cauliflower and asparagus, said Smyth, the chair of Agri-Food Innovation and Sustainability Enhancement.\n\nREAD MORE: Belligerent man arrested in Victoria grocery store after refusing to wear mask\n\nMeanwhile, the study warned consumers to expect bakery prices to increase as much as 5.5 per cent.\n\nThe cost of a bushel of wheat hit about $6 in November, Smyth said, up from about $4 roughly 18 months ago — a 50 per cent increase.\n\nThe issue is about supply and demand, he said, noting that while “wheat acres” or the amount produced has remained relatively stable in Canada, demand has steadily risen.\n\n“If we hold supply constant but the demand goes up, essentially we’re falling a little bit behind,” Smyth said.\n\nMeanwhile, the latest report has broken down average food costs for individuals based on age and gender, allowing consumers to estimate their potential food expenditures based on their own situation.\n\nWhile it continues to provide the estimated cost of feeding a family of four, the report also shows that a man aged 31 to 50 can expect to pay $169 more for food next year, while a woman of the same age can expect to pay $152 more.\n\nBrett Bundale, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nGroceries",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-08 07:55:00-08:00",
    "title": "Canadian families will pay up to $695 more a year for groceries in 2021, report says – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/business/canadian-families-will-pay-up-to-695-more-a-year-for-groceries-in-2021-report-says/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}