{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "New round of payments for household incomes up to $175,000\n\nWith Ottawa gearing up for more pandemic-driven spending and B.C. about to distribute a second round of payments to households with income up to $175,000, soaring debt at all levels of government has business people concerned.\n\n“We’re going to indenture generations here if we’re not careful,” said Greg D’Avignon, CEO of the Business Council of B.C.\n\nBCBC released an Ipsos Public Affairs survey this week showing 79 per cent of respondents concerned that B.C. Premier John Horgan’s campaign promises are going to lead to higher taxes and debt.\n\nSpeaking after his first post-election cabinet meeting Dec. 2, Horgan defended his key election promise to send out $1,000 to households and $500 to individuals. The B.C. legislature is being called into a brief session next week to authorize the additional borrowing, with the current-year deficit already near $13 billion and next year’s budget still to come.\n\n“It’s prudent to do it because it’s putting dollars into people’s pockets so they can continue to get through the most challenging time British Columbians have ever known,” Horgan said. “This is going to be means tested, it’s going to be low-income families and individuals who will get access to resources that they wouldn’t have had otherwise.”\n\nThe “means test” was partially revealed in the NDP campaign platform, after Horgan added the payments to counter a B.C. Liberal promise to suspend sales tax next year. The one-time direct payment goes to families with annual income under $125,000, “with a sliding scale up to $175,000.” For single individuals, the “sliding scale” reduces $500 payments from $62,000 to $87,000 income.\n\nLegislation to be tabled next week will show the actual reductions for higher income earners, and whether any test of lost income is to be used.\n\nRELATED: Federal COVID-19 payments swell bank accounts: CIBC\n\nRELATED: Horgan launches platform with $1,000 COVID payments\n\nRELATED: Another $1 billion borrowed for municipalities, transit\n\nD’Avignon notes that B.C. residents have already collected $9 billion in Canada Emergency Relief Benefit (CERB) payments, the second highest of any province. Federal spending has been highest among developed countries, pushing average income up 11 per cent even as the economy contracted.\n\nMeanwhile, B.C.’s economic growth before the pandemic was driven almost entirely by energy projects.\n\n“If not for LNG Canada, Site C, Trans Mountain pipeline and some office towers in Vancouver and Victoria, we would have been essentially flat,” he said.\n\nRavi Kahlon, B.C.’s new minister of jobs and economic recovery, pointed to latest Statistics Canada labour force survey as a sign that B.C. is coming out of the COVID-19 recession.\n\n“Since the pandemic’s most severe impact on the economy in April, B.C. has had substantial job growth for seven consecutive months, bringing our total employment to 98.5 per cent of pre-pandemic levels,” Kahlon said Friday. “This is the highest job recovery rate of any of Canada’s four largest provinces.”\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC politicsCoronavirus",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-04 14:15:00-08:00",
    "title": "Next $1.5 billion in B.C. COVID-19 cash ‘prudent,’ Horgan says – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/business/next-1-5-billion-in-b-c-covid-19-cash-prudent-horgan-says/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}