{
    "authors": [
        "The Canadian Press"
    ],
    "content": "Some retail chains went into 2020 already saddled with massive debt and too many stores\n\nA woman in a face mask exits Le Chateau at Guildford Town Centre in Surrey, B.C., Friday, Dec. 4, 2020. The clothing store is going out of business amid the global COVID-19 pandemic. THE CANADIAN PRESS/Marissa Tiel\n\nFor some, fashion retailer Le Chateau Inc. was the edgy store of their youth and 1990s clubwear. Others recall a place of prom dresses, business apparel and accessories.\n\n“It was a trendsetting store,” says Toronto resident Tara Greene. “As a teen, it was a very cool and exciting place to shop.”\n\nAfter six decades in operation, the Montreal-based clothing company joined the ranks of dozens of big-name retailers that have buckled under the weight of pandemic restrictions, filing for court protection in October and liquidating stores.\n\nIt’s been a year of unrelenting pain in retail, with widespread economic shutdowns toppling cornerstones of Canada’s retail industry just as easily as small operations.\n\nAnd experts warn there are more casualties to come, as the second wave of cases forces further restrictions — decimating cash flow and exposing broader underlying problems.\n\nSome retail chains went into 2020 already saddled with massive debt, too many stores and a track record of underperformance.\n\n“The sector has been in a bit of turmoil even before the pandemic,” says Ramesh Venkat, director of the David Sobey Centre for Innovation in Retailing and Services at Saint Mary’s University in Halifax.\n\n“Retailers that started the year in financially bad shape just couldn’t survive. They didn’t have the financial resources to make it through these hard times.”\n\nRetail analysts say many also lacked a strong e-commerce presence and failed to keep up with shifting consumer behaviour.\n\n“Some just aren’t appealing to the next generation of shoppers,” says John Archer, chief development officer with the Toronto retail consultancy firm Three Sixty Collective.\n\n“The Gen Zeds are different than millennials and some stores like Forever 21 realized even before the pandemic they weren’t cutting it for the new generation.”\n\nThen the pandemic hit, compelling many retailers to close or drastically curtail hours and customer capacity.\n\nThe shutdown sent overall retail sales into free fall, plummeting 30 per cent in April compared with a year earlier, Statistics Canada reported.\n\nClothing and shoe stores were hardest hit, down a staggering 87 per cent and 79 per cent, respectively, compared with April 2019.\n\nThe mounting toll of restrictions — on top of the existing problems hounding retail — was too much for some.\n\nREAD MORE: Clothing retailer Le Chateau plans to close its doors, files for CCAA protection\n\nHousehold names like footwear empire Aldo Group, outdoor recreation outfit Mountain Equipment Co-operative and clothing retailer Reitmans (Canada) Ltd. have all filed for creditor protection since the start of the pandemic.\n\nSo have Comark Holdings with clothing brands Ricki’s, Cleo and Bootlegger, Groupe Dynamite with brands Garage and Dynamite, and Ann Canada Inc. with women’s clothing brands Ann Taylor and LOFT.\n\nWhile some stores will disappear, experts say others are using creditor protection to step back from a risky retail environment and restructure after years of poor results.\n\nReitmans, for example, had seen its share price steadily decline for more than decade when the pandemic struck.\n\nThe Montreal-based company filed for creditor protection in May and began restructuring, liquidating its Addition Elle and Thyme Maternity stores to focus on its three remaining brands — Reitmans, Penningtons and RW & CO.\n\nIndeed, some of companies filing for creditor protection could come back “leaner and meaner,” Archer says.\n\n“If they were on the ropes already, they may have taken advantage of legal protection to take a breather and work with their suppliers and landlords and figure out how many stores they need.”\n\nStill, Canada’s retail landscape is expected to lose thousands of stores as a result of restructuring and bankruptcies, putting many retail workers out of a job.\n\nThe first quarter of the year is a notoriously slow period for many retailers, and experts say without a robust holiday sales period it will be difficult for some to stay in business through the winter months.\n\n“There are some companies that are obviously not thriving already, so with any sort of blip on the radar they are definitely going to have some issues,” says Anwar White, a lecturer with the Bensadoun School of Retail Management at McGill University.\n\nBut he says the insolvencies brought on by the pandemic are part of a normal economic cycle that has just been accelerated and compressed into a shorter time frame.\n\n“I’m not thinking about this as a doom and gloom situation,” White says. “This experience has forced retailers to really digitally evolve in lightspeed ways and do things completely differently than they’ve done before.”\n\nYet unlike usual economic cycles, the current uncertainty plaguing the retail industry hinges in part on the length and scale of store closures.\n\nRetail analyst Bruce Winder says he expects the new year, and a potentially worsening second wave of the pandemic, will usher in more bankruptcies.\n\nBut he says the number of insolvencies could be offset by federal aid, including the wage and rent subsidies.\n\n“You’re going to see a number of companies propped up by government subsidies that probably without them would have been in (creditor protection) a long time ago,” Winder says.\n\n“These sort of zombie companies are operating with maybe 10 or 20 per cent of their normal revenues but they’re still in business because the government is propping them up.”\n\nBrett Bundale, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronaviruseconomyRetail",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-07 12:00:00-08:00",
    "title": "Pandemic shutdowns the last straw for some Canadian retailers, push others to brink – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/business/pandemic-shutdowns-the-last-straw-for-some-canadian-retailers-push-others-to-brink/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}