{
    "authors": [
        "Jim Elliot"
    ],
    "content": "Due to provincial health orders, games up to Dec. 31 have been pushed back\n\nAs further public health orders are put in place in an effort to stop more COVID-19 infections, the Kootenay International Junior Hockey League (KIJHL) has postponed the remainder of their 2020 games.\n\nIn light of provincial restrictions which limit games, team practices and the participation of players over the age of 18, the league is opting to postpone all regular season games scheduled through Dec. 31. A statement from the league says teams will be free to conduct on-ice activities until the holiday break begins on Dec. 19 so long as they abide by the provincial orders.\n\nThe league will announce a start date for the continuation of the season once further information from the provincial health officer comes through.\n\nRead More: Second wave, twice the anxiety; Okanagan paramedics reflect on pandemic from the front line\n\nRead More: COVID-19 cases on several Kelowna flights\n\n“The KIJHL appreciates the patience being shown by all league stakeholders, including our fans, sponsors, volunteers and facility partners, during a difficult and uncertain time,” the statement from the league reads.\n\n“We are particularly grateful to the players, team staff and billet families who have worked diligently over the past three months to ensure a safe and healthy environment for all participants.”\n\nThe KIJHL expressed hope that competitive play would return in January.\n\n\n\njim.elliot@saobserver.net\n\nLike us on Facebook and follow us on Twitter\n\nKIJHL",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-04 13:30:00-08:00",
    "title": "KIJHL postpones all games through end of 2020 – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/sports/kijhl-postpones-all-games-through-end-of-2020/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}