{
    "authors": [
        "Thom Barker",
        "Local Sports"
    ],
    "content": "Daniel Imhof is Youth Coach of the Year and Georgia Mack is Administrator of the Year\n\nTwo members of the Bulkley Valley Soccer Society (BVSS) have been honoured with provincial awards.\n\nClub coach Dan Imhof was named the BC Soccer Youth Coach of the Year and Georgia Mack received the Administrator of the Year nod.\n\nSociety president Leah Germain summed up why the society nominated them succinctly.\n\n“Without those two, we wouldn’t have had a season at all,” she said.\n\nNeither Imhof nor Mack wanted to take credit, however.\n\nREAD MORE: Soccer makes a return in Smithers\n\n“It’s nice to be recognized as with anything, but the whole summer we ran the summer program it wasn’t just me, there were a lot of people involved to make that happen and being one of the few communities that was able to provide a soccer program made us all proud,” Imhof said.\n\nMack was equally humble.\n\n“I just tried to make sure everything ran smoothly and everybody had the support they needed to be able to help out,” she said. “We did the best we could.”\n\nNevertheless, Germain described both as having gone above and beyond the call of duty.\n\nIn the spring, when all play was suspended, Imhof held four online practices per week, two each for two age groups and also kept the kids and parents engaged with on online trivia night.\n\n“It was a great opportunity to bring the of world soccer/football to our players as, being in Northern BC, the exposure is limited,” Germain said.\n\nIt was also Imhof who developed the drills and training program according to the provincial government’s Return to Play Phase 1 guidelines.\n\n“He went above and beyond what was provided and varied the drills each week to keep players’ interests alive since we were not able to have actual game play,” she said.\n\nAnd, when the season ended, but the kids wanted to continue, Imhof volunteered his time to keep the program going for a few more weeks in August.\n\n“Dan’s eagerness to coach and help kids at every age, at every level is something you desire in all coaches, all sports,” the society wrote in his nomination letter. “He is a true role model for the kids. His undeniable dedication and commitment to the sport and our youth players is infectious and motivating.”\n\nEqually, Germain said, Mack did way more than what was expected of her.\n\nWhile ostensibly a behind-the-scenes person for the society, Mack was out every day making sure things were running properly under the regulations and got involved in many different ways.\n\n“She put her heart and soul into making sure we could get up and running this year,” Germain explained. “And she goes above and beyond by, even, she helped coach last year and things like that. She’s just always there to help.”\n\nThe BVSS is still active with its fall indoor program. The five-on-five format is being played in three different age groups. The under-eight and under-12 groups are playing at Walnut Park Elementary School. The under-12s also have games at Bulkley Valley Christian School where the under-14s, under-16s and under-18s are also playing.\n\nGermain said approximately 70 kids are participating across all the age groups.\n\n\n\neditor@interior-news.com\n\nLike us on Facebook and follow us on Twitter\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.\n\nGeorgia Mack with her two children XXX and YYY. (Contributed photo)\n\nGeorgia Mack. (Contributed photo)",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-03 01:30:00-08:00",
    "title": "Two members of BV soccer club honoured with provincial awards – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/sports/two-members-of-bv-soccer-club-honoured-with-provincial-awards/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}