{
    "authors": [
        "Marisca Bakker",
        "Local Sports"
    ],
    "content": "Hudson Bay Mountain Resort will open without its usual contingent of international workers\n\nSkiers and boarders rejoice, Hudson Bay Mountain Resort is set to open on Dec. 4.\n\nInterim general manager Lex Rei-Jones said this opening day is slightly later than usual.\n\n“We usually try to open end of November but last year we opened up pretty late and the last couple of years have been pretty stressful to try and make that opening day with the weather. This year we figured, push it back, we should be good with snow and hopefully we can open the chair on opening day, which we don’t normally do,” she said.\n\nLast season, HBMR had a tough go with mother nature, mechanical issues with its chairlift and COVID-19 forced them to close early.\n\nBut Rei-Jones says the recent snowfalls are getting everyone pumped up for a fresh, new season.\n\n“We haven’t seen a good dump like this in Novemebr that has stayed in a long time. We got 39 cms on the snow table on the snowstorm on Tuesday [Nov. 17],” she said\n\nREAD MORE: Hudson Bay Mountain Resort isn’t letting the weather get it down\n\nA few things will look different on the hill because of the ongoing pandemic, but Rei-Jones is hopeful people will read the signs and abide by the new rules.\n\nFace coverings will be mandatory in all the buildings, lift lines and during lessons.\n\nThere will also be reduced capacity in the buildings and restaurants.\n\nShe added this is in line with other resorts.\n\n“The Canada West Ski Association has been great in getting everyone together to plan for the season so a lot of things are similar across the board,” she added. “The word of this pandemic has been be flexible. We are forging ahead and planning ahead, knowing that if something happens, we have some wiggle room and we can still open and provide this experience for people.”\n\nREAD EVEN MORE: Ski Hill manager steps down\n\nThe other difference this year will be the staff. Normally the staff comprises 75 per cent international workers.\n\n“With everything that is going on, I started my hiring early fall and focused on hiring Canadians. I have two staff members that came from overseas, they had preapproved visas and quarantined in Vancouver before coming up. So two out of my 50 staff are international.”\n\nHowever, she said it worked out because a lot of Canadian workers didn’t want to go to bigger resorts, or go overseas so it wasn’t too hard to hire domestically.\n\nOpening weekend will be sponsored by Frontier Chrysler and they will have a promotion to give away lift tickets.\n\nHBMR’s website will be updated with all the COVID friendly events they have planned for opening weekend.\n\n@MariscaDekkema\n\nmarisca.bakker@interior-news.com\n\nLike us on Facebook and follow us on Twitter.\n\n@MariscaDekkema\n\nmarisca.bakker@interior-news.com\n\nLike us on Facebook and follow us on Twitter.\n\nskiing",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-26 06:30:00-08:00",
    "title": "Ski hill scheduled to open Dec. 4 – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/sports/ski-hill-scheduled-to-open-dec-4/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}