{
    "authors": [
        "Ben Bogstie",
        "Local Journalism Initiative Reporter",
        "Local News"
    ],
    "content": "The Terrace River Kings lost 9-3 to the Quesnel Kangaroos on Mar. 2, 2019 in the final CIHL playoffs. (Lindsay Chung Photo)\n\nThe Central Interior Hockey League (CIHL) has cancelled its senior men’s ‘AA’ 2020/21 season, but league officials are keeping the door open to the possibility of exhibition games in the new year.\n\nThe league includes the Smithers Steelheads and teams in Prince Rupert, Kitimat, Terrace, Hazelton, Williams Lake and Quesnel.\n\n“We had a schedule to start December 4th but with recent restrictions feel that in in any circumstances less than a super miracle vaccination, we would probably not return to play with spectators in time to salvage a 20-21 season,” said Ron German, CIHL president, in a media release.\n\nGerman thanked the communities, fans, volunteers and sponsors for their support. He said that if conditions regarding the COVID-19 pandemic change in 2021, the league would explore the possibility of playing exhibition games if BC Hockey and local guidelines could be met.\n\nLast season the league got its championship series in just under the wire.\n\nOn March 7, just a week before everything started shutting down, the Quesnel Kangaroos took game 2 of the three-game series 4-3 in overtime against the Terrace River Kings in Terrace.\n\nThe previous week the Roos had cruised to an 8-4 victory in game 1 on home ice.\n\nThe Interior News has reached out to the Steelheads for comment.\n\nMore to come…\n\n@BenBogstie\n\nben.bogstie@terracestandard.com\n\nLike us on Facebook and follow us on Twitter.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-25 16:40:00-08:00",
    "title": "Central Interior Hockey League cancels 2020",
    "url": [
        "https://www.interior-news.com/news/central-interior-hockey-league-cancels-2020-21-season/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}