{
    "authors": [
        "Marisca Bakker"
    ],
    "content": "I purposely got pregnant during a pandemic. I realize how selfish this sounds, putting an extra, unnecessary strain on the health care system. I also feel guilty for putting my unborn child and myself at risk.\n\nBut after having a miscarriage earlier in the year, there was a hole in my heart I needed to fill. I also had no idea how long this pandemic would last. I was either naive or being too optimistic to think things would blow over in a couple of months.\n\nNow, I’m going to be giving birth while the world is on fire, or at least it feels that way.\n\nREAD MORE: Feeling alone after a miscarriage\n\nWhile I don’t have any regrets and I’m excited to be having another baby soon, the weight of the whole situation has weighed heavily on me.\n\nAnyone who has ever had a baby after losing one will tell you that it feels like you are holding your breath for the entire pregnancy.\n\nYou know what can go wrong. And if you don’t know why you lost your previous baby, it makes the whole experience uneasy. Now I’m doing that while there is an ongoing global health crisis.\n\nThere is nothing more comforting than going into your doctor’s office and hearing the baby’s heart beat. During the first half of my pregnancy, I saw my doctor, in person, twice.\n\nWe had phone calls but that hardly eased any of my concerns. I just wanted to be measured, weighed and be told that everything was OK.\n\nAs I’m getting closer to the end of my pregnancy, I’m hoping the second wave of COVID-19 cases slows down. I’m not sure what I would do if our local hospital had an outbreak. Or if the rules changed and I couldn’t have a support person with me while giving birth.\n\nI’ve heard of some labouring moms having to wear a mask. That would be tough.\n\nI keep reading news articles of moms with COVID-19, going into a coma and giving birth via a c-section. Or sick moms who have their babies whisked away as soon as they give birth to prevent the newborn from catching the coronavirus. I’m trying to tune out horror birth stories but it’s hard when its in your face constantly.\n\nREAD EVEN MORE: Coronovirus crisis hitting women harder than men\n\nI’m hoping this holiday season that people listen to the health authorities. While some think this whole pandemic is overblown, or that it is just another simple flu, I’m asking everyone to think of others.\n\nThere are your immunocompromised neighbours, over-stressed teachers fearing cases will spread in their schools, health care workers putting their lives on the line to save others, small businesses owners worried about another lockdown and pregnant women scared to give birth during this crisis.\n\nStick to your bubble, wear a mask, social distance and be kind, if not for yourself, for others.\n\n@MariscaDekkema\n\nmarisca.bakker@interior-news.com\n\nLike us on Facebook and follow us on Twitter.\n\nParentingSmithers",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "Pregnancy after loss during a pandemic – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/pregnancy-after-loss-during-a-pandemic/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}