{
    "authors": [
        "Thom Barker"
    ],
    "content": "I have been an English native speaker for 57 years. I am a university-educated person. I have been in the journalism business as a professional writer and editor for nearly 20 years.\n\nAnd yet, pretty much every week, I learn something new about the language.\n\nLast week, it was T-glottalization.\n\nThis is a sound change in many English dialects, accents and individual speech patterns most of us are well familiar with, but I never knew it was actually a defined thing.\n\nIt is not something that is taught in English. In fact, it is something that is more frequently untaught, so to speak.\n\nIt is the act of replacing the ‘t’ sound, in certain positions, with a glottal stop. Glottal stops are defined as “consonants formed by the audible release of the airstream after complete closure of the glottis,” the part of the larynx consisting of the vocal cords and the space between them.\n\nIn some languages, such as Arabic, it is a standard consonant, but in English it is more a non-standard way of speaking and has often been criticized as a lazy habit. In the International Phonetic Alphabet its symbol is ‹›.\n\nBut, even though we are generally trained to enunciate our ts, most of us end up using the glottal stop in words like ‘mitten’ and ‘kitten.’\n\nThat’s the most common placement of it, when the t-sound is followed by the ‘n’ sound, but in some more extreme English accents, Cockney for example, it occurs pretty much anywhere where t is followed by another consonant examples being ma‹›ress and pe‹›rol.\n\nIt’s kind of a shortcut in a way, and we use plenty of those not just in speech, but in written language too.\n\nI got to thinking about that the other day when a colleague referred to an anti-COVID demonstration in a headline. Of course, we all understood that he meant the participants were against COVID restrictions and health measures, because being against a deadly virus would kind of be the default position for most people.\n\nThe same with names of groups and events such as Cops for Cancer. It certainly makes no sense that these police officers would be pro-cancer, but technically speaking that’s what the phrase would indicate.\n\nEnglish is so varied, both in speech and writing, it’s a wonder we can understand each other sometimes.\n\nBut we can and that is the most impor‹›an‹› thing, after all.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "We’ve all heard it or used it, but what the heck is a glottal stop? – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/weve-all-heard-it-or-used-it-but-what-the-heck-is-a-glottal-stop/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}