{
    "authors": [
        "Thom Barker"
    ],
    "content": "Most dog owners are responsible pet owners who love their dog like part of the family.\n\nMost people are good people who follow rules and expectations set out by lawmakers and the community.\n\nHowever, there are always a few who take no notice of how their actions may affect others. We’ve certainly seen evidence of that in many parts of the world during the pandemic.\n\nRelating to dogs, there is a local Bylaw No. 1780 Animal Control and Licensing in Smithers, which specifies basic dog care standards and owner responsibilities.\n\nExamples include leashing when in public and maintaining control of the dog at all times, and proper care of aggressive or dangerous dogs. Often, people who don’t adhere to rules are aware of them but figure, somehow, they have a valid reason for exemption.\n\nDogs being off-leash can be a prime example. “I know my dog is supposed to be on a leash, but don’t worry, he’s friendly,” is a common refrain by rule-breakers.\n\nSomehow they interpret the bylaw to exempt their furry friend.\n\nOr, they don’t realize that as friendly as their dog might be, nobody else loves them quite like they do.\n\nNot everyone wants a strange dog approaching them. There are people who have a genuine fear of dogs and others, unbeknownst to some, that actually don’t like dogs.\n\nThat is why places like Smithers Barkpark exist, where people choose to go and understand dogs will be off-leash.\n\nOften forgotten in the mix is the impact on service dogs. Having an off-leash dog approach a service dog can cause distraction and be a safety hazard for the service dog handler.\n\nFor example, Ross Levan of Smithers is visually impaired, and he and his guide dog Albert have faced this situation on several occasions.\n\nA guide dog is trained to ignore other dogs and avoid distractions, but this training is away from the dog’s natural instinct. That means the dog needs constant reassurance and commands from the handler, who will often use the command “leave it”, which instructs the dog to do just that and focus on the job at hand.\n\nAn off-leash dog is a massive and unnecessary temptation for a service dog.\n\nThe temperament is irrelevant. Even if a guide dog isn’t threatened, excitably and wanting to say hello to other dogs could mean guiding someone into an obstacle, missing a curb or stairwell, or making a very dangerous mistake at an intersection.\n\nDuring the pandemic, people are getting out more with their pet dogs to stay active.\n\nIf we are truly ‘all in this together’ remember those who cannot see and the extra challenges faced during these challenging times.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-10 01:30:00-08:00",
    "title": "Off leash dogs are a safety hazard for service dog owners – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/off-leash-dogs-are-a-safety-hazard-for-service-dog-owners/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}