{
    "authors": [
        "Marisca Bakker"
    ],
    "content": "Women are faring worse during the pandemic than men, a new study by the B.C. Women’s Health Foundation found this week.\n\nWell, no sh*t.\n\nUnemployment rates for women soared during the spring when the first lockdown occurred and they took on extra caregiving. I don’t think we needed a study to tell us this.\n\nREAD MORE: Thankful for the end of a tough week\n\nWhen the province first went into quarantine, both my husband’s job and mine were deemed essential. However, I could work from home and he couldn’t. So off to work he went while I stayed at home with two young children and tried to work without any outside help. It wasn’t my husband’s fault, he had to go to work and his job couldn’t be done from home.\n\nThere were a few times when I would be writing or researching while also getting a manicure from my five year old and stopping to help a toddler go to the bathroom. But there were always times when I felt guilty. Either feeling guilty for neglecting my children so I could work or feeling guilty neglecting a deadline because my children needed me.\n\nThere were moments, many moments, when I wanted to throw in the towel. But we got through it and the summer was better.\n\nNow we are being thrown back into the thick of it. Thankfully this time, I can use outside help and pawn off my children so I can work in peace every once in a while.\n\nAnd fingers crossed, schools don’t close again. It was hard when I had my school-aged daughter at home in the spring and there wasn’t anything we could do. The library, pool and anything fun was closed. The struggle was real.\n\nDid my husband feel the weight of this? I often felt envious that life remained mostly normal for him — which in turn made me feel guilty. There was a constant cloud of guilt over my head. He took over childcare duties when he was home, but it was still tough for me when he wasn’t around.\n\nREAD EVEN MORE: Let’s not drag this COVID thing out\n\nThis latest report found that working mothers lost 26 per cent of their work hours in April to take on extra responsibilities associated with childcare while working men only lost about 14 per cent of their work hours.\n\nIs there something we can do so this doesn’t happen again? For starters, having access to reliable and affordable childcare would help. It would also help if we reached out to our mom friends. Even a simple phone call or an offer of some support can go a long way.\n\nIt is once again taboo to take your children into stores, but shopping still needs to get done.\n\nDon’t judge a parent who runs into the grocery store to grab milk with a toddler in tow. A little kindness can go a long way.\n\n@MariscaDekkema\n\nmarisca.bakker@interior-news.com\n\nLike us on Facebook and follow us on Twitter.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-03 01:30:00-08:00",
    "title": "Coronovirus crisis hitting women harder than men – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/coronovirus-crisis-hitting-women-harder-than-men/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}