{
    "authors": [],
    "content": "This community is missing a cherished member with the recent death of our friend Arthur Tom. Even many who didn’t get to know Arthur personally will likely remember his smiling face and friendly demeanour as he strolled through town.\n\nMany years ago, Arthur found life in Jesus Christ. He has since been attending church twice on Sundays and spent much time enjoying fellowship and meals with his many spiritual siblings in this valley. This was instrumental in bringing stability to his life after facing hardship in his early years.\n\nThe past eight months were a particular challenge and frustration for Arthur, as COVID restrictions prevented him from attending church and taking part in weekly fellowship. It didn’t take long and his emotional and physical health went downhill quickly.\n\nIn light of this, it was so encouraging to see his church work hard to bring back in-person worship services as safely as possible (in accordance with public health guidelines). It filled my heart with joy to see him back in church and to also see his health beginning to improve. And then he was suddenly and unexpectedly taken from this life.\n\nArthur’s example is another reason why I am so grieved to see our provincial government decide, without any notice, to completely shut down worship services last week.\n\nMy family and I are still free to go to a local restaurant such as Boston Pizza, along with well over 50 others. We can visit the Smithers Art gallery and mingle. We can even go to the pool and frolic in the water with other members of the public. But we are not allowed to set foot in a church.\n\nAll churches have taken rigorous precautions to ensure the health of attendees. The church Arthur was a member of can fit over 500, yet must now sit empty. This is in spite of the fact that it is far easier to ensure social distancing, and to contact trace, in a church than most other facilities.\n\nNot only is this a double standard, I respectfully submit that it is also unconstitutional. The government must also abide by a law — the Constitution.\n\nUnlike visiting restaurants and pools, freedom of religion and association are “fundamental freedoms” protected by our Constitution. The Charter of Rights and Freedoms exists to protect citizens from the government because governments have the power of coercive force.\n\nIntentionally or not, its power can easily undermine fundamental freedoms, especially when it comes to religion, association, and expression. If it is convinced the measures are necessary, it needs to justify itself, and then communicate respectfully to a partner institution.\n\nBut what grieves me most is that public worship is where Arthur, our family, and so many others go for spiritual nourishment, which is directly linked to our emotional, mental, and physical health.\n\nAlthough the government has good intentions, there is a huge unintended cost to forced isolation.\n\nCOVID precautions matter a great deal, but public health is broader than combatting one particular virus. Let’s learn from the life of our friend Arthur and show wisdom and discernment as we together seek the health and well-being of all members of our communities.\n\nMark Penninga is the Executive Director of ARPA Canada. He and his family live in Smithers",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-03 01:30:00-08:00",
    "title": "Health considerations go beyond mere protection from virus – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/health-considerations-go-beyond-mere-protection-from-virus/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}