{
    "authors": [
        "Thom Barker"
    ],
    "content": "The first of several vaccines (Pfizer-BioNTech) in development for COVID-19 has shown an efficacy rate of 90 per cent in clinical trials and is currently before the American Food and Drug Administration (FDA) for emergency approval.\n\nAmericans could start getting their shots as early as this month and B.C. has announced a plan to start rolling out the province’s vaccination program in the first weeks of 2021.\n\nStill, it will be months before most of us are able to get the vaccine.\n\nDespite the COVID-19-fatigue so many of us are feeling and the appetite for the proverbial silver bullet a vaccine promises, that might not be such a bad thing.\n\nTo be clear, The Interior News is 100 per cent in favour of an effective vaccine.\n\nEfficacy is just the beginning, though. There are good reasons why vaccines are generally not rushed to market.\n\nThere are still a number of questions that remain unanswered.\n\nIn order to gain emergency approval, the manufacturer must provide two months of monitoring data indicating the vaccine is also safe.\n\nAlthough the company has cleared that benchmark and there appears to be have been minimal short-term side effects, the sample size is relatively small and we don’t know, and won’t for some time, if there could be long-term complications.\n\nWe don’t know, and won’t for some time, whether people who have received the vaccine can still carry and spread the SARS-CoV-2 virus.\n\nWe don’t know, and won’t for some time, whether the innoculation imparts permanent or temporary immunity.\n\nOf course, vaccines are a balancing act. If the risk, however miniscule, of getting one far outweigh the risks of developing the disease — which, when you look at the exploding transmission rates, rising death toll and all the associated systemic, economic and social implications, certainly appears to be the case — it is worth it.\n\nThe thing about silver bullets, though, is that they offer simplistic solutions to complex problems. Even if countries are able to roll out this vaccine on the proposed timeline, it will be many months before we can all get it.\n\nIt will not all of a sudden remove the need for other precautions although its existence may impart a false sense of security.\n\nIt also raises the question of why, in one of the most medically sophisticated countries in the world, we do not have the capacity to produce the vaccine ourselves.\n\nIn short, we are a long way from out of the woods, yet.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-03 01:30:00-08:00",
    "title": "We are not out of the woods yet – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/we-are-not-out-of-the-woods-yet/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}