{
    "authors": [
        "Katya Slepian",
        "Canada"
    ],
    "content": "Jersey will be available for purchase on Dec. 1, 2020\n\nSports haven’t looked the way they typically look this year, with pandemic bubbles all around and games cancelled and postponed due to COVID infections.\n\nBut as 2020 draws to a close, the NHL and Adidas have teamed up to bring a little bit of flair to the sports world with a series of 31 “Reverse Retro” jerseys. According to the NHL, it’s the first time all teams in the league have participated in the initiative. Each jersey represents “unique and historical moments in each club’s history, while refreshing the colour and design combination for an all-new presentation.”\n\nPerhaps most pertinent for British Columbians is the Canucks retro jersey. The team had quite a few to choose from, having worn seven logo variations and 21 different uniforms over 50 years. Although it’s faced some criticism on social media for not harkening back to the popular Black Skate jersey, the retro version is a play on the gradient orca jersey. That jersey was the alternate from 2001 to 2006, and according to the Canucks “marks a shift in Canucks hockey and the start of a new era.”\n\nWhat do you think?\n\nREAD MORE: NHLers weigh in on the idea of an all-Canadian division: ‘It would be pretty unique’\n\n@katslepian\n\nkatya.slepian@bpdigital.ca\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nNHL",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-16 11:50:00-08:00",
    "title": "VIDEO: Canucks unveil redesigned jersey as part of NHL’s ‘Reverse Retro’ collection – Houston Today",
    "url": [
        "https://www.houston-today.com/sports/video-canucks-unveil-redesigned-jersey-as-part-of-nhls-reverse-retro-collection/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}