{
    "authors": [
        "Thom Barker"
    ],
    "content": "Thom argues if the service is legal it should not be on a discriminatory basis\n\nThis column is not to be taken as advocacy for or against Medical Assistance in Dying (MAiD).\n\nWhile I have my own opinions on whether or not this law should exist at all, it does, so I will limit the discussion to discrimination.\n\nThe background is the Quebec Superior Court decision known as Truchon and Gladu v. Canada and Quebec that ruled the federal law’s requirement that a person’s natural death has become “reasonably foreseeable” and the Quebec law’s requirement that a person be at the “end of life” violated the plaintiffs’ Charter rights.\n\nThe federal government is now attempting to pass its new law that removes the “reasonably foreseeable” eligibility requirement, eases the safeguards for those whose deaths are reasonably foreseeable and introduces new safeguards for persons whose deaths are not reasonably foreseeable, but still suffer from a grievous and irremediable medical condition.\n\nFirst, let us be clear on what these deaths are. Technically speaking, they are suicides. The means by which they are accomplished involves another person or other persons, but ultimately it is a decision and in that there is no room for discrimination.\n\nConsider this, if MAiD had come into effect prior to 1929, women would not have been eligible because they were not persons under the law.\n\nThis is an exceedingly complex social, and some may even say moral, issue, but the issue of discrimination is a simple one. If we would not exclude a person on the basis of gender or any number of other criteria,\n\nThe real issue here is “informed consent.”\n\nThe amendment bill (C-7) currently before Parliament, requires: “the person must be informed of available and appropriate means to relieve their suffering, including counselling services, mental health and disability support services, community services, and palliative care, and must be offered consultations with professionals who provide those services; and the person and the practitioners must have discussed reasonable and available means to relieve the person’s suffering, and agree that the person has seriously considered those means.”\n\nLet’s call that Medical Assistance in Living (MAiL).\n\nThe question is, are we, as a society, doing everything in our power to provide people considering MAiD with MAiL?\n\nAccording to many studies the answer is no.\n\nAnd requiring that a person be informed of their options is not the same as actually providing those services.\n\nIf that is the case, then the choice between MAiL and MAiD may really be no choice at all for many people.\n\nAgain, I am not saying MAiD should or should not be legal, but if it is, it should not be on a discriminatory basis and we should be doing more to make sure it is truly a last resort.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-03 01:30:00-08:00",
    "title": "MAiD law not made for all, but should be or not at all – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/maid-law-not-made-for-all-but-should-be-or-not-at-all/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}