{
    "authors": [],
    "content": "I was going to tell you that I do not go out and visit folks in their homes. Always something to consider. Will they have a chair that I can get out of? Will the toilet be high enough? Sort of tall old lady issues.\n\nAfter I thought about all that I looked at a bit of TV and realized that I have visited many homes.\n\nThose who communicate their views to us in this sad time of COVID-19 somehow hook up to something so we can all see their basement or very clean kitchen. Most of the people with a story to tell have lots of books placed in a tidy manner. I try to see which books they have.\n\nAlso can see the family photos and some interesting paintings.\n\nLAST WEEK: Tears of joy and tears of sadness: Trump and Remembrance\n\nSome rooms minus the bookshelf will have a couch or two with matching pillows. Very tidy of course.\n\nThen we Zoom into a modern kitchen. Fancy appliances, cupboards with dishes galore. Of course they must show us that they have a flowering plant or two as an accent. White walls, clean floors and no dirty dishes. I know all this must be for the TV audience. If luck is with me, I might hear a dog bark or cat jump up on something.\n\nI tell you this as I wonder if ever anyone wanted to talk and see me in all my glory in this cabin what could I do to make you impressed with my living quarters?\n\nMORE SPICE OF LIFE: The ins and outs of masks and how they affect communication\n\nThere is a coffee maker, kettle, peanut butter for the birds and a container of prune juice. A few dishes in the sink and a pot of soup bubbling away on the stove.\n\nI suppose I could turn and take a view from the other direction. Old chairs from the Smithers beer parlour surround a table from the dump. There is an antique hutch filled with old dishes seldom used. Let’s not miss old Shea licking the roaster.\n\nFor sure there is nothing set up to impress the world.\n\nStill, I can’t say I don’t go out anymore. I actually enjoy looking into the homes of all those people. Always look beyond what you are really looking at.\n\nOne thing for sure is that it will never happen that I will chat away looking into a camera somewhere. Some secrets are best kept to myself.\n\nI hope all of you are well and wearing a mask when you must. It is up to all of us to make sure this virus does not spread anymore.\n\nCall 250-846-5095 when you feel like it. You can send an email to mallory@bulkley.net.\n\n\n\neditor@interior-news.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-26 01:30:00-08:00",
    "title": "COVID offers rare insight into others lives, but how real is it? – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/covid-offers-rare-insight-into-others-lives-but-how-real-is-it/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}