{
    "authors": [
        "Marisca Bakker"
    ],
    "content": "Marisca tries to find some laughter for relief from the second COVID wave\n\nLast week was a tough week. The record-breaking number of COVID cases, the new health protocols being put in place, partial lockdowns and the threat of Christmas being cancelled have all weighed heavily on a lot of us.\n\nThe snow dumps haven’t helped, only because I hate cleaning off my car and driving through it. My kids have enjoyed sledding and playing in it, which is the silver lining.\n\nBut overall, I’m glad last week is behind us. Everything has felt so heavy. It’s been hard for me to find joy in the small things.\n\nI’ve felt the pressure to try and keep things as normal as possible for my children while the world seems to be in chaos. I know kids are resilient but raising them during a pandemic is hard.\n\nI was in a funk all week and I think my five-year-old has noticed. She came up to me one day and told me she’s learning how to tell jokes. She asked me why the chicken crossed the road so I told her I didn’t know, waiting for her to respond and she just stared blankly back at me, I think waiting for an answer.\n\nHer heart was in the right place, even if the punch line wasn’t.\n\nI tried explaining how jokes worked, but I couldn’t remember any that were age appropriate. So we went to Google and found some on the internet.\n\nHere are our favourites. Maybe they’ll bring you a slight smile or you can try and cheer your children up with one or two if they need it.\n\nWhy are fish so smart?\n\nBecause they live in schools!\n\nWhere do polar bears keep their money?\n\nIn snow banks!\n\nWhy is Cinderella bad at soccer?\n\nBecause she is always running away from the ball!\n\nWhere do cows go on Friday nights?\n\nThe mooooo-vies!\n\nWhat did one snowman say to the other snowman?\n\nIt smells like carrots over here!\n\nREAD MORE: Let’s not drag this COVID thing out\n\nMaybe laughter is the best medicine. Research has shown that laughter can relieve stress and can even boost the immune system. There was even a study done in Europe that found people with a strong sense of humour outlived those who don’t laugh as much.\n\nI know, it can be hard right now to smile. Sometimes it helps to actually count your blessings.\n\nOr ask the person next to you what the funniest thing they’ve heard this week is.\n\nMaybe you’ll both get a good chuckle and even if its just for a couple of minutes, maybe the coronavirus cloud hanging over your head will disappear.\n\n@MariscaDekkema\n\nmarisca.bakker@interior-news.com\n\nLike us on Facebook and follow us on Twitter.\n\nParenting",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-26 01:30:00-08:00",
    "title": "Thankful for the end of a tough week – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/thankful-for-the-end-of-a-tough-week/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}