{
    "authors": [],
    "content": "February 3, 1948 – May 20, 2020\n\nTim was born into a family which would eventually place him #4 out of thirteen children. As he grew he developed his father’s love for the game of golf, and his mother’s adventurous spirit. He dreamed of flying like his maternal grandfather and after high school signed up in the CAF ROTP program. He obtained his BSc in Math and Physics from UBC while spending his summers doing basic military and flying training.\n\nHe met Mabel Beaubien in 1966, they married December 20, 1969. Then the adventures began, moving to Moose Jaw Sask. for initial jet training, on the Tutor aircraft, and receiving his wings in Gimli Man. on the T-33 in the spring of 1971.\n\nThe adventure pace picked up as a son Ian was born in 1971 and a daughter Rhonda followed in 1974. In the military life one goes where one is told and there were several moves between BC, Alberta, and Sask. Tim cross trained to helicopters and flew both Twin Huey’s and Kiowas.\n\nIn between tours flying helicopters he spent four years instructing flying on the Tutor jet, and another four years teaching at the officer candidate school in Chilliwack where he also received a Base Commander’s commendation for endless hours of volunteer work in the local community. Eventually attaining the rank of Major he commanded the LOH flight for 408 squadron in Edmonton.\n\nUpon retiring from the service in 1987 Tim attended the University of Victoria and added a teaching certificate to his previous degree, followed by over six years teaching grade 7 at St. Joseph’s school in his hometown of Chemainus. After his own children moved on Tim and Mabel began a small business called Handy Helpers offering various types of low cost assistance to seniors, disabled, single parents, and anyone who needed help but couldn’t afford high priced repairs, companion services, or maintenance and tutoring.\n\nTheir children both moved north so they decided to shorten the distance and moved to Smithers in 2001 and eventually to Williams Lake in 2010. He loved his fishing in the Bulkley River and would even lie down on a beached Salmon to prevent it from getting away.\n\nAlways having a commitment to service Tim never slowed down doing endless hours of volunteering for a men’s club in Smithers and with the Knights of Columbus and St. Vincent de Paul in Williams Lake. Through their lifetime Tim and Mabel were involved in three refugee settlement projects.\n\nTim had an enthusiasm for life and boundless energy. Once you met him you’d never forget him.\n\nHis fellow servicemen, family and friends have shared their impressions of Tim and describe him as follows: so kind, loving, a gentleman, faith filled, devoted, ethical, dependable, generous, brave, hospitable, motivating, with an adventurous spirit and an infectious smile and laugh. He had a big heart for those in need, and raised thousands for missions in Africa, by selling golf balls, and collecting refundable bottles and cans.\n\nAfter his difficult struggle with pancreatic cancer Tim is deeply missed by his wife of over 50 years, his son Ian and his daughter Melanie; his daughter Rhonda (Bernard) and their daughter Davynn and numerous siblings, nieces, nephews, cousins, and close friends. His ashes will be placed in the Chemainus cemetery at a later date.\n\n\n\nAdditional Photo(s):\n\n",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-05-20 00:00:00-08:00",
    "title": "Major (ret’d) Timothy Hicks, BSc, CD – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/obituaries/major-retd-timothy-hicks-bsc-cd/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}