{
    "authors": [],
    "content": "Thom laments the cancellation of CFL season, but is hopeful for the future of the league\n\nSunday was a sad day for me.\n\nIn fact, the Sunday of this past weekend often has been a day of heartbreak for me over the past half-century or so. Specifically, Nov. 30, 1969; Dec. 3, 1972; Nov. 29, 1976; Nov. 16, 1997; Nov. 29, 2009; and Nov. 28, 2010.\n\nBut this year it was different. I was not heartbroken because my beloved Saskatchewan Roughriders had been defeated, but because the Grey Cup was not played at all.\n\nGrey Cup Sunday has also only been a day of elation on a handful of ocassions. Specifically, Nov. 26, 1989; Nov. 25, 2007; and Nov. 24, 2013 when the green and white did get to hoist the cup.\n\nI am an unabashed Canadian Football League fan. It’s my favourite professional league of all the North American sports. And I think the Canadian game is the far superior version of North American football.\n\nI have not missed a Grey Cup in 51 years — maybe more, but that ‘69 game when the Roughriders went down 29 -11 to those other Rough Riders in Montreal is my first memory of the game.\n\nInterestingly enough, within a month of that heartbreaking loss, my family was on its way from Regina to Ottawa, where I would grow up with the other Riders, but never switch allegiances.\n\nI got to experience the heartbreak first hand at Exhibition Stadium in Toronto in 1972, when the infamous Tony Gabriel snatched victory from us in the waning seconds on a pass from Russ Jackson.\n\nEven when I lived in Texas, before live-streaming was a thing, I always found a way to tune in.\n\nIn 2000, I bribed a bar owner into temporarily subscribing to CBC for the Montreal Alouettes – B.C. Lions matchup by promising I would gather 20 people for the broadcast. Fortunately, at the time, I was a member of a drinking club with a running problem that was always up for any excuse to party.\n\nI spent most of the game explaining the superior rules of our game to my American friends.\n\nSince the shutdown of professional sports in March, I have not watched a single game in any sport. I kept up with what was going on for a while, but even that went by the wayside after awhile. And frankly, I haven’t really missed it.\n\nRight now, I couldn’t tell you who won the Stanley Cup or the NBA Championship or the World Series.\n\nHowever, even though I have not had cable TV for almost two years now, I would have found a way to watch every Roughriders game of the 2020 season had it not been cancelled.\n\nAnd on Nov. 22, I would have made my traditional pot of chili and cornbread and tuned in for whomever was contesting the quintessentially Canadian sports celebration.\n\nYes, hockey is our game, but our trophy gets hoisted by American teams far more often than by Canadian ones. Yes, basketball is our game, and although the Raptors have had ocassion to do us proud, the Americans have really made it their game.\n\nThe CFL is our league and the Grey Cup is our only professional national championship. It is a shame they could not find a way to rescue this past season.\n\nMore worrisome was the prospect that the league might fold altogether just when it was experiencing a renaissance.\n\nBut it has been on the ropes before and rallied so I am hopeful it will do so again.\n\nThe one bright spot of the 2020 Grey Cup weekend was the announcement of the 2021 season schedule.\n\nI am marking my calendar for May 23, 2021, BC vs. Calgary.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-26 01:30:00-08:00",
    "title": "A sad weekend with no Grey Cup to watch – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/opinion/a-sad-weekend-with-no-grey-cup-to-watch/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}