{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "B.C. continued to record high levels of COVID-19 community infection Dec. 3, with 694 more cases, 12 more deaths and three new outbreaks in the health care system.\n\nOf the new cases, 465 were identified in the Fraser Health region, still the hotspot for B.C. transmission of the coronavirus. Another 114 were in Vancouver Coastal, 82 in Interior Health, 23 in Northern Health and 10 on Vancouver Island.\n\nProvincial health officer Dr. Bonnie Henry said there are three new health care outbreaks, which can be declared with a single case identified. They are at Baillie House long-term care in Maple Ridge, Gateway Lodge long-term care in Prince George and University Hospital of Northern B.C., also in Prince George.\n\nThe latest results bring the number of active cases in B.C. to 9,103, with 320 in hospital, 80 in intensive care. With the number of coronavirus patients needing hospital care rising, Health Minister Adrian Dix said the province’s base and surge hospital bed capacity is at about 70 per cent. Last December, B.C. hospitals were running at 103.5 per cent, which was typical in winter before the pandemic began and beds were cleared to prepare.\n\nAfter the upcoming weekend’s pandemic results are analyzed, Henry will announce Monday whether current restrictions on travel, private gatherings and team sports are to be extended, Dix said.\n\nRELATED: Adult team sports suspended, youth practice allowed\n\nRELATED: Canadian Armed Forces prepare for vaccine program\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC legislatureCoronavirus",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-03 15:10:00-08:00",
    "title": "Another 694 diagnosed with COVID-19 in B.C. Thursday – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/news/another-694-diagnosed-with-covid-19-in-b-c-thursday/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}