{
    "authors": [
        "Katya Slepian"
    ],
    "content": "A B.C. Ambulance Service paramedic wearing a face mask to curb the spread of COVID-19 moves a stretcher outside an ambulance at Royal Columbia Hospital, in New Westminster, B.C., on Sunday, November 29, 2020. THE CANADIAN PRESS/Darryl Dyck\n\nB.C. recorded 2,364 COVID-19 cases and 46 deaths over the last weekend of November, provincial health officer Dr. Bonnie Henry told reporters at a briefing Monday (Nov. 30).\n\nThe province recorded 750 cases on Saturday, 731 on Sunday and 596 on Monday. There are an additional 277 historical cases, bringing the total to 2,364 over the weekend.\n\nBy region, the cases break down to 371 in Vancouver Coastal Health, 1365 in Fraser Health, 212 in Interior Health, 58 in Island Health and 73 in Northern Health, one new case in a person who lives outside of Canada.\n\nThere have been a total of more than 33,000 confirmed cases in B.C. since the pandemic began, of which 8,855 are currently active. There are 10,139 people under active public health monitoring currently, while the total death toll stands at 441. There are 316 patients in hospital with the virus, of whom 75 are in ICU. Health Minister Adrian Dix said that overall hospital beds, including surge capacity, are at 69.7 per cent, with ICU at 52.8 per cent.\n\n“This has been a challenging pandemic for all of us,” Henry said.\n\n“I am heartened, immensely, that most people in B.C. are doing the right thing.”\n\n\"If you do not believe in masks, don't go to those stores,\" Dr. Henry says, urging those people to shop online. If you *can't* wear a mask then you need to seek accommodations, she notes. Clear different in tones between the two situations from Henry. @BlackPressMedia #COVID19 — Kat Slepian (@katslepian) November 30, 2020\n\nHenry’s voice cracked as she extended condolences to the friends and families of the 46 people who have died over the past three days. About 80 per cent of those who died were in long-term care.\n\n“These people have faces, have names, have stories, have families,” she said.\n\n“If you are thinking it is okay to bend, the rules, remember this virus takes lives.”\n\nHenry noted that although long-term care workers must work at one single site, the health ministry cannot prevent them from taking a second job outside of the system. She said that even with systematic testing of workers at these facilities, once the virus gets in it’s very hard to control.\n\nHenry directed some of her comments at faith leaders, after multiple churches in the Lower Mainland held services over the weekend, in violation of provincial health orders. She thanked those who abided by the rules.\n\n“It is not about rights, it is about community,” she said, citing Pope Francis who recently criticized people ignoring COVID-19 restrictions.\n\nHenry said the virus is continuing to spread via gatherings, even small ones. British Columbians are under a public health order that bans gatherings of any size outside of their immediate households or core bubbles.\n\nREAD MORE: Top doctor urges Canadians to limit gatherings as ‘deeply concerning’ outbreaks continue\n\n@katslepian\n\nkatya.slepian@bpdigital.ca\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirus",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-30 15:10:00-08:00",
    "title": "B.C. records deadliest weekend of COVID-19 pandemic with 46 deaths; more than 2,300 cases – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/news/b-c-records-deadliest-weekend-of-covid-19-pandemic-with-46-deaths-more-than-2300-cases/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}