{
    "authors": [
        "Katya Slepian"
    ],
    "content": "Signs asking British Columbians to think about racial injustice have been put up across the province\n\nA bus shelter in White Rock is emblazoned with an ad from B.C.’s Office of the Human Rights Commissioner on Sunday, Nov. 29, 2020. (Black Press Media files)\n\n“Am I racist?”\n\nIt’s a question that has perhaps come up more than usual this year, as Black and Indigenous peoples took to the streets for Black Lives Matter protests this spring and summer.\n\nIn November, B.C.’s Office of the Human Rights Commissioner asked the province’s residents to consider that question again as it launched an advertising campaign.\n\nThe large black signs with white writing have popped up across 23 B.C. communities, posing the question: “Am I racist?”\n\n“Systemic racism is a difficult and urgent problem in B.C.,” said Human Rights Commissioner Kasari Govender. “Statistics show a rise in hate crimes in B.C., both gradually over the last decade and rapidly since the COVID-19 pandemic took hold in the province. We need to name the problem before we can solve it, and that starts when we confront our own, often subconscious, racial biases.”\n\nAnd as of Monday, (Nov. 30), some signs dig deeper.\n\nOne now says “If I say I don’t see skin colour, am I racist?” Another questions: “If I want to forget our province’s history, am I racist?”\n\nGovender started her five-year term in September 2019, 17 years after B.C.’s last human rights commission was dismantled. She said that Canada can often be guilty of brushing racism under the rug.\n\n“Canada has a reputation of being a safe place with minimal racism, but this does not truly reflect the history and present-day experiences of Indigenous and racialized people in this province and country,” Govender said. “I know it’s uncomfortable to recognize this racism and to start to work on it, but it’s crucial that we do so—because uprooting systemic racism starts when we change ourselves.”\n\nAccording to the office, reported hate crimes in B.C. rose by 34 per cent between 2015 and 2018, and in the first nine months of 2020, Vancouver police reported a 116 per cent rise in hate crimes. Asian communities saw an even steeper rise as hate crimes targeting them rose from nine in 2019 to 88 in the first nine months of 2020, a 878 per cent spike.\n\nThe public launch of the “Am I racist?” campaign comes the day that Mary Ellen Turpel-Lafond is scheduled to release her report, titled Addressing Indigenous-specific racism and discrimination in B.C. health care. The report stems from allegations of a racist blood alcohol guessing game played using Indigenous patients in a B.C. hospital.\n\nREAD MORE: B.C. launches investigation into allegations of racist blood-alcohol guessing game in ER\n\nREAD MORE: Long seen as radical, Black Lives Matter goes mainstream\n\n@katslepian\n\nkatya.slepian@bpdigital.ca\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nRacial injusticeracism",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-30 10:10:00-08:00",
    "title": "VIDEO: ‘Am I racist?’ campaign asks British Columbians to confront their unconscious biases – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/news/video-am-i-racist-campaign-asks-british-columbians-to-consider-their-biases/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}