{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "B.C. has recorded another 887 new cases of COVID-19 as of Thursday, exceeding the one-day record of 859 recorded on Nov. 21.\n\nPublic health officials also reported another 13 deaths related to the novel coronavirus, tying the record death toll on Nov. 23 and bringing the total number of deaths to 384.\n\nIn the latest 24-hour reporting period Nov. 26, there were 612 new cases in the Fraser Health region, 168 in Vancouver Coastal, 65 in Interior Health, 24 in Northern Health and 18 on Vancouver Island. Hospitalizations continue to rise with 294 admitted, 64 in intensive care.\n\nThere have been two new senior home outbreaks, at Amica White Rock and Ryal Ascot Care Centre in Vancouver.Outbreaks at Hamlets at Westsyde in Kamloops and Peace Portal Seniors Village in White Rock have been declared over.\n\nHealth Minister Adrian Dix, reappointed to the job Thursday by Premier John Horgan, renewed his plea to B.C. residents to keep social contacts to immediate households.\n\nRELATED: Horgan names new cabinet with same pandemic team\n\nRELATED: LifeLabs offers $75 antibody tests in B.C., Ontario\n\n“Let’s support our public health teams, which are tirelessly working to track the virus, break the chain of transmission and keep all of us safe,” Dix and provincial health officer Dr. Bonnie Henry said in a statement of the latest situation. “The best way to do that is for each of us to keep to as few faces as possible right now.\n\n“Even though we may be staying small right now, that doesn’t stop us from staying connected and staying active. You can go outside, try a local restaurant you haven’t been to before with your family or connect with friends virtually.”\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC legislatureCoronavirus",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-26 15:50:00-08:00",
    "title": "B.C. sets another COVID-19 record with 887 new cases – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/news/b-c-sets-another-covid-19-record-with-887-new-cases/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}