{
    "authors": [
        "Priyanka Ketkar"
    ],
    "content": "Last week, when Meghan, the Duchess of Sussex revealed of her miscarriage in a personal essay, it was not only revealing of the deep pain and grief that she went through, but also revealing of the fact that there is still a long way to go before the world accepts that miscarriages are normal and accepts women’s right to grieve.\n\nIn an opinion piece, Meghan revealed how she felt a sharp cramp back in July and as she was clutching her first born child, she knew she was losing her second. A poetic image of life and death in one frame, but so raw and heartfelt at the same time.\n\nIn September, model and social media influencer Chrissy Teigen shared a social media post that she and her husband, John Legend, had lost their unborn son.\n\n“We are shocked and in the kind of deep pain you only hear about, the kind of pain we’ve never felt before. We never decide on our babies’ names until the last possible moment after they’re born, just before we leave the hospital. But we, for some reason, had started to call this little guy in my belly Jack,” said her heart-wrenching post.\n\nCanadian-American singer and songwriter, Alanis Morissette also revealed earlier this year of her difficult pregnancies when she had a “bunch of miscarriages”.\n\nIn 2018, former first lady of the US, Michelle Obama also shared her experience of miscarriage, calling it lonely, painful and demoralizing.\n\nWhat these revelations from powerful women have attempted to do, is to an extent normalize miscarriages.\n\nTo an extent. I say that because even today, a miscarriage carries with it taboo, guilt, shame.\n\nWhile all these women found supporters and praise for their revelations, they also received a lot of flak with people commenting on their lifestyle choices, blaming them for the loss, and attempting to shame them. And these are famous, powerful women. I shudder to think what it must be for all the regular, not-famous women who go through such pain of loss and yet are unable to grieve openly with the fear of being shamed.\n\nTime, and time again, research has shown that one in four known pregnancies or up to 20 per cent pregnancies, end in miscarriage. While the research attempts to show how common and normal miscarriages are, they are still devastating, both emotionally and physically. Several women who miscarry have to go through a surgery to remove fetal tissue. The loss could also, in many women trigger post-traumatic stress disorder.\n\nAnd still, women don’t talk about this loss, they carry it within them, many of them carry it with them their entire lives. Women don’t talk; rather, women are discouraged from talking about this because it is too personal, too disgusting according to some and some fear they will be told it is their fault.\n\nOver the years, several powerful, famous women have come out and revealed how they dealt with the loss of miscarriage, in the hopes of shedding light on the issue, on ensuring that everyone realizes it can happen to anyone and hoping it would get rid of the taboo.\n\nBut here we are in 2020 and people are still angry at women for having gone through this, they are still angry at women for sharing their experiences, and they are still trying to keep the topic of miscarriages under wraps, making it into a package full of shame and guilt.\n\nIsn’t it time to make sure women have the space to grieve? There is kindness lacking everywhere, and it really is time to extend some towards women who keep going through life without any complaints, silently grieving over an unimaginable loss.\n\nPriyanka Ketkar\n\nMultimedia journalist\n\n@PriyankaKetkar\n\n\n\npriyanka.ketkar@ldnews.net\n\nLike us on Facebook and follows us on Twitter.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-02 01:30:00-08:00",
    "title": "Breaking taboo and silence around miscarriages —need of the hour – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/breaking-taboo-and-silence-around-miscarriages-need-of-the-hour/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}