{
    "authors": [],
    "content": "Coastal GasLink kicked off its summer construction program in July and is safely putting people back to work, providing well-paying jobs that support local families as part of British Columbia’s healthy economic recovery.\n\nAs construction activities safely grow, so will our workforce, with approximately 1,700 people expected to be working across the route by the end of July. With pipe stringing, welding and installation planned to begin in August, more jobs and opportunities will be added regularly.\n\n“It would really be an eye-opener to people to see the amount of jobs that are created in the local communities,” said Mat Seguin, a Project Coordinator with Surespan Construction Ltd, who’s working on the project today.\n\nMore than just a number, the employment opportunities are one of the ways Coastal GasLink is proud to support a healthy economic recovery for communities in the north. “It’s really the people on the ground, who are employed, feeding their families, buying clothing for their kids. They’re being part of the economy, they can make money again and build a good life,” said Derek Orr, SA Energy Group’s Indigenous and Community Relations Manager.\n\nTo help equip local Indigenous workers with the skills and certifications they need to be part of the project this summer, Coastal GasLink, together with one of its prime contractors, recently welcomed 12 trainees as part of the inaugural session of the Pathways to Prosperity Program. The dedicated ‘training-to-employment’ program was held at the newly-opened Vanderhoof Lodge, where participants received specialized training to kick start a long-lasting career in construction.\n\n“We recognize that the pandemic has created challenges and uncertainties for communities small and large across the north. That’s why we’re proud to be able to help people get safely back to work this summer, through the many fields and careers that our project touches,” said Kiel Giddens, Coastal GasLink’s Public Affairs Manager in Prince George.\n\n“Whether it’s as a labourer, medic, or construction monitor, Coastal GasLink offers the opportunity to safely train and employ workers to benefit them today, and provide skills and experience that can last a lifetime,” explained Giddens.\n\nAs always, the health and safety of our workforce, their families, and surrounding communities is at the forefront of everything we do. As we move into summer construction and peak activities, Coastal GasLink has implemented enhanced project-wide health and safety standards at all worksites and workforce accommodations in accordance with Dr. Bonnie Henry’s guidance.\n\n“At the end of the day, we want our team to go home knowing their families are safe and that they can continue to provide for them,” added Giddens.\n\nLearn more about Coastal GasLink’s summer construction schedule, as well as construction activities and job opportunities in your community, by visiting CoastalGasLink.com.\n\nnatural gas",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-07-27 06:00:00-08:00",
    "title": "Coastal GasLink supports B.C.’s healthy economic recovery – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/marketplace/coastal-gaslink-supports-b-c-s-healthy-economic-recovery/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}