{
    "authors": [],
    "content": "Editor:\n\nWith no disrespect to Dr. Henry who means well by advising everyone to wear masks and stay home in order to slow down the spread of Covid 19, I believe that shutting down the whole province harms the well being of its citizens. Dr Henry and all the politicians have no right to forbid everyone to work for a living. It is easy for them their wages come in regular so they have no problem to feed their children.\n\nMany good and healthy citizens of this province have minimum wages and at the best of times can barely manage to feed their children and them self are now left without any income at all.\n\nThis is a sure recipe for mental breakdown which may well be worse than Covid 19. I can remember that there was no food and though I was too young at that time to worry about it my parents sure did.\n\nThanks to the young men who voluntarily placed their lives in danger greater than Covid 19 and fought during WW2 for freedom to work for a living to feed our children and grandchildren.\n\nMany gave their live for this and now we are forbidden by our government to do so. Our businesses are shut down and may not survive so that after Covid 19 they may not be able to offer jobs to their former employees. Dr. Henry may be very good at treating sick people but she has no clue what healthy people need.\n\nWhen I cross the road I have to be careful otherwise I may get run over by logging truck. When people go to work they have to be careful also but staying home is not the answer. Let’s work together and make B.C. great not hide in a closet.\n\nThese are the thoughts of an old man.\n\nMartin Onderwater",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-02 01:30:00-08:00",
    "title": "Locking down the entire province, not a solution – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/locking-down-the-entire-province-not-a-solution/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}