{
    "authors": [
        "Priyanka Ketkar"
    ],
    "content": "When social media usage to take political stands first became popular, a lot of people, news outlets started quoting these as a way of reporting. I used to think it was lazy reporting and unnecessary to give some of these opinions a plaform, until I joined in and actually witnessed first-hand just how important it is to take note of what goes on in the virtual world.\n\nEarlier this year, Trump campaign in US promised a large crowd of more than a million for his rally but discovered later to their disappointment and shock that the teen TikTok users, another social media platform, bought thousands of tickets to the rally, as a prank and a way to make a statement. Now of course, the campaign’s supporters thought this was misuse of social media, that today’s generation was spoilt and had no idea how they were messing with politics but on the other side, there was tremendous support to this action. How is it different than a protest? This was the teens’ way to protest against what they believed was not right for their country. This protest was online, socially-distanced and completely non-violent. Can we say that about the in-person rallies and protests?\n\nLast year, Rahaf Mohammed al-Qunun, a teenager from Kuwait, ran away from her family, from her abusive home, to find safe haven elsewhere. When she arrived in Bangkok with a ticket in hand for Australia, a diplomat seized her passport and the Thai officials decided to deport her back to her home country.\n\nThe teenager however locked herself inside her hotel room and pled to the United Nations High Commissioner for Refugees, for asylum through social media. The teen used the platform Twitter to constantly plead her case and get supporters for her cause. As her story received traction and brought the plight of Saudi women in spotlight, Canada stepped up and brought her in to the country as a refugee.\n\nIf someone would’ve thought that her message on social media didn’t matter, and hadn’t shared it and if it hadn’t received the attention that it did through social media, the girl would’ve been sent back to a country where she wasn’t allowed to continue her education, was oppressed and would’ve possibly faced a death sentence.\n\nFor news media too, I know the vital role our own print newspaper plays in the community, and with our presence online, and on social media, we are able to reach beyond just this community, all over the world. We are able to gather support for our print stories by reaching more people online. We are able to listen in on different issues, different opinions and bring those perspectives in one place, through our news stories, to you.\n\nAnd I know, social media is not at all a bed of roses. No, I wouldn’t go that far. It has its drawbacks, but fears, hysteria, misinformation, gossip, rumours are all part of conversation — be it offline or online and we can’t be biased on which opinions and messages to acknowledge as valid, and which as frivolous or unimportant. I shouldn’t have to participate in a face-to-face conversation or a rally to register my protest, dislike against or joy for something, to be heard.\n\nThe fact of the matter is, we can’t uphold social media as the best thing ever since moon landing, in one breath and then outright dismiss the outrage, the anguish expressed through it. It is a platform, just like sitting at a cafe and expressing one’s opinions or protesting in a rally. It is a way to bring in world views, opinions and all opinions need to be acknowledged, even the ones you and I don’t agree with.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-25 01:30:00-08:00",
    "title": "Choosing the validity of one form of expression over other —is it fair? – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/choosing-the-validity-of-one-form-of-expression-over-other-is-it-fair/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}