{
    "authors": [],
    "content": "Siblings Kelly Ehalt and Mike Bovill took over Hetherington and Hooper from their late father, Jack Bovill. The store has been serving Smithers for 70 years.\n\nFor 70 years, Hetherington and Hooper has been a cornerstone in Smithers, offering quality brands and friendly customer service at the corner of Main and 1st. The store evokes simpler times when businesses were family-run, with deep ties to local communities.\n\n“Our customers are our friends,” says co-owner Kelly Ehalt.\n\nShe and brother Mike Bovill proudly carry on the traditions passed down through three generations. Their late father Jack Bovill brought them up in the business, and shared everything he’d learned working for Gordon Hetherington and Owen Hooper in the 1960s.\n\n“Some of the families we serve in the Valley have been coming since Day 1. Our dad served those families, and we’ve continued to do so,” Ehalt says.\n\nClassic style for the modern age\n\nHetherington and Hooper serves customers from Prince George to Prince Rupert, and ships their unique stock to customers all over B.C.\n\nThe store carries both men’s and ladies’ wear, everything from work gear to suits, and serves an extensive clientele. European and North American tourists in town to hunt or fish will stop by the store to find clothing they can’t find anywhere else. High school graduates and groomsmen rely on the store for fashionable suits, while others rely on the quality work gear Hetherington and Hooper provides.\n\n“We have customers who come to Smithers every year to visit, and will always stop in to say hello,” Ehalt says. It’s a long standing tradition, started by Gordon Hetherington and Owen Hooper.\n\nBond to Smithers\n\nEhalt and Bovill grew up in Smithers and their connection to the community runs deep. Hetherington and Hooper has a long history supporting community fundraisers, charities and clubs, and volunteering with the Smithers Merchants. The store is a caring presence in the community, not just a place of business.\n\n“It was important to our dad, and it’s important to us,” Ehalt says.\n\nThe siblings both enjoy the outdoors, and love the Smithers lifestyle. “Most people are here because they want to be here, not because they have to be here.”\n\nHetherington and Hooper is open Monday to Friday 9 a.m. to 6 p.m. and Saturdays 9 a.m. to 5 p.m. Visit the store at the corner of Main Street and 1st or call 250-847-2455. Follow them on Facebook and Instagram for a look at some of the latest fashions.\n\nRetailSmall BusinessSmithers\n\nOriginal owners Owen Hooper (left) and Gordon Hetherington taught Jack Bovill the importance of customer service, and he passed those lessons on to his children Kelly Ehalt and Mike Bovill.",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-06-01 06:00:00-08:00",
    "title": "This store puts family first… and every customer is family – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/marketplace/this-store-puts-family-first-and-every-customer-is-family/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}