{
    "authors": [],
    "content": "Last week, Evan Salter received a tearful “thank you” from a grateful Métis entrepreneur receiving a COVID-19 Emergency Fund business loan.\n\nIt was a heart-felt reminder for the CEO of the Métis Financial Corporation of BC (MFCBC) that while the true toll of the pandemic isn’t always apparent on the loan application, the unprecedented economic challenges are very real for business owners, their employees and their families.\n\n“As you work on these applications, sometimes you don’t get a full sense of the stress business owners are experiencing,” Salter reflects. “The most significant thing I’ve heard as you start talking to people is the true impact – to be able to offer a little bit of help, it’s pretty special.”\n\nMFCBC opened for business Aug. 1, 2018 to assist BC’s Métis entrepreneurs to create new business, expand their existing business or acquire an established business. As a result, Métis entrepreneurs in BC are now able to be served by a Metis-owned Aboriginal Financial Institution (AFI).\n\nToday, MFCBC is striving to become the first point of contact for Métis entrepreneurs who’ve experienced business challenges through the COVID-19 pandemic, a perfect example is the Métis-owned company that had pivoted to produce personal protective equipment for frontline workers. With MFCBC’s support, they were able to double their output.\n\nDesigned to help mitigate business impacts and plan for recovery from the COVID crisis, loans of up to $40,000 are available to Métis-owned BC businesses – 25 per cent of this is a contribution and 75 per cent a repayable. Featuring no payments for the first year, it is also completely interest-free over the life of the almost five-year term. Owners also received a checklist to assist them with a business restart plan, notes Salter, a CPA who before assuming leadership at MFCBC, spent six years as the Director of Business Development and Finance for the Métis Voyageur Development Fund in Ontario, helping it become the largest Aboriginal Finance Institute in Ontario.\n\nAwareness, new products drive MFCBC growth\n\nAs awareness grows of MFCBC’s initiatives, “momentum is really starting to build,” Salter says. “We’ve had several hundred queries, and since announcing the COVID loans program, we’ve seen substantial uptick in applications. As we expand our suite of offerings, we expect that to continue to grow exponentially.”\n\nAnd capacity for growth is significant.\n\nAccording to the national 2017 Aboriginal Peoples survey, 18 per cent of Métis respondents identified as self-employed. This translates to 16,000+ self-employed Métis in BC. Of these Metis-owned businesses, about one-third also had employees.\n\nIn fact, among the provinces, BC has the highest percentage of Métis self-employment, represented in all major economic sectors, Salter notes. Further, 41 per cent of Métis entrepreneurs in British Columbia are women.\n\nFrom MFCBC’s first loan to a Kootenays-based backcountry education company to the COVID-19 emergency fund loans, MFCBC is the Métis financer of choice, supporting Métis businesses to fully participate in new and future economic opportunities.\n\nTo learn how the Métis Financial Corporation of BC can support your business, visit mfcbc.ca or call 1-833-399-3926.\n\nFinanceLocal Business",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-06-01 01:30:00-08:00",
    "title": "Helping BC’s Métis businesses get back to business – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/marketplace/helping-bcs-mtis-businesses-get-back-to-business/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}