{
    "authors": [
        "Priyanka Ketkar"
    ],
    "content": "When the pandemic was just starting, the lockdowns suddenly seemed like a boon for earth where there were fewer vehicles on the roads, very few flights polluting the skies and hardly any ships disturbing the waters. There were surges in rare bird and animal sightings out in the open and it felt like the earth was getting some time to heal while us humans healed ourselves by staying indoors.\n\nHowever, ever since the pandemic, use of single-use masks went up. Last week, I watched a documentary that showed how these masks, recklessly discarded and thrown away have been clogging up drains, animals have been choking on them and fish are getting entangled in them.\n\nIn May, the Acting Director of UN Environment Joyce Msuya, in a press release issued by the organization said that one third of global plastic production is non-recyclable and at least eight million tonnes of plastic flows into our water bodies each year. “It is ending up in the stomachs of birds, fish, whales, and in our soil and water. The world is choking on plastic and so too are our birds on which so much life on earth depends,” she added.\n\nAnd now, with the single-use masks added into the mix, the plastic pollution in our oceans and water bodies has significantly gone up. There have already been reports of several animals and birds choking on the masks. In April, a story went viral of a lady from British Columbia who she found a bird with its beak and wing entangled in a blue medical face mask. The bird had died.\n\nIn July, a seagull was caught in the elastic of a disposable mask for a week in Essex, until folks were able to rescue it.\n\nOceansAsia, an organization that works to solve the issues around environment, released a report back in February, at the very beginning of the pandemic that their survey team’s trip to Soko’s Islands in Hong Kong found hoards of surgical masks washing up on the shoreline.\n\nBut knowing about these incidents is not enough and we all can do our part in keeping ourselves and our loved ones safe during the pandemic, without harming other species. Some of the things we could do would start with trying to avoid single-use masks. These masks are great, cheap and readily available; they don’t involve washing and are a quick solution but they are also very, very harmful for the environment if not discarded properly. These masks are also mandatory if you are in the medical profession, but if you are not, you could just buy or make a reusable mask and not only avoid single-use masks’ pollution but also reduce the overall load of our plastic pollution.\n\nTry and find out if your local recycling facility or someone local in the area would collect and dispose off these masks properly or throw them in garbage receptibles (yes, I am talking to those of you who are choosing to just abandon their masks at beaches and parks and sidewalks).\n\nAnother thing we could do is cut out the straps of the single-use masks before throwing them away so that animals and birds don’t get entangled in them like our flying friend from British Columbia.\n\nYes, single use masks might be convenient for us, but they are certainly not convenient for our fellow species. Now that people are moving around freely and openly in the public, at least more than before, the use of masks is only going to go up while Covid is still around. And, it is our responsibility to ensure that we are not just taking care of ourselves but the environment we are living in as well.\n\nPriyanka Ketkar\n\nMultimedia journalist\n\n@PriyankaKetkar\n\n\n\npriyanka.ketkar@ldnews.net\n\nLike us on Facebook and follows us on Twitter.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-18 01:30:00-08:00",
    "title": "Are you disposing your masks properly? – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/are-you-disposing-your-masks-properly/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}