{
    "authors": [
        "Associated Press"
    ],
    "content": "‘I Am Greta,’ which debuts Friday on Hulu, is the first documentary to chart the meteoric rise of Thunberg\n\nThis image released by Hulu shows activist Greta Thunberg in a scene from the documentary “I Am Greta.” The film premieres Friday on Hulu. (Hulu via AP)\n\nIn the first days of Greta Thunberg’s solitary sidewalk protest outside Swedish Parliament in August 2018, most walk right past her. Some pause and ask why she’s not in school. But people steadily begin to take notice of the steadfast 16-year-old girl.\n\nThose humble beginnings of Thunberg’s protest — the unlikely birth of a global movement — are seen in the opening minutes of the new documentary “I Am Greta.” Since then, Thunberg has met world leaders, been vilified by others, and seen countless join her in an ever-growing resistance to environmental complacency. It’s a journey she readily describes as totally surreal — “It’s like living in a movie and you don’t know the plot,” she says — but also affirming.\n\n“I look back and I remember how it felt. I think: Oh, I was so young and naive back then — which is quite funny,” says Thunberg, recalling her first days of protest in an interview. “So much has changed for me since then but also so much hasn’t changed from the bigger perspective.”\n\n“I feel like now I’m happier in my life,” she adds. “When you do something that’s meaningful, it gives you the feeling that you’re meaningful.”\n\n“I Am Greta,” which debuts Friday on Hulu, is the first documentary to chart the meteoric rise of Thunberg from an anonymous, uncertain teen to an international activist. As an intimate chronicle of a singular figure, it plays like a coming-of-age story for someone who seemed, from the start, uncannily of age. The film, directed by Nathan Grossman, captures the head-spinning accomplishments, and the toll they sometimes take, on the bluntly impassioned Thunberg.\n\nFor an activist who insists on putting the cause before herself, it’s also a somewhat uncomfortable acceptance of the spotlight. “I haven’t really achieved anything,” Thunberg says, speaking by phone from Sweden. “Everything the movement has achieved.”\n\nShe doesn’t endorse everything about the documentary. It should come as no surprise that Thunberg, who has called her Asperger’s syndrome her “superpower” — a condition she believes only enhances her ability to be straightforward and focused — has a few notes.\n\n“I don’t really like the title of the film, ‘I Am Greta.’ It makes it seem like I take myself very seriously,” says Thunberg. (In Sweden, the film is simply called “Greta,” but that title was recently taken by the 2018 Isabelle Huppert film.) “Also the poster. I look like I have make-up on. I don’t like the poster and the title.”\n\nGrossman began filming Thunberg soon after she began protesting in August 2018, but he didn’t expect much from it. He told Thunberg he might not stick around for more than a few hours. He shot in half-resolution to save memory cards.\n\nBut as time went on, and young people around the world began following Thunberg’s lead, Grossman realized he had unwittingly captured the first moments of an unfolding zeitgeist. The project evolved and Grossman continued to shadow Thunberg up to her scorching speech at the United Nations in which she admonished world leaders: “We are in the beginning of a mass extinction, and all you can talk about is money and fairy tales of eternal economic growth. How dare you.”\n\n“She felt that a movie about her could help clarify things,” says Grossman. “In the media, I think, she hasn’t felt that she recognized herself. The one-dimensional character of Greta is a very angry, frustrated girl. In the movie, you see so much more — that she’s also funny and has different sides.”\n\nPart of the power of Thunberg is that, as a 17-year-old, she literally embodies a future imperiled by the inaction of older generations. “I Am Greta” is in a way a profile of generational divide, where adults and politicians line up to take selfies with a young woman who despite her stature sometimes struggles to get out of bed for an appointment or cries for home while sailing across the Atlantic.\n\nBut if Thunberg, Time magazine’s Person of the Year in 2019, is recognizably human in “I Am Greta,” she’s also ruthlessly frank. She doesn’t mince words on Earth’s trajectory. She dismisses superficial gestures for change. And she shrugs off those who dismiss or mock her message. Asked how she felt watching news clips of Donald Trump and Vladimir Putin deriding her in the film, Thunberg laughs.\n\n“That’s one of the highlights! It’s hysterically funny,” Thunberg says. “It just proves that you’re doing something right. If you’re being attacked by these kinds of people that shows you’re doing something right. It just shows how desperate they are not to talk about the climate.”\n\nDuring the pandemic, Thunberg has seen climate slip from front pages. But she wishes the climate could generate the same level of alarm that COVID-19 has. “It feels like we’re stuck no matter what we do,” she says. “We won’t achieve real change unless we actually start to treat the climate crisis like a crisis.”\n\nIn September, Thunberg was again outside Swedish Parliament for a socially distanced climate protest, part of thousands of school strikes held that day. But watching the U.S. presidential debates, where climate was a little-discussed issue and summarily dismissed by Trump, she says, has been eye-opening.\n\n“It surprises me. I knew the situation in the U.S. was bad when it comes to climate, that it’s being treated as an opinion rather than actual scientific fact, but I didn’t know it was this bad,” says Thunberg. “Europe and Sweden, we are very, very far from where we need to be in the discussion. But compared to the U.S., it’s just surprising.”\n\nEarlier this fall, Thunberg returned to school after taking a year off.\n\n“I’ve missed it a lot. It just feels very good to be back in school and to do normal things, to have routines. I love routines — that’s probably a lot because of my autism,” she says. “And in this environment, I’m almost anonymous in a way. People know who I am, of course, but I’m not there because I’m famous. I’m there to do something else, I’m just like the rest.”\n\nAnonymity might no longer be a long-term option for Thunberg, who will turn 18 in January. But it’s a tradeoff she will make. When she reflects on the last two years, she sounds dangerously close to being something few would label Thunberg: an optimist.\n\n“Before I started doing this, my experience was that no one cared. Now I’ve been proven wrong. Obviously, many people, especially young people, care about the climate crisis and the future, and that’s encouraging,” says Thunberg. “Humanity has not yet failed. We are failing, but humanity has not failed.”\n\nJake Coyle, The Associated Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nClimate change",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-10 15:30:00-08:00",
    "title": "Greta Thunberg on 2 very surreal years of protest and fame – Houston Today",
    "url": [
        "https://www.houston-today.com/entertainment/greta-thunberg-on-2-very-surreal-years-of-protest-and-fame/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}