{
    "authors": [],
    "content": "While the US Election is a hot button topic right now, there is more written on it than we have the time and energy to consume and so I want to focus on something different, more local today.\n\nWith Covid-19 cases on the rise despite the travel restrictions, the 14-day mandatory quarantine period for international or returning travellers in Canada has become a source of pain for many, and at the same time an extremely expensive affair.\n\nSome of you might already know this, but when I came to Canada, I had to quarantine for 14 days. While I appreciate the caution and how the government checked in on us to ensure we are actually quarantining and are well, I don’t appreciate the high costs and loss of days and hours locked up in a hotel, when the alternative was getting us tested and reducing our quarantine time. Back then of course, Covid was still new and test availability wasn’t widespread. But it has been several months since and not only is testing available today, several airports are already implementing testing for arriving and often departing passengers.\n\nIndia lets you take a test 96 hours before your journey. If you upload a positive test, you are not required to do the seven day institutional quarantine and are able to go home to quarantine. Another option is to get a PCR test done at the airport, the results of which come back within eight hours and a negative test sends passengers home without having to quarantine.\n\nOther places like Alaska, Connecticut, New York and several other airports in US have been requiring international and often out-of-state passengers to either arrive with proof of a negative COVID-19 test or get a test done upon arrival and self-quarantine until they get their results.\n\nSingapore, Austria, Hong Kong have also been testing at some of their airports.\n\nAnd while I was all set to write about how Canada is behind in this type of testing, I heard some exciting news for Canada. After several months of 14-day quarantine mandates, Canada might finally be moving to a more traveller-friendly methodology.\n\nAirCanada recently concluded a pilot test of 13,000 travellers in a bid to convince the government to make such tests available for travellers. More than 99 per cent of the tests came back negative while out of the ones that came back positive, more than 80 per cent were identified on the initial test, and the remaining few were detected after a followup test seven days later. That means, there is potential for a seven day quarantine instead of the full 14-day one.\n\nToronto’s Pearson International Airport has now started getting passengers arriving in the country on Air Canada flights tested in an extension of that pilot program.\n\nAlberta, with the federal government’s blessing launched a pilot program to test travellers coming in through Calgary International Airport and the Coutts land border crossing and helping cut down the quarantine period by taking a test on arrival.\n\nYes, Canada is just now starting the airport testing, and yes the cases are still on the rise so travelling extensively just because the tests could be available is not wise, but it really is high time these are standardized and expanded beyond the pilot program. I completely support being cautious and careful but I also support accuracy. And the tests, if accurate, would mean being detected early for those affected instead of just sitting at home for 14 days and those not affected, would not have to sit and worry for 14 days wondering if they have Covid-19.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-11 01:30:00-08:00",
    "title": "What’s happening with travel and quarantine? – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/whats-happening-with-travel-and-quarantine/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}