{
    "authors": [
        "Priyanka Ketkar"
    ],
    "content": "Last week, Democracy Watch, the non-profit that works on government accountability and reform in democracy, filed a lawsuit against John Horgan’s call for snap elections. In the words of the organization’s co-founder Duff Conacher, “By calling a snap election instead of waiting for the fixed election date a year from now, Premier Horgan acted like an old dictator not a new democrat” and this is despite agreeing to a fixed election date in 2001.\n\nFurther south in US where this week would mark the Presidential elections, Donald Trump on a number of occasions has suggested that the mail-in voting would lead to making “2020 the most inaccurate and fraudulent election in history” and has asked to delay the elections. From threatening to go the Supreme Court over the election results to spreading fear over mail-in ballots, the president has incessantly tried to undermine democratic process.\n\nUnfortunately, this is not it. V-Dem has recently published their Democracy Report 2020, stating that democracy is on the decline all over the world with autocratization on the rise. The report suggests that for the first time since 2001, autocracies are in the majority with 92 countries that make up a total of 54 per cent of the global population. According to the report, Canada ranks 21 out of 179 and still remains a liberal democratic nation however several countries that were formally electoral democracies are showing severe decline and autocratization is affecting countries like Brazil, India, USA and Turkey.\n\nFrom serious human rights violations to election rights violations, countries all over the world seem to be forgetting what democracy means and who it is for. Democracy is essentially a political system to choose and replace government through free and fair elections, a concept that allows active participation of its citizens, in politics and civic life; a concept that protects human rights of all citizens and a concept that upholds the rule of law where rules and laws apply equally to all citizens. It is however looking more and more like the elected representatives who are supposed to be putting together a government that is of the people, by the people and for the people, are more interested in pushing forward their agendas.\n\nWhether or not the call for snap elections was illegal as the organization claims, is for the courts to decide, whether or not to believe in Trump is up to the people of his country to decide but what is in people’s hands is to hold their governments accountable whenever they see them wavering away from democracy. Go out and vote whenever a call for elections is made, help stop spread of false and factually inaccurate statements made by people in power and strive constantly to make the planet a better place to live — for ourselves and for the generations to come.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-04 01:30:00-08:00",
    "title": "Several Democracies are on decline — and that’s a scary thought – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/several-democracies-are-on-decline-and-thats-a-scary-thought/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}