{
    "authors": [],
    "content": "Thirty years ago, the federal department of Fisheries and Oceans (DFO) mismanaged the Atlantic cod fishery into near oblivion – ignoring the scientists who foresaw the collapse.\n\nInstead, DFO rigged the science to support an unsustainable commercial fishery. Politicians vowed “never again” and enshrined the precautionary principle into law – always err on the side of caution – but did nothing to reform the institution responsible for one of the world’s greatest self-inflicted ecological disasters. Today, DFO does whatever is necessary to support Atlantic salmon farming along B.C.’s coast to the significant threat of wild Pacific salmon.\n\nOnly Canada allows the farming of Atlantic salmon on the migration routes of wild Pacific salmon. And, just like thirty years ago, DFO continues to rig science so it can skirt its primary duty to protect B.C.’s iconic, keystone species.\n\nIn 2009, after conducting a three-year federal Inquiry into declining salmon runs, Mr. Justice Cohen saw the essential problem – DFO might ignore fish farming’s risks to promote the industry. Along with 74 other recommendations, he recommended that DFO not be required to both promote and regulate fish farming. But, DFO’s conflicted mandate persists.\n\nIn 2015, the Federal Court found DFO had not adhered to the precautionary principle – the law of our land – when regulating the foreign Piscine orthoreovirus saying DFO’s “arguments with respect to the precautionary principle are inconsistent, contradictory and, in any event, fail in light of the\n\nevidence.” Four months later, DFO reinstated the same policy, adopting a risk threshold that prohibited only risks that could sterilize entire populations, species, or ecosystems. The Federal Court again struck down the policy, which DFO reinstated and is before the Federal Court for a third time.\n\nIn 2018, the Auditor General found DFO was woefully behind in its risk assessments, was not enforcing aquaculture regulations, and was “vulnerable to claims that it prioritized the aquaculture industry over the protection of wild fish.” The same year, Canada’s Chief Scientist recommended DFO have unbiased advice from an external advisory committee. Still, no external oversight exists.\n\nIn December 2019, our Prime Minister mandated DFO’s minister to transition B.C.’s “in ocean” salmon farms on to land by 2025. Welcome words. But, almost a year later, British Columbians and the 102 B.C. First Nations which support this transition have seen no action by DFO.\n\nMr. Justice Cohen also recommended fish farming in the Discovery Islands (a bottleneck for migrating salmon) be prohibited by September 30, 2020, unless DFO could confidently say the farms there posed less than minimal harm to wild Pacific salmon.\n\nOn September 28, 2020, with the Fraser River experiencing the worst sockeye returns in history, and with the Minister absent, DFO officials proclaimed that the Discovery Island fish farms posed less than a 1% risk to Fraser River sockeye. They did not explain how they calculated this risk or how their conclusion factored into the Prime Minister’s mandate to transition the open net-pens by 2025. They did admit, in response to a question, that they had not included sea lice from fish farms in their assessment. Well- established science shows that sea lice from fish farms kill out-migrating juvenile salmon.\n\nJust four days earlier, John Reynolds, an aquatic ecologist at Simon Fraser University and chair of the Committee on the Status of Endangered Wildlife in Canada, the committee responsible for designating endangered species said: “We have an overwhelming weight of evidence from research coming at this from all different directions. The current open-net pen fish farm model that we have is not compatible with protecting wild fish.”\n\nThankfully, one of DFO’s top scientists is speaking out. Dr. Kristi Miller-Saunders, head of DFO’s molecular genetics laboratory in Nanaimo and adjunct professor at the University of British Columbia, described how DFO’s dual role as regulator and industry advocate, coupled with its reliance on industry funding for research, skews risk assessments in favour of the fish-farm industry. Let’s watch what happens to Dr. Miller-Saunders now.\n\nIn the ten years DFO has regulated fish farming in B.C., a former B.C. Supreme Court judge, two Federal Court judges, the Auditor General’s office, Canada’s Chief Scientist, DFO’s own scientists, B.C. First Nations, and numerous NGOs have all sounded the alarm. But, so far, the politicians have done nothing to reform the institution mismanaging wild Pacific salmon to extinction.\n\nOur leaders must act now and not wait to say, “never again,” again.\n\n– Tony Allard, chair of Wild Salmon Forever",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-06 19:00:00-08:00",
    "title": "OPINION: Biggest threat facing wild Pacific salmon is Fisheries and Oceans Canada – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/opinion-biggest-threat-facing-wild-pacific-salmon-is-fisheries-and-oceans-canada/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}