{
    "authors": [],
    "content": "BC Teachers’ Federation President Teri Mooring is asking parents of school-aged children to encourage the wearing of masks when possible in schools. (THE CANADIAN PRESS/Chad Hipolito)\n\nDear parents,\n\nB.C.’s teachers care deeply about our students, your children.\n\nWe are all working incredibly hard to make sure they are safe and receiving the best education possible during this terrible pandemic.\n\nNothing about this school year has been easy and all of us are feeling stress and anxiety. We’re worried about COVID-19 affecting our students, our families and ourselves. Making sure our schools and classrooms are safe for our children and yours has been the top priority for us all.\n\nNow, as B.C. is gripped by this surging second wave of the coronavirus, we’re reaching out to you for some help.\n\n#BCed teachers are committed to providing our students with supportive and enriching learning environments. We also need them to be safe. Please help make that happen. We encourage you to talk to your children and encourage them to wear masks. #bcpoli — BCTF (@bctf) November 24, 2020\n\nWhile masks are not mandatory at all times in schools, we’re hoping you can help us support a culture of mask wearing. Some schools have already taken this step. The school community has come together and made mask wearing normal and expected. It really helps everyone in our schools feel safer. We need to be doing all we can to ensure we keep each other safe. No one wants to bring COVID-19 home to their families.\n\nWe know there are students and staff members who for various reasons can’t wear masks. And, there are some learning situations where masks aren’t appropriate. That’s all OK. Our school communities have a lot of experience making sure people are included and treated with kindness and respect.\n\nBy talking to your children about wearing their masks in school, you can help us create that respectful culture of mask wearing.\n\nRead more: B.C. teachers’ union calls on Horgan to limit Fraser Health class sizes to 15 students\n\nRead more: B.C. labour board to provide neutral ‘troubleshooters’ for COVID-19 school plans\n\nBCTF members, your children’s teachers, are committed to providing our students with supportive and enriching learning environments. We also need them to be safe. Please help make that happen. We encourage you to talk to your children and encourage them to wear masks.\n\nTeri Mooring,\n\nPresident,\n\nBC Teachers’ Federation\n\nBritish ColumbiaSchools",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-11-24 13:10:00-08:00",
    "title": "LETTER: Teachers union encourages culture of mask wearing in B.C. schools – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/letter-teachers-union-encourages-culture-of-mask-wearing-in-b-c-schools/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}