{
    "authors": [],
    "content": "On Oct. 21, NASA astronaut, Chris Cassidy and cosmonauts Ivan Vagner and Anatoly Ivanishin returned to earth after spending 196 days in space, living and working in Earth’s orbit on the International Space Station.\n\nMy first thought when I read this was that these astronauts spent most of the pandemic, socially and physically distanced from Earth and what a blessing that must have been for them. But then again, that is their way of living. They expect and know that they will be away from everyone for long stretches of time but that doesn’t mean they must be immune to loneliness and anxiety from separation from rest of the humanity.\n\nWhile there are a few things astronauts have said through their interviews and books over the years, like keeping yourself surrounded by memories of the loved ones, communicating with loved ones, having a mission in life that will keep you going, exercising and eating meals by breaking bread together with someone, there is one particular book that I recently read called An Astronaut’s Guide to Life on Earth, by Canadian astronaut Chris Hadfield, that is really inspiring.\n\nI came across the book through something I read about Serena Fan, the founder of the Hong Kong Children’s Discovery Museum who was so inspired by the book that she not only started implementing some of the suggestions in her day-to-day life but also in her work and during Hong Kong protests.\n\nIf a book has that many applications for our lives, we must pick up it, right?\n\nThe autobiography is a great tool to look into the lives of astronauts and to understand some ways of dealing with anxiety, loneliness and stressful situations. It is not just someone coming up with logically sound arguments on how to deal with stress but lived experience of someone who faced stressful and unforeseen circumstances on a daily basis.\n\nHaving checklists, practising for worst-case scenarios often, having different solutions ready after having thought of the different types of problem that could arise out of a situation are just some of the many gems in the book.\n\nHow do astronauts manage to stay so calm and composed in the face of disasters? How are they able to make the right decisions in extremely life and death-defining moments? These are some of the questions, the answers to which could help us all not just during a pandemic, but even in every day lives.\n\nWhat kind of inspirations have you come across in the past eight months to help you get through every day. Write to us and let us know of what moves you.\n\nPriyanka Ketkar\n\nMultimedia journalist\n\n@PriyankaKetkar\n\n\n\npriyanka.ketkar@ldnews.net\n\nLike us on Facebook and follows us on Twitter.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-10-28 01:30:00-08:00",
    "title": "What astronauts can teach you about distancing and stress – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/what-astronauts-can-teach-you-about-distancing-and-stress/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}