{
    "authors": [],
    "content": "In the last two weeks of October, a large part of Canada celebrates something called, Take Me Outside Day, a day for children to learn outside and for teachers to inculcate in them the importance of stepping outside. This year, this day will be celebrated today, on Oct. 21.\n\nIt is a little sad that in a place like Canada, where there is so much of nature to enjoy, a place where kids can run and play freely in their large backyards or directly amidst mountains and near lakes, there is still a need to have a day to teach and learn the importance of being outside. It is sad because this should be an everyday thing here but in today’s world, despite having nature as our backyard, we have so many distractions in the form of internet, streaming services and video games that stepping outside has become extremely difficult for many however having such a day then is an awesome idea. Of course, here in Northern B.C., I have seen more kids and teens knowing and enjoying the outdoors than others but it is still not enough to have a handful of children understanding the outdoors.\n\nAs someone who has grown up and lived in a city all my life, mountains and lakes were reserved for vacations and going outside didn’t involve much physical activity or being one with nature as such. Thankfully with parents who loved to travel, I had many opportunities to learn to be outside during vacations however it is obviously not the same as staying in nature and enjoying it. If the children everywhere, be it remote towns and villages or cities, are constantly encouraged to be outside and understand and appreciate nature, it will be transformative for their personalities.\n\nA living proof of such learning can be found in Tetsuko Kuroyanagi’s autobiographical memoir Totto-chan. I was first introduced to the concept of education that wasn’t confined within textbooks and walls through this book. Totto-chan’s unique school set up inside train bogies does’t just believe in teaching textbook knowledge but also about good behaviour, financial management, nature, things around us and most importantly importance of being yourself and being one with nature. This isn’t a fictional school either, once upon a time, this school actually existed and Kuroyanagi herself went to this school and was transformed from a bratty child bored of the school curriculum, expelled from her old school, to someone completely devoted to her new school’s experience.\n\nIt is really exciting to learn about such projects for children and I, for one would definitely love to hear from you, if your kids or schools are undertaking any such exciting projects that would take kids outside, help them learn from nature and help them be one with it. So, what are you doing to learn outside?\n\nPriyanka Ketkar\n\nMultimedia journalist\n\n@PriyankaKetkar\n\n\n\npriyanka.ketkar@ldnews.net\n\nLike us on Facebook and follows us on Twitter.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-10-21 01:30:00-08:00",
    "title": "Being outside — a transformative experience all kids need – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/being-outside-a-transformative-experience-all-kids-need/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}