{
    "authors": [],
    "content": "Nearly 100 countries enacted temporary restrictions or bans on the export of medical products this year\n\nMost lanes remain closed at the Peace Arch border crossing into the U.S. from Canada, where the shared border has been closed for nonessential travel in an effort to prevent the spread of the coronavirus, Thursday, May 7, 2020, in Blaine, Wash. The restrictions at the border took effect March 21, while allowing trade and other travel deemed essential to continue. (AP Photo/Elaine Thompson)\n\nDuring the COVID-19 pandemic, countries around the world have faced acute shortages of personal protective equipment (PPE), medicines and other essential medical supplies, severely compounding the health crisis. Such shortages remain an acute and pressing problem, and are expected to worsen during a second wave.\n\nMany countries have responded to shortages by imposing export restrictions in an effort to bolster their own domestic supplies. But even though governments should seek to protect their populations, the use of export restrictions is damaging to global health systems — and ultimately undermines efforts to combat the coronavirus.\n\nAt the onset of the pandemic, nearly 100 countries enacted temporary restrictions or bans on the export of medical products.\n\nGermany and France, for example, placed export restrictions on medical equipment and drugs, which were followed by an European Union-wide ban on medical equipment exports to non-EU countries.\n\nIndia — the world’s largest pharmaceutical manufacturer — restricted the export of dozens of drugs, including acetaminophen and various antibiotics.\n\nThe United States halted the sale of masks and other medical gear to foreign buyers. A range of other countries followed suit, imposing various forms of restrictions, ranging from outright export prohibitions to cumbersome licensing requirements to discourage exports.\n\nRestrictions could escalate in second wave\n\nWhile some export restrictions have since been removed, many remain in place. And with a second wave looming, there is a risk that the use of such restrictions will escalate once again.\n\nExport restrictions hurt the countries that implement them, as well as their trading partners, by preventing deliveries of medical supplies and medicines, which can seriously disrupt health planning.\n\nExport restrictions can temporarily lower domestic prices and raise availability, giving the illusion of efficacy, but they discourage investments to increase production capacity, so any benefit is short-lived.\n\nCountries that impose export restrictions are also likely to fuel retaliation or emulation by other nations, cutting off their own access to medical products and components.\n\nExport restrictions therefore reduce the domestic availability of medical supplies, while also promoting panic-buying, hoarding and speculation.\n\nThe World Trade Organization (WTO) is supposed to prevent governments from arbitrarily imposing barriers to the flow of goods across borders. But during the COVID-19 crisis, its rules have failed to stop countries from imposing export restrictions.\n\nExisting WTO rules give considerable scope to governments to respond to emergencies, including permitting trade measures to protect human health, and allowing temporary export restrictions to prevent or relieve shortages of essential products.\n\nFull self-sufficiency impossible\n\nSome have suggested that the answer to supply shortages is to reshore production, so that each country produces its own medical supplies.\n\nBut that’s neither realistic nor desirable. Medical supply chains are global in nature and, given the complexity of the products involved, it would be impossible for any one country to be fully self-sufficient.\n\nTo take just one example, ventilators require as many as 1,000 parts, coming from dozens of countries and nine layers of suppliers. Trade in medical supplies and the components required to produce them is, therefore, essential.\n\nFour recommendations\n\nWe propose four policy directions to address the trade-related aspects of the crisis:\n\n1. Governments must strengthen their commitment to prevent export restrictions in critical medical supplies. A group of nine countries, led by New Zealand and Singapore, has launched a multi-country pact to keep supply chains open and remove trade restrictions on essential goods. This initiative should be expanded through a WTO agreement to refrain from introducing measures that restrict trade in medical supplies.\n\n2. Governments should pursue diversification, rather than domestication, of medical supply chains. Countries are most vulnerable to serious shortages when they rely heavily on just a handful of suppliers for critical goods, regardless of whether those suppliers are domestic or foreign. Diversification is therefore the best way to reduce the risk of supply chain disruptions.\n\n3. Rather than competing with one another for scarce medical goods, states should be collaborating to address the underlying problem. Amid a global pandemic, beggar-thy-neighbour (or sicken-thy-neighbour) trade policies intended to bolster a country’s own medical supplies at the expense of others are counter-productive. Instead, the most effective means to address the supply shortage is through international co-operation to boost production, diversify medical supply chains and ensure supplies can move to where they are needed the most.\n\n4. Governments must significantly increase their investment in stockpiling reserves of essential medical supplies. Many countries maintain such stockpiles — containing everything from masks and gowns to ventilators — but chronic under-funding left them dangerously unprepared for the current crisis. When the pandemic hit, countries rapidly depleted their limited stocks. The resulting supply shortage was caused not by dependence on trade, but a failure in planning.\n\nExport restrictions are damaging both to the countries that implement them as well as their trading partners. As we stare down a second wave of COVID-19, there are far better alternatives to prevent shortages and ensure adequate supply of medical goods.\n\nKristen Hopewell receives funding from the Social Sciences and Humanities Research Council of Canada (SSHRC). Joshua Tafel does not work for, consult, own shares in or receive funding from any company or organization that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-10-08 09:30:00-08:00",
    "title": "OPINION: Why trade restrictions must be eliminated during 2nd wave of COVID-19 – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/opinion-why-trade-restrictions-must-be-eliminated-during-2nd-wave-of-covid-19/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}