{
    "authors": [],
    "content": "A little talked about dimension of the impact of COVID-19 on the provincial labour market is the differing regional employment profiles. Upon inspection, these turn out to be significant.\n\nThe biggest job losses, in absolute terms, have been in Metro Vancouver. This is not surprising, since about half of the province’s population lives there. But proportionally, Metro Vancouver has been harder hit by the virus-driven recession than other parts of the province. Employment in Metro Vancouver is still down 12 per cent from February. In comparison, B.C.’s other three other census metropolitan areas – Abbotsford-Mission, Kelowna, and Greater Victoria — have seen more moderate job losses in the range of 5-7 per cent.\n\nMeanwhile, the job numbers for non-metro British Columbia are striking. Collectively, employment in regions of the province other than the four census metropolitan areas has fully recovered since the spring. True, some non-metropolitan local economies have been more affected than others. But in general, smaller cities and rural areas have fared better in terms of job losses, particularly compared the province’s largest urban centre.\n\nThe fact that Metro Vancouver has experienced the steepest job losses reflects the region’s industrial and employment mix. Industries hammered hardest by the lockdown of consumer-facing business and the virtual cessation of international travel have an over-sized presence in the lower mainland’s economy relative to non-metropolitan regions as well as the province’s other three census metropolitan areas.\n\nThe impacts of no cruise ships, significant job losses in air transportation, no tour operators, the cancellation of all major audience-attended sporting events and concerts, no conventions, shuttered casinos, the reduction in business travel, and a bare trickle of international tourists – all of these are felt most acutely in Metro Vancouver.\n\nThe industries that remain fully or partially closed are heavily represented in the City of Vancouver and its surrounding suburbs. Coupled with the shift to remote working – starkly evident in the strange near-emptiness of downtown Vancouver – these trends have delivered a body blow to large segments of the Metro Vancouver economy.\n\nMany businesses in the region’s tourism, travel, event and accommodation sectors have been struggling to survive. And lots of lower mainland retailers have also seen traffic drop off sharply.\n\nOn the other hand, manufacturing, forestry, mining, oil and gas, and agriculture have regained all of the jobs lost since February, and then some. These industries are over-represented in regions of B.C. beyond Metro Vancouver.\n\nIn addition, it should not be overlooked that the public sector’s economic footprint is often proportionally larger in small communities – and most public sector organizations have not laid off staff since February. Thus, the relative stability of public sector jobs has also supported employment in non-urban areas of the province.\n\nPolicy makers should be alive to the comparative strengths and weaknesses of both urban and non-metropolitan economies amid the ongoing COVID-19 saga. It is important to pay attention to the economic health of the industries underpinning different communities and regional economies.\n\nOf interest, several of B.C.’s leading export industries have continued to operate during the pandemic, and these industries are central to the economies of non-metropolitan regions. B.C. needs to build upon the relative resiliency of our export-oriented industries to support the regions where they are based.\n\nIn Metro Vancouver, making further headway in regaining lost jobs depends on reopening closed or partially operating sectors as well as the return of international travel, business meetings and conventions. Absent an effective vaccine or herd immunity being achieved, the employment recovery in Metro Vancouver and some other B.C. urban areas is apt to be both sluggish and uneven.\n\nJock Finlayson is executive vice president and chief policy officer of the Business Council of British Columbia",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-09-30 18:30:00-08:00",
    "title": "FINLAYSON: COVID-related job losses concentrated in urban areas… especially Metro Vancouver – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/finlayson-covid-related-job-losses-concentrated-in-urban-areas-especially-metro-vancouver/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}