{
    "authors": [
        "The Canadian Press"
    ],
    "content": "‘Humanities play an essential role in aspects of global competence which have not been the focus of the STEM’\n\nby Alan Sears, University of New Brunswick and Penney Clark, University of British Columbia\n\nFinally, someone has figured out how to put an end to students wasting their lives in the quixotic pursuit of knowledge associated with the humanities.\n\nThe government of Australia announced in June a reform package that would lower fees for what are considered “job-relevant” university courses while raising the cost of some humanities courses. Under the proposed changes, “a three-year humanities degree would more than double in cost.” English and language course fees, however, are among those being lowered.\n\nThese reforms are proposed as part of larger changes to post-secondary funding as Australian universities, like Canadian and other global universities, find themselves grappling with the seismic impacts of COVID-19.\n\nThey also reflect larger trends towards what’s considered market-friendly learning. Around the world, educational policy-makers have chipped away for years at the position of the humanities in school curricula at every level to make more room for the so-called STEM disciplines (science, technology, engineering and mathematics). The humanities is typically considered to include the arts, history, literature, philosophy and languages.\n\nEducational reforms\n\nThe Australian reforms are intended to boost enrolment where the government says more “job-ready graduates” will be needed “in health care, teaching and STEM related fields, including engineering and IT.”\n\nThe cost changes apply per course, so that “by choosing electives that respond to employer needs … students can reduce the total cost of their study.” The proposed reforms aim to make it cheaper to undertake post-secondary studies in areas of expected job growth.\n\nSuch reform efforts are part of a larger global push aimed at establishing the STEM disciplines as central to public education.\n\nIn New Brunswick, this has been illustrated in a series of educational reforms emphasizing the centrality of economic priorities to shaping public education. These reforms promote a focus on literacy (not literature), numeracy and science. For example, the province’s 10-year education plan, published in 2016 speaks of reviewing “… high school course selections in the arts, trades and technology, with a view to revising, developing and clustering courses to address labour market and industry requirements.…”\n\nThe New Brunswick reforms, and many other such efforts, have largely excluded input from teachers, parents, students and local communities. They’ve focused on the standardization of education systems, while ignoring global lessons about how more holistic approaches to education often produce significant system-wide academic success.\n\nThe new Australian policy takes a market-oriented approach focused on using financial incentives to encourage certain choices. Australia is definitely ahead of the curve on this one. Or is it?\n\nEconomic goals in public education\n\nNo single organization has had more impact on the global move toward prioritizing economic goals in public education than the Organization of Economic Co-operation and Development (OECD), through its Program for International Student Assessment (PISA).\n\nPISA is an international testing program that has traditionally assessed student achievement in reading, mathematics and science in almost 100 countries and regions around the world. The results generate press and shape discussions and decisions about educational policy and practice in important ways.\n\nOne group of education scholars writes that “PISA has arguably become the most influential educational assessment today,” and emphasizes that the program was developed to assist the OECD with its economic mandate and that this rationale informed the assessment’s framework and continues to guide its development.\n\nIn recent times, growing social and cultural fragmentation have created challenges for the world’s economies and prompted a rethink even in the OECD of the kind of education necessary for a more comprehensive prosperity. In 2018 it moved the PISA program beyond the three traditional subject areas to begin assessing “global competence,” which it describes as “a multidimensional capacity.”\n\nLearning for ‘global competence’\n\nAccording to the OECD, “globally competent individuals can examine local, global and intercultural issues, understand and appreciate different perspectives and world views, interact successfully and respectfully with others, and take responsible action toward sustainability and collective well-being.”\n\nThe OECD believes “educating for global competence can boost employability,” and also believes that all subjects can introduce global competence.\n\nIt seems to us learning history and other humanities disciplines are effective ways to foster the elements of global competence outlined in their description.\n\nIn our recent book, The Arts and the Teaching of History, we make the case that sustained and systematic engagement with the humanities — including, history, literature and visual and commemorative art — is effective in fostering a number of positive humanistic and civic outcomes and competencies.\n\nThese include: complex comprehension of history and literature and the nature of truth; nuanced understanding of the relationships between history and collective memory and how those operate in the formation of individual and group identities; and, particularly important in contemporary Australia, Canada and elsewhere, engagement with Indigenous perspectives.\n\nThis is not to argue that the teaching of history, literature or other humanities subjects is without criticism. As they have appeared in school curriculum these subjects have often been overly focused on so-called western civilization. Marie Battiste, Mi’kmaw educator and professor in educational foundations at the University of Saskatchewan, in her book Visioning a Mi’kmaw Humanities: Indigenizing the Academy explores reframing the humanities to create:\n\n“ … a vision of society and education where knowledge systems and languages are reinforced, not diluted, where they can respectfully gather together without resembling each other, and where peoples can participate in the cultural life of a society, education and their community.”\n\nAppreciating different worldviews\n\nDoes anyone really believe that in the midst of vigorous public debates about what it means to build a just society, the world needs more people without the educational background to understand where their societies came from and how they developed? In the age of Black Lives Matter, rising Indigenous activism and substantial public engagement we need to educate people to take responsible action toward collective well-being.\n\nOf course, STEM subjects are critical in fostering understanding of issues related to sustainability and collective well-being. They are a necessary, but only a partial, aspect of any child’s education. The humanities play an essential role in aspects of global competence which have not been the focus of the STEM subjects.\n\nIf the study of history, society, culture or the arts dies, our societies may learn the hard way that it takes more than narrow job preparation to ensure that our students will flourish as human beings. Such flourishing includes willingness and ability to engage with the challenging and urgent social, cultural, environmental and political issues with which they are confronted in these times.\n\nAlan Sears and Penny Clark receive funding from the Social Sciences and Humanities Research Council of Canada\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nCoronavirus",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-09-30 11:30:00-08:00",
    "title": "OPINION: Stop telling students to study STEM over humanities for post-COVID world – Houston Today",
    "url": [
        "https://www.houston-today.com/opinion/opinion-stop-telling-students-to-study-stem-over-humanities-for-post-covid-world/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}