{
    "authors": [
        "Bill Metcalfe"
    ],
    "content": "Jamie Bastedo’s Protectors of the Planet looks at common traits of successful activists\n\nBiologist and writer Jamie Bastedo interviewed 11 prominent Canadian activists from several generations and tells us what makes them tick in his new book Protectors of the Planet: Environmental Trailblazers from 7 to 97. Photo: Submitted\n\nWhen the renowned B.C. naturalist and wolf biologist John Theberge was eight years old, he started a field journal in which he drew detailed drawings of butterflies. He kept it up for the rest of his life, which he has spent as a scientist and writer advocating for wilderness.\n\nWhen Sophia Mathur organized the first Canadian school climate strike in 2018 in Sudbury, Ont., she was 12, inspired by Greta Thunberg’s strikes in Sweden that eventually caught on around the world. She had already been a climate activist for several years before that, and she says she’s just getting started.\n\nTheberge and Mathur are two of 11 Canadian “environmental trailblazers” that author and biologist Jamie Bastedo of Nelson has profiled in his new book Protectors of the Planet: Environmental Trailblazers from 7 to 97.\n\nBastedo says that in the face of climate change, deforestation, species extinction, and ocean pollution, he was looking for fresh hope.\n\n“I reached out to people who embody a sense of acting in very positive ways, in inspiring ways, in practical ways,” he says.\n\nOther profiles include Sheila Watt-Cloutier, champion of Inuit culture; Anne Innis Dagg, giraffe researcher; Elizabeth May, activist and politician; and Ian McAllister, the writer, photographer, and activist who was a driving force behind the creation of the Great Bear Rainforest.\n\nBastedo interviewed them all, wondering what qualities or personal traits they share. He discovered some common threads in their childhoods.\n\n“They all had an early sense of dreaming a better world and a willingness to work hard,” he says. “They have a belief in the power of one to make a difference. There’s a real faith element to this sense of activism – finding one’s own voice, trusting in their own kind of wisdom, doing what they love.”\n\nBastedo said they all rigorously studied their chosen subject and have done their homework, from an early age.\n\n“They explore their subject from many angles, gather information. Information is power – actually several of them said that. But at the same time it’s not a head game, it’s very much capture the heart and the hand will follow.”\n\nHe said they all had adult mentors, often a teacher or parent.\n\nAlso profiled are Ethan Elliott, champion for bees; Kathleen Martin, sea turtle activist; Rupert and Franny Yakelashek, youth environmental rights activists; Karsten Heuer, wildlife biologist and explorer; and Cornelia Oberlander, green city landscape architect.\n\nBastedo says he wanted to explore a variety of environmental issues, profiling people from all generations and different parts of the country, hoping to find topics and themes in which readers might recognize themselves.\n\nHe admits there were some things he did not want to write about. He didn’t want to write a book focusing solely on climate change. He didn’t want to write another book of bad news facts, but rather about how some successful activists have dealt with those facts.\n\nAt the same time, he didn’t want to hide in an easy form of naive hope. He quotes Ian McAllister:\n\n“I feel sometimes that we’re witnessing the tail end of Earth’s magnificence and it’s just heartbreaking to think that my kids might not get to experience its true beauty, that they’re entering a very fragile, uncertain time. …”\n\n“We’ve had so many wake-up calls in the past few years,” McAllister continues, “It’s hard to believe we need more … We already know more than enough. Now it’s just a matter of waking up and taking action.”\n\nAnd Bastedo quotes Elizabeth May: “Being hopeful is not the same as being unrealistic. This is not the dreamy, dewy-eyed hope of the deluded … hope is hard work. Hope is a verb with its sleeves rolled up.”\n\nProtectors of the Planet is about people who have their sleeves rolled up. They were so enamoured of the world from an early age that acting for the planet seemed to spring naturally out of wonderment and love.\n\nThe book is available now in bookstores, online, and at Touchstones in Nelson where there will be a book launch on Nov. 22 at 2 p.m.\n\n\n\nbill.metcalfe@nelsonstar.com\n\nLike us on Facebook and follow us on Twitter\n\n\n\nSign up here Get local stories you won't find anywhere else right to your inbox.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-10-13 14:00:00-08:00",
    "title": "Nelson author launches book on Canadian environmental heroes – Houston Today",
    "url": [
        "https://www.houston-today.com/entertainment/nelson-author-launches-book-on-canadian-environmental-heroes/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}