{
    "authors": [
        "The Canadian Press"
    ],
    "content": "Henry said they would look at all the options and will wait until today to make the decision.\n\nProvincial Health Officer Dr. Bonnie Henry leaves the podium after a press conference in the press theatre at Legislature in Victoria, B.C., on Thursday, October 22, 2020. Provincewide COVID-19 restrictions are supposed to be lifted in British Columbia today, but there are indications that health officials will be extending limits on events, sports and social gatherings. THE CANADIAN PRESS/Chad Hipolito\n\nProvincewide COVID-19 restrictions are supposed to be lifted in British Columbia today, but there are indications that health officials will extend limits on events, sports and social gatherings.\n\nProvincial health officer Dr. Bonnie Henry said last week it was apparent that transmissions weren’t going down as they had hoped.\n\nShe said that extending restrictions isn’t a decision that she makes lightly or alone.\n\nHenry said they would look at all the options and will wait until today to make the decision.\n\nThe infection rate last week swung from a low of 606 to a high of 827 cases, while the death toll during the same period did not dip below 11 per day.\n\nThe health officer even updated restrictions late last week, suspending all indoor and outdoor sports for people 19 and over and stopping some high-intensity indoor group fitness classes like hot yoga and spin classes.\n\nREAD MORE: Horgan says COVID-19 relief promise top priority of short B.C. legislature session\n\nVIDEO: B.C. church defies provincial ban on in-person services for a second time\n\nThe Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism during the pandemic? Make a donation here.\n\nCoronavirus",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-07 07:40:00-08:00",
    "title": "Deadline is up for COVID restrictions in B.C., although top doctor hints at extension – Houston Today",
    "url": [
        "https://www.houston-today.com/news/deadline-is-up-for-covid-restrictions-in-b-c-although-top-doctor-hints-at-extension/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}