{
    "authors": [],
    "content": "Earlier this month, Coastal GasLink completed its first in-field pipeline weld in Kitimat. It will be the first of many thousands of welds as the project begins installing sections of the 670-kilometre pipeline later this summer. To date, nearly 400 kilometres of pipe have been delivered to storage sites across the project route, in preparation for installation.\n\nPipe installation is one of the key activities Coastal GasLink is preparing for as part of our measured and gradual ramp-up of work across the route over the coming weeks and months. Initially, work will continue to focus on environmental monitoring and field work, grading, grubbing and workforce accommodation establishment. Pipe deliveries continue, with pipe stringing and assembly commencing as early as July in multiple areas across the project.\n\nThis summer will also see construction kick off for the project’s Wilde Lake Compressor and Meter Station. Along with the Kitimat Meter Station, these facilities will eventually become the anchor points of the natural gas pipeline, as they ensure that natural gas moves through it safely and efficiently.\n\nAll this work will mean additional workforce and contracting requirements, with more than 1,500 workers by the end of July, and over 2,500 by the end of August with peak employment and activities in September.\n\nNorthern B.C. residents and businesses are integral to the success of the Coastal GasLink Project – from the skilled workers, to labourers, environmental technicians, caterers, registered nurses, and many businesses from across the north. As construction ramps up, we are excited to be fulfilling our commitment to Indigenous and local people and businesses who want to be involved in the project. To date, Coastal Gaslink has awarded $900-million in contracting opportunities to local and Indigenous businesses.\n\n“At Coastal GasLink, we’ve always recognized the value of partnering with local communities to provide lasting economic benefits today, and for decades to come,” said David Pfeiffer, Coastal GasLink’s President. “We are proud to be helping locals get back to work, and there is no more important time than now to ensure that we are maximizing the number of Indigenous and local workers benefitting from our project.”\n\nThe health and safety of our workforce, their families and surrounding communities remain at the forefront of everything we do. That is why Coastal GasLink is implementing enhanced project-wide health and safety standards. These standards were designed in accordance with Provincial Health Officer Dr. Bonnie Henry’s guidance, and are the result of our ongoing collaboration with Northern Health and local communities.\n\nCoastal GasLink is proud to be safely advancing our project, in a manner that will bring economic benefits and employment opportunities to local communities – today and for the long-term.\n\nLearn more about construction activities in your community, as well as job opportunities, by visiting CoastalGasLink.com.\n\nnatural gas",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-06-22 06:00:00-08:00",
    "title": "Safe and gradual ramp-up for summer construction underway on Coastal GasLink Project – Houston Today",
    "url": [
        "https://www.houston-today.com/marketplace/safe-and-gradual-ramp-up-for-summer-construction-underway-on-coastal-gaslink-project/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}