{
    "authors": [
        "Greg Sabatino"
    ],
    "content": "Critical care paramedic Tom and advanced care paramedic Laurence finish up a 14-hour work day after being deployed as part of a BC Emergency Health Services Rapid Response Team deployed to Fort St. James this week to help provide relief to local paramedics and health support workers due to a rising number of COVID-19 cases.. (BC Emergency Health Services photo)\n\nA BC Emergency Health Services team of paramedics deployed to Fort St. James this week to help deal with a surge in COVID-19 positive cases said it is impressed by how well the response has been handled in the community.\n\nThe Vancouver-based group of highly-trained paramedics, part of B.C.’s Rapid Response Team, were deployed on Wednesday, Dec. 9, on a four-day mission to the community of Fort St. James to support local paramedic staff on the front lines responding to extremely high call volumes — 33 calls in six days — a BC EHS spokesperson said.\n\nAt the time, a BC EHS spokesperson said the team was an ideal response to a region with 60-plus COVID-19 positive patients where there is only a small, acute care facility.\n\nFort St. James paramedics respond to and cover a community area that includes Fort St. James, the surrounding rural area and local First Nations communities with a total population of about 4,500 people.\n\nOn Thursday, Dec. 10 Northern Health confirmed the recent surge in lab-confirmed cases of COVID-19 across the region, including approximately 40 active cases in its coverage area of First Nations and non-First Nations communities in the Omineca Region.\n\nNak’azdli Whut’en Chief Aileen Prince, whose First Nation is located adjacent to Fort St. James, issued a statement Wednesday afternoon announcing a minimum, two-week shutdown.\n\n“This will help our community get this event under control and get the infection rate down,” Prince said.\n\n“Our health care system is being stretched to the max … our workers are getting very tired. They are our community members, too, and we need to make sure they are OK.”\n\nCOVID announcement from Chief Prince December 9th, 2020 Posted by Nak'azdli Whut'en on Wednesday, December 9, 2020\n\nWednesday’s deployment was the first time the Rapid Response Team had been mobilizied. The team is made up of two critical care paramedics, one advanced care paramedic and a primary care paramedic.\n\nREAD MORE: B.C.’s rapid response paramedics arrive in Fort St. James as district reaches 60 COVID-19 cases\n\nNorthern Health said it is grateful for the BC EHS support, and is working with First Nations communities, the health authority, and other health care partners as they continue to respond to COVID-19 needs in the Northern Interior.\n\nSince their arrival, the team has had two busy days of operations, including inter-facility transfers of patients from care facilities to hospitals, and supporting local crews, a BC EHS spokesperson said.\n\n“The accommodations and facilities made available to our rapid response team in the community have been gracious,” BC EHS said.\n\n“We’ve uncovered the incredible resilience and commitment of these employees to their community,” the team said in an e-mailed statement. “As we’re learning more about this we are learning how hard this crew has been working.”\n\nAsked whether BC EHS will extend its deployment, a spokesperson said they are evaluating the situation in terms of resources needed, on a day-to-day basis.\n\n\n\ngreg.sabatino@wltribune.com\n\nLike us on Facebook and follow us on Twitter\n\nCoronavirusNorthern Health",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-11 14:40:00-08:00",
    "title": "B.C.’s specialized COVID paramedics ‘impressed’ with Fort St. James’ community response – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/b-c-s-specialized-covid-paramedics-impressed-with-fort-st-james-community-response/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}