{
    "authors": [],
    "content": "Looking back on a decade of community investment from the Prince Rupert Port Authority\n\nThe Conrad Elementary School Accessible Playground. “Providing safe spaces for children to play and explore is imperative to their health and development,” says Natalie Allen, Community Relations Coordinator with the Prince Rupert Port Authority.\n\nWhat happens on a playground?\n\nThere’s the joy of kids having fun, of course, but that’s not the only thing. Children mark milestones as they conquer new challenges and face their fears. Parents connect, and find a comfortable space to ask advice. Playgrounds inspire healthy habits: getting outside, staying active and reaching out to socialize.\n\nWhat happens on a playground? Community.\n\nIt’s not a surprise then, that the Prince Rupert Port Authority’s Community Investment Fund has made a big commitment to parks and playgrounds since the fund’s inception in 2009.\n\n“Providing safe spaces for children to play and explore is imperative to their health and development,” says Natalie Allen, Community Relations Coordinator with the Prince Rupert Port Authority. “Over the past decade, the Community Investment Fund has facilitated the creation or enhancement of nearly a dozen play spaces, which are important assets to the many families who call the North Coast home.”\n\nThis year, the Fund is celebrating ten years of completed community projects and looking ahead to future projects for generations to come. Visit rupertport.com to share in the successes of the past decade, and learn more about what’s up next!\n\nFURTHER READING: Thriving together: Port, communities celebrate lasting legacy\n\nRenewed, expanded, accessible\n\nIn the last ten years the Community Investment Fund has invested over $750,000 in playgrounds and parks along BC’s North Coast, and millions more in other community spaces supporting wellness, culture, education and more.\n\n“We hope to continue this legacy and support the development of more playgrounds and fields in the years to come, encouraging further generations to be active,” Allen says.\n\nAnne Neufeld Tot Park Renewal Project: CIF invested $75,000 in this Port Edward playground, which sees thousands of visitors every year from families in Port Edward and Prince Rupert, as well as children visiting the community.\n\nCIF invested $75,000 in this Port Edward playground, which sees thousands of visitors every year from families in Port Edward and Prince Rupert, as well as children visiting the community. Doug Kerr Field Restoration: Over the years Doug Kerr Field had become Prince Rupert’s unofficial dog park, but a renewed local interest meant youth needed more space to play ball. Thanks to investments from the Prince Rupert Port Authority, other community partners and the tireless work of local volunteers, minor league baseball and softball are thriving in Prince Rupert.\n\nOver the years Doug Kerr Field had become Prince Rupert’s unofficial dog park, but a renewed local interest meant youth needed more space to play ball. Thanks to investments from the Prince Rupert Port Authority, other community partners and the tireless work of local volunteers, minor league baseball and softball are thriving in Prince Rupert. Conrad Elementary School Accessible Playground: It was time for the school’s playground equipment to be replaced, and thanks to an investment from the Prince Rupert Port Authority and other government and business partners, the school’s playground saw expansion and improved accessibility too. It’s the first park on the community’s east side available to all children, including those with mobility limitations.\n\nFields and playgrounds across the North Coast share in the port’s success, with nearly a dozen completed projects and more in the works! The next call for proposals will open in January 2021. Follow PRPA on Facebook, Twitter and Instagram for the latest.\n\nCommunityFamiliesparksvolunteers",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-07 06:00:00-08:00",
    "title": "Let’s play! Local investments promote active lifestyles and strong communities – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/marketplace/lets-play-local-investments-promote-active-lifestyles-and-strong-communities/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}