{
    "authors": [
        "Binny Paul",
        "Local Journalism Initiative Reporter"
    ],
    "content": "An aerial view of the marine oil-spill near Bligh Island in Nootka sound that the Canadian Coast Guard posted in a live social media feed. ( Canadian Coast Guard/Facebook)\n\nAn environmental response team has traced a marine oil spill in Nootka Sound to a freighter that sank off the West Coast of Vancouver Island in 1968.\n\nThe Canadian Coast Guard began investigations mid-September after local residents began reporting about sheen on the water. What was initially thought to be created by bilge discharge from vessels transiting through the area later turned out to be originating from shipwrecked vessel MV Schiedyk – the 483 feet cargo ship that sank upside down in Zuciarte Channel near the east end of Bligh Island, on Jan. 3, 1968 shortly after departing from Gold River.\n\nBligh Island – a popular recreational destination for anglers boaters and kayakers – is within the traditional territory of the Mowachaht/Muchalaht First Nation and the Spanish Pilot Group of Islands.\n\nRELATED: North Island identified as highly sensitive to oil spills, despite low probability\n\nRELATED: Alberni spill response base to conduct exercise at fuel dock\n\nThe ship — carrying 2,130 tonnes of wood pulp — was on route to Portland, Oregon when it struck a submerged ledge on the south side of Bligh Island.\n\nNear midnight the ship floated off the ledge and drifted down Zuciarte Channel before grounding again on the east side of Bligh. Before the 34 crew members abandoned ship that, oil was reported on the water but investigators are still unsure of the amount that spilled that night. Sonar indicates the shipwreck is in 360-400ft of water.\n\nThe 483ft cargo ship MV Schiedyk had departed for Portland, Oregon from Gold River, when it struck a ledge and sunk on Jan. 3, 1968. (Canadian Coast Guard/SpillResponsebc)\n\nAn Incident Command Post (ICP) has been set up and the Canadian Coast Guard and the BC Ministry of Environment and Climate Change Strategy, Mowachaht/Muchalaht First Nation, Hesquiaht First Nation, Nuu-chah-nulth Tribal Council, Environment and Climate Change Canada, Fisheries and Oceans Canada, Western Canada Marine Response and other partners are working together to respond to the situation.\n\nThe ICP is under the direction of a Unified Command shared between the Canadian Coast Guard and the provincial environment ministry and is monitoring developments virtually, according to a statement released by the Unified Command.\n\nAn environmental unit consisting of local First Nations will be established as they continue to provide valuable local knowledge about the area, and identifying sensitive ecological and archaeological sites. 10,000 feet of boom has been deployed to protect seven such sites.\n\n“While the current amount of marine pollution is minimal (between 30 t0 50 litres), we are on the water and taking steps now to address the immediate threat to the environment and cultural sites in the area, and are assessing longer term strategies and actions,” the Canadian Coast Guard said in a social media post.\n\nThe Unified Command, is also deploying Fisheries and Oceans marine mammal oil spill response team to survey the area for potentially impacted mammals, they said in the statement.\n\nA remotely operated vehicle has been deployed to gain a better understanding of the condition of the shipwreck, where the fuel may be leaking from, and, if possible, to get an idea of how much fuel is onboard.\n\nSimilarly drone surveillance to assess the spread and direction of marine pollution and lab sampling of contaminant is also underway.\n\n“Once the Unified Command has made these assessments and taken initial action to protect sensitive areas, longer term strategies and tactics will be developed for containment and protection, and ongoing information gathering will determine the action plan,” said Tyler Yager, deputy superintendent for environmental response (western region) for the Canadian Coast Guard, in a video statement.\n\nThe team also said that on-water and on-site operations will be dependent on weather and sea conditions in the area as work progresses this winter.\n\nFor more news from Vancouver Island and beyond delivered daily into your inbox, please click here.\n\nEnvironment",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-11 12:00:00-08:00",
    "title": "Active marine oil slick near Nootka Sound tied to historic 1968 Bligh Island shipwreck – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/investigation-connects-marine-oil-slick-near-nootka-sound-to-historic-1968-bligh-island-shipwreck/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}