{
    "authors": [
        "Ashley Wadhwani",
        "Canada"
    ],
    "content": "RCMP have arrested 21 people as they continue to investigate a violent confrontation at a lobster pound\n\nThe Nova Scotia RCMP confirmed today they have arrested 21 people as they continue to investigate a violent confrontation at a lobster pound at the centre of a dispute over a self-regulated Indigenous fishery.\n\nOn the night of Oct. 13, about 200 mostly non-Indigenous fishermen and their supporters converged on the facility in Middle West Pubnico, N.S., which was storing lobster caught by members of the Sipekne’katik First Nation outside of the federally regulated fishing season.\n\nPhotos posted on social media showed lobster strewn about the facility, and the RCMP say they were told that the large group had prevented employees from leaving the building, which was damaged by the crowd.\n\nThe chief of the First Nation has argued that his people have the constitutionally protected treaty right to fish where and when they want, based on a 1999 Supreme Court of Canada decision that affirmed their right fish for a “moderate livelihood.”\n\nHowever, a second ruling from the court said the fishery was subject to federal regulation to ensure conservation of the resource.\n\nThe Mounties issued a brief statement and photos today and asked the public to help investigators identify suspects who engaged in criminal activity.\n\nThe Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.",
    "city": [
        "Prince Rupert",
        "British Columbia"
    ],
    "publication date": "2020-12-11 15:20:00-08:00",
    "title": "More arrests made in dispute over Indigenous lobster fishing in Nova Scotia: RCMP – Prince Rupert Northern View",
    "url": [
        "https://www.thenorthernview.com/news/more-arrests-made-in-dispute-over-indigenous-lobster-fishing-in-nova-scotia-rcmp/",
        [
            "Prince Rupert",
            "British Columbia"
        ]
    ]
}