{
    "authors": [
        "Tom Fletcher"
    ],
    "content": "B.C. transit buses are among public areas where mask use is required. (B.C. government)\n\nB.C. public health officials reported another 737 diagnosed cases of COVID-19 Friday, and 11 more deaths as the virus continues to spread in the community and get into health care facilities.\n\nEven as three health care outbreaks were declared over, another three were reported, at Agassiz Seniors Community, Hilton Villa Seniors Community in Surrey and St. Michael’s Centre extended care in Burnaby. A new community outbreak has been identified at Regent Christian Academy school in Surrey, which has been closed after 30 positive tests came back.\n\nB.C.’s death total has reached 598, mostly elderly people and those with chronic health conditions. As of Dec. 11, B.C. has 342 coronavirus patients in hospital, and 87 in intensive care.\n\nTracking by the B.C. Centre for Disease Control shows cases declining in recent days after peaking at nearly 1,000 in November, as restrictions on private gatherings, indoor fitness, team sports and non-essential travel were imposed, first on Fraser Health region and then province-wide.\n\nFraser Health continues to record the most new cases, accounting for 469 of the latest cases. There were 119 in Vancouver Coastal, 99 in Interior Health, 41 in Northern Health and eight on Vancouver Island.\n\n“This weekend, take a step back from the usual holiday rush,” provincial health officer Dr. Bonnie Henry and Health Minister Adrian Dix said in a statement of the latest results. “Take the time to get outside and enjoy a quieter weekend with those in your household. Show your loved ones you care by staying local and staying away right now.”\n\nRELATED: Canada’s top doctor says B.C.’s restrictions showing results\n\nRELATED: UBC expert offers tips to respond to vaccine myths\n\n@tomfletcherbc\n\ntfletcher@blackpress.ca\n\nLike us on Facebook and follow us on Twitter.\n\nBC legislatureCoronavirus",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-11 15:15:00-08:00",
    "title": "B.C.’s COVID-19 transmission remains high with 737 new cases – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/news/b-c-s-covid-19-transmission-remains-high-with-737-new-cases/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}