{
    "authors": [
        "Ben Bogstie",
        "Local Journalism Initiative Reporter",
        "Local News"
    ],
    "content": "Suwilaawks Community School in Terrace is closing until Dec. 15 due to staffing shortages. (Brittany Gervais/Terrace Standard)\n\nSuwilaawks Community School will be closed Friday, Dec. 11 and Monday, Dec. 14 due to staffing shortages, according to a Dec. 10 Coast Mountains School District 82 (CMSD82) media release.\n\n“For clarification, this temporary school closure is not a COVID-19 closure,” said Janet Meyer, superintendent, in the release. “That directive can only be authorized by Northern Health authority and Ministry of Education. This is a closure due to staffing shortages.”\n\nThe school will reopen on Tuesday, Dec. 15. The release states that the closure is operational in nature and that school administration was working with families to “ensure students’ continued learning opportunities.”\n\n“At present the imbalance of regular school staff and employees, who are not as familiar with school routines and students, is problematic when attempting to ensure safety,” Meyer said in the release.\n\nIn a Dec. 10 interview with the Terrace Standard before the closure was announced, Meyer said that the school district was dealing with a shortage of teachers and that CMSD82 was “relying very heavily” on temporary teachers on-call, or TTOC’s.\n\n“We’ve enacted an emergency plan where by when we run out of TTOC’s individuals such as myself and the staff here at the board office are going into schools and that’s where I was this morning, covering a class,” she said.\n\nREAD MORE: Additional COVID-19 exposure detected at Caledonia Secondary School in Terrace\n\n@BenBogstie\n\nben.bogstie@terracestandard.com\n\nLike us on Facebook and follow us on Twitter.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-10 16:43:00-08:00",
    "title": "Suwilaawks Community School in Terrace closes temporarily due to staffing shortage – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/news/suwilaawks-community-school-in-terrace-closes-temporarily-due-to-staffing-shortage/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}