{
    "authors": [
        "Jake Wray",
        "Local News"
    ],
    "content": "Six Terrace schools were exposed to COVID-19 between Nov. 23 and Dec. 7, prompting concerns about the efficacy of Northern Health’s contact tracing procedures as well as calls for a full closure of Terrace schools.\n\nCole Stephens, a teacher at Uplands Elementary School, told CBC News that he was aware he had likely been exposed to the virus on Dec. 1 after receiving notification of an exposure at his son’s daycare.\n\nHe asked colleagues whether he should send an email to his class, but was told to wait for direction from Northern Health. The public health agency did not issue a notice of exposure at the school until a week later, on Dec. 7, by which point he and has family had developed symptoms, confirming his suspicion that he’d been exposed.\n\nThe Terrace Standard reached out to Stephens and his wife Miranda Leffler, who said they had no further comment beyond what they told CBC News.\n\nA surge in COVID-19 cases is straining Northern Health’s case management and contact tracing resources. In a statement, a spokesperson said the health authority is narrowing the scope of its contact tracing to accommodate the strain, while also deploying additional staff to case management and contact tracing teams.\n\n“Currently, contact tracing includes public health identifying and directly notifying all close contacts of every confirmed case,” the spokesperson said.\n\nNothern Health is shifting to focusing contact tracing efforts. Only close contacts in “certain situations” will be contacted, such as cases related to industrial projects, cases in First Nations communities and anyone who is part of a known cluster or outbreak. Health care workers will also still be contacted.\n\n“This will ensure public health can respond quickly to developing clusters of cases or potential outbreaks for those that are most vulnerable,” the spokesperson said.\n\nThe strain is also leading to delays in notifications of positive test results in the region, although the health authority did not detail how long the delay currently is.\n\nJanet Meyer, superintendent of Coast Mountains School District 82 (to which Uplands Elementary School belongs), said that while she’d like to see a faster turnaround in information being sent out, she doesn’t agree with Stephens.\n\n“I also recognize that we are working very, very closely with Northern Health … and I am confident in the fact that Northern Health is doing everything humanly possible with the resources that they have at their disposal to have the fastest possible turnaround time.”",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-11 14:15:00-08:00",
    "title": "Terrace teacher exposed to COVID-19 irked by 1-week lag in notification at his school – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/news/terrace-teacher-exposed-to-covid-19-irked-by-1-week-lag-in-notification-at-his-school/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}