{
    "authors": [
        "The Canadian Press",
        "Canada"
    ],
    "content": "Smartphone apps are shown, in Miami, on Oct. 29, 2019. Kids in Canada need greater access to up-to-date media literacy education to help them navigate what’s real and what’s fake or misleading online, experts say. THE CANADIAN PRESS/AP, Wilfredo Lee\n\nKids in Canada need greater access to up-to-date media literacy education to help them navigate what’s real and what’s fake or misleading online, experts say.\n\nThe rise of social media has led to the proliferation of misinformation and disinformation, which is spread intentionally,said Dr. Ghayda Hassan, a clinical psychologist and the director of the Canadian Practitioners Network for the Prevention of Radicalization and Extremist Violence.\n\n“Because of the speed of access to information, cognitively, people do not have time to process and to validate the kind of information they receive, so there are a lot of biases that interfere,” said Hassan, who is also a UNESCO co-chair for the prevention of radicalization.\n\n“The fact that information is often on social media propagated by individuals that we may like, that we may trust or that we may directly know, gives them more credibility,” she said in an interview.\n\nThe COVID-19 pandemic is stoking fear and fuelling social and economic instability, creating conditions that intensify conspiratorial thinking, she said, adding she’s concerned that young people are particularly vulnerable.\n\nHassan is calling for stronger standards for how social media companies manage content on their platforms and a national strategy and mandatory curriculums covering digital media literacy in schools.\n\n“It has to become obligatory material, just as you teach math to kids.”\n\nSchool curriculums in each province and territory have included media literacy for nearly 20 years, but the material largely hasn’t been updated to reflect how media has changed since the 1990s, said Matthew Johnson, the director of education for the Ottawa-based non-profit MediaSmarts.\n\n“The model today is not of a distribution chain, but of a network that is functionally infinite,” he said. “In theory, anybody on YouTube can have as large an audience as a TV news network or a world leader.”\n\nTools and signals that may have worked on stories from traditional print and broadcast media in the past, such as bylines or photo credits, may not be as useful for authenticating information on social media.\n\nSome of those signals or markers of reliability, such as a professional-looking website, may even be counterproductive, said Johnson.\n\n“That’s often extremely misleading,” he said. “The people who intentionally spread misinformation or disinformation know that we look at that, and so they will put a lot of effort into making something that looks good.”\n\nThe extent to which media literacy is actually taught varies by province and territory, said Johnson. For example, B.C. has what he called an excellent digital literacy curriculum, but it’s not mandatory. In Ontario, where media literacy is part of the evaluated language arts curriculum, he said it receives the least classroom time among other components.\n\n“We don’t have any good recent data about what teachers are actually teaching and what students are actually learning at a national level.”\n\nMediaSmarts offers parents, teachers and students tips for authenticating information, from fact-checking tools to finding and verifying original sources and checking others to assess the veracity and intent of a story.\n\nIt draws on key concepts in media and digital media literacy, including that digital media has unexpected audiences, that online experiences are shaped by the social networks and search engines themselves, and that what we do online can have real-world impacts.\n\nJoyce Grant is a freelance journalist and the co-founder of TeachingKidsNews.com, a website she describes as a transparent source of news for kids that also helps them understand how credible news is made and how to spot content that’s deceptive or misleading.\n\n“Fake news, as it gets better, starts to better mimic journalism. So, really, what it comes down to now is critical thinking,” said Grant, who began delivering in-class media literacy workshops around a decade ago.\n\nShe aims to help youth recognize echo chambers or silos on social media and break out of them by seeking out diverse sources of information.\n\nThe goal is also a healthy skepticism that asks, “What seems off about this? What is missing? Where are the points of view? Why did this person write this article or post?” said Grant.\n\n“All of a sudden the light comes on, and then, yeah, they’re all over it … nobody wants to be fooled, right?”\n\nBrenna Owen, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.",
    "city": [
        "Terrace",
        "British Columbia"
    ],
    "publication date": "2020-12-11 15:10:00-08:00",
    "title": "Kids need media literacy education to match the rise of social networks, says experts – Terrace Standard",
    "url": [
        "https://www.terracestandard.com/news/kids-need-media-literacy-education-to-match-the-rise-of-social-networks-says-experts/",
        [
            "Terrace",
            "British Columbia"
        ]
    ]
}