{
    "authors": [
        "The Canadian Press"
    ],
    "content": "Staff work in a marijuana grow room that can be viewed by at the new visitors centre at Canopy Growth’s Tweed facility in Smiths Falls, Ont., Thursday, Aug. 23, 2018. Canopy Growth Corp. says it is ceasing operating at five facilities across the country and laying off 220 workers. THE CANADIAN PRESS/Sean Kilpatrick\n\nCanopy Growth Corp. says it is ceasing operating at five facilities across the country and laying off more than 200 workers.\n\nThe Smiths Falls, Ont-based cannabis company says it will end operations at sites in St. John’s, Fredericton, Edmonton, Bowmanville, Ont. and at an outdoor grow facility in Saskatchewan.\n\nThe company says about 220 employees will be impacted by the closures.\n\nCanopy chief executive David Klein says the moves will help save between $150 million and $200 million and accelerate the company’s path to profitability.\n\nHe also says Canopy will record pre-tax charges between $350 million and $400 million in the third and fourth quarters of its fiscal 2021.\n\nAccording to Klein, the production site cuts impact about 17 per cent of the company’s enclosed facilities in Canada and 100 per cent of its outdoor sites.\n\n“We are confident that our remaining sites will be able to produce the quantity and quality of cannabis required to meet current and future demand,” he said in statement.\n\n“This was a difficult decision, but I believe it is the right one. I want to thank all of the employees impacted by this decision for their efforts in helping build Canopy Growth.”\n\nThe Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-09 13:00:00+00:00",
    "title": "Canopy Growth to close 5 facilities across Canada, lay off 220 workers",
    "url": [
        "https://www.canadianevergreen.com/news/canopy-growth-to-close-five-facilities-across-canada-lay-off-220-workers/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}