{
    "authors": [
        "Rod Link",
        "Local News"
    ],
    "content": "The District of Houston is examining the costs of increasing snow clearing. (Angelique Houlihan photo)\n\nA proposal by District of Houston councillor Tom Stringfellow to hire a seasonal equipment operator to help clear snow has been deferred with District staffers being asked to come back to council with more information.\n\nStringfellow’s proposal would have an equipment operator hired from Oct. 15 to April 15 specifically for the District’s Priority 1 routes.\n\nThat person would “operate a snowblower to move volumes of snow from areas that are unreachable by larger equipment, such as curbs, parking areas, bus stops, accessible parking stalls, the Houston and Mountainview cemetery, sidewalks and the Buck Creek walking bridge,” he outlined in a memo to council.\n\nHe also said the person could increase the use of District equipment to clear sidewalks in high traffic areas.\n\n“The use of large equipment can be concentrated on the main roadways, which will allow snowblowers to move the snow away from the edge of the street,” Stringfellow added.\n\n“This would require the loader returning to the same street throughout the day during heavy snowfall events.”\n\nThe councillor’s proposal would mean an increase in budgetary spending, something the District has started as it plans out expenditures for 2021 and beyond.\n\nDistrict of Houston chief administrative Gerald Pinchbeck said staffers are assembling the costs of hiring a seasonal operator, historical snow removal costs, what specific duties the operator would undertake and how Stringfellow’s proposal fits in with a “surge” capacity for snow removal.\n\n“Staff will be reviewing the research required for this report, and are aiming to have this in front of council by December 15, 2020 or January 5, 2021,” he said.\n\nPinchbeck had earlier responded to a Houston Today query about snow removal, indicating the District has neither the personnel nor equipment to clear a centre line windrow of snow should it be moved there from sidewalks and the travelled portion of roads.\n\nDoing that would “typically involve at least three pieces of equipment (loader with a snowblower and two haul trucks). Without sufficient staffing and resourcing, including a snow blower attachment for a loader, clearing any windrow would result in significant time and investment of taxpayer dollars to remove this snow from the road,” he said.\n\n“As a result, the most efficient and cost effective mechanism to remove snow from roadways to ensure the safety of road users is to clear snow from the roadway and onto the shoulder of the road, including sections that have sidewalks.”\n\nPinchbeck said the District did acknowledge the inconvenience caused for pedestrians, adding that the District’s existing capacity requires it to cover approximately 80 kilometres of road within a limited time frame.\n\nAnd a new tractor unit, complete with a snow blower attachment, is now in service with a goal of managing snow on sidewalks and doing other clearing within 48 hours of a snowfall event, Pinchbeck said.",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-12-09 01:30:00-08:00",
    "title": "District ponders boosting snow fall response – Houston Today",
    "url": [
        "https://www.houston-today.com/news/district-ponders-boosting-snow-fall-response/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}