{
    "authors": [
        "Rod Link",
        "Local News"
    ],
    "content": "Investigation continues to determine cause of blast that injured three employees\n\nPinnacle Renewable Energy has re-opened its pellet plant in Houston, but on a reduced scale.\n\nAn explosion in the dryer area Nov. 25, which injured three employees, forced the closure until the damage could be assessed and dealt with and the company could reassure the provincial safety agency, WorkSafe BC, that steps had been taken to ensure worker safety.\n\nAlthough the plant re-opened, it is operating without its drying operations, said Pinnacle CEO chief operating officer Scott Bax.\n\n“The drying system repairs will take a few months to fully repair; we are working on more exact timing,” he said.\n\n“We are working on establishing the key contributing factors, working with third party experts to assist our internal investigation team,” said Bax as Pinnacle assesses the reason for the incident, first described as a “fire-related event.”\n\n“We do not believe this to be a combustible dust-caused explosion. Our combustible dust safety measures were operating well at Houston,” he added.\n\nTHE LATEST: Dr. Bonnie Henry denies ‘constant condesencion’ to faith community\n\n“Our focus on continuous improvement in all aspects of mill safety mean that as we determine the key contributing factors, we will incorporate key findings to all other applicable operations.”\n\nExternal experts brought in by the company include a fire investigation expert.\n\nWithout the dryer portion operating, the Houston plant is losing about 300-400 tonnes a day of pellet production.\n\nIt is producing using dry shavings only while some of the wet material is being shipped to Pinnacle’s Burns Lake plant for the short term, Bax said.\n\n“All employees will continue to have full time employment supporting the plant’s curtailed production and betterment work,” said Bax.\n\nThe day of the explosion, Houston residents reported hearing a loud “boom.” The Houston Volunteer Fire Department responded to the explosion with two vehicles and spent several hours at the plant.\n\nMORE NEWS: Smithers Local Health Authority reports two COVID cases in first week of December\n\nPinnacle did contact WorkSafeBC immediately following the explosion and an inspection report indicated “significant equipment damage” occurred.\n\n“Dismantling and repair of the damaged equipment will be conducted by contractors. Some of the work will require significant work at heights as well as confined space work,” the report stated.\n\nPrior to re-opening, Pinnacle had to satisfy WorkSafeBC requirements, one being an inspection to identify the hazards created by the event and another being an approved plan to safely remove damaged components.\n\nWhile Pinnacle is the operator of the plant, which opened in 2006, it shares ownership with Canfor and the Witset First Nation. It has a rated annual capacity of 217,000 tonnes of industrial pellets and was the third such plant to be opened by Pinnacle.\n\n\n\neditor@interior-news.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-11 12:45:00-08:00",
    "title": "Houston pellet plant re-opens following explosion – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/news/pellet-plant-re-opens-following-explosion/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}