{
    "authors": [],
    "content": "Darren Orr is part of the crew that helped clear sections of the project right-of-way this past winter.\n\nCoastal GasLink’s monthly Construction Update shows more than 70 per cent of the project’s 670-kilometre right-of-way was cleared by the end of March, as winter construction wrapped up.\n\nSome sections of the right-of-way are now 100 per cent cleared, important milestones for construction to position the project for success when work ramps back up after spring thaw, and when it is safe to do so.\n\n“Most importantly, we achieved all of this safely. Over the winter we saw over four million person-hours of work undertaken on hazardous clearing activities that were completed without serious incidents or injury,” said Dan Bierd Coastal GasLink’s vice president of pipeline implementation.\n\nCollaboration with Indigenous and local workers and businesses is a core value for Coastal GasLink and underpins these accomplishments.\n\nFor example, the 82-kilometre stretch encompassing Section 5, north of Vanderhoof to south of Burns Lake, was fully cleared as of late March with help from local contractors and our Indigenous partners; Stellat’en First Nation, Nee Tahi Buhn Band and Nadleh Whut’en First Nation. The clearing work, done in advance of mainline pipe installation, was completed by subcontractors NWF Frost and Indigenous-owned M&M Resources Inc.\n\nEqually important are the local women and men hired to be part of Canada’s largest private investment project.\n\n“Being a McLeod Lake Indian Band member, I can work for my own people. I am close to home, I get to travel back and forth everyday,” said Darren Orr, an equipment operator for Duz Cho Construction who helped clear the right-of-way.\n\nCoastal GasLink’s main focus right now is collaborating with Northern Health, WorkSafeBC and local stakeholders to help keep its workforce and local communities safe while essential work is completed.\n\n“We recognize even more so now, that we have to work together and look out for one another. We will offer our assistance in support of local efforts to keep residents safe,” said Bierd.\n\nEarlier this month, the project donated $100,000 to United Way of Northern BC (UWNBC) to help protect the most vulnerable in local communities. The funds will help the UWNBC provide much needed support including meals, grocery deliveries, wellness checks and much more.\n\nCoastal GasLink looks forward to resuming work together with its Indigenous and local partners, and achieving even greater milestones, when it is safe to do so.\n\nFor more information about the project and our approach to safety, please visit CoastalGasLink.com.\n\nenergy sectornatural gas",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-04-20 01:30:00-08:00",
    "title": "Working together, every step of the way – Houston Today",
    "url": [
        "https://www.houston-today.com/marketplace/working-together-every-step-of-the-way/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}