{
    "authors": [
        "Thom Barker",
        "Local News"
    ],
    "content": "Prevalence of the disease has rising in the north, but remains relatively low locally\n\nLocal Health Area cases for the week of Nov. 29 to Dec. 5. (BCCDC graphic)\n\nThe Smithers Local Health Area (LHA) recorded two confirmed cases of COVID-19 from Nov, 29 – Dec. 5.\n\nData from the B.C. Centre for Disease Control for LHAs previously only published monthly is now being updated weekly.\n\nAt the end of November, the total case count for Smithers LHA (Houston to Witset) from January was 52, up 10 from end of November. The represents a levelling off from October when Smithers LHA numbers more than doubled from 19 to 42.\n\nCaseloads in surrounding Northwest Health Service Delivery Area LHAs for the first week of December included Terrace 15, Nisga’a 10, Kitimat 4, Burns Lake 3, Prince Rupert 3 and Upper Skeena 1. The Snow Country Telegraph Creek and Stikine LHAs reported no cases.\n\nREAD MORE: B.C. records 28 deaths due to COVID-19, 723 new cases\n\nMeanwhile, the CDC published the latest data for the Health Service Delivery Areas (HSDA) of which there are three in Northern Health Authority (NHA). From Dec. 4 to 10, the Northwest HSDA saw 53 new cases compared to 129 in the Northern Interior HSDA, and 37 in the Northeast HSDA.\n\nHigh numbers in the Northern Interior are in part due to a major outbreak in the community of Fort St. James that now numbers at least 60 cases and led to the province deploying a major incident rapid response paramedic team to the district.\n\nREAD MORE: B.C’s rapid response paramedics arrive in Fort St. James as district reaches 60 COVID-19 cases.\n\nIn total, from January to Dec. 10, the Northwest HSDA has reported 255 cases, Northern Interior HSDA has reported 604, and the Northeast HSDA has reported 340.\n\nSince Dec. 4, there have been 271 new cases reported by the NHA, with 43 currently hospitalized and 14 in critical care.\n\nThere are 402 active cases at this time and throughout the pandemic, NHA has seen 1,199 cases total, with 788 recovered and nine deaths.\n\nOn Thursday, the province recorded its deadliest day so far with 28 new deaths.\n\n– with files from Clare Rayment\n\n\n\neditor@interior-news.com\n\nLike us on Facebook and follow us on Twitter\n\nCoronavirus",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-11 09:15:00-08:00",
    "title": "Smithers Local Health Area reports two COVID cases in first week of December – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/news/smithers-local-health-area-reports-two-covid-cases-in-first-week-of-december/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}