{
    "authors": [
        "The Canadian Press"
    ],
    "content": "Infections continue to climb in the six provinces west of the Atlantic region\n\nChief Public Health Officer Theresa Tam responds to a question during a news conference Tuesday, December 8, 2020 in Ottawa. THE CANADIAN PRESS/Adrian Wyld\n\nHealth officials are urging Canadians to not drop their guard in anticipation of the arrival of a COVID-19 vaccine, as federal forecasts predict the country will hit several grim new milestones during the holiday season.\n\nNew modelling released on Friday anticipates the COVID-19 death toll could hit nearly 15,000 by Christmas Day, while case counts are projected to climb to as many as 12,000 per day by the start of January.\n\nDr. Theresa Tam, Canada’s chief public health officer, said Canada remains on a “rapid growth trajectory.”\n\nIn their update, the feds warned that all large provinces need to strengthen their COVID-19 responses “now” to stem the rise in infections.\n\n“Knowing access to safe and effective vaccines for all Canadians is within sight might lead some to think COVID-19 is no longer problem. But the reality is very different,” Tam told reporters on Friday.\n\nInfections continue to climb in the six provinces west of the Atlantic region, with rates rising precipitously Alberta, Saskatchewan and Manitoba, according to the federal data.\n\nBut Tam noted that forecast for the new year isn’t quite as grim as it looked two weeks ago, saying stricter measures in Manitoba and British Columbia appear to have helped slow the spread of the virus.\n\n“When public health authorities and individuals work together to implement and adhere to more stringent controls, we can bend that curve.”\n\nTam said there are currently more than 73,200 active COVID-19 cases in Canada, up from about 52,000 just three weeks ago.\n\nThe national positivity rate is 6.5 per cent, Tam said, with 49 of 99 health regions reporting more than 100 cases per 100,000 population.\n\nIncreasing community spread is leading to more and bigger outbreaks in high-risk settings, Tam said, including hospitals, schools, correctional facilities, shelters and long-term care homes.\n\nShe said the spread in long-term care homes is of particular concern as infection rates rise among older Canadians who face a higher risk of COVID-19 complications.\n\nDr. Tom Wong, chief medical officer of public health for Indigenous Services Canada, said there’s also been a troubling spike in outbreaks in Indigenous communities.\n\nThere were 5,675 confirmed cases of COVID-19 on First Nations reserves as of Dec. 10, according to Indigenous Services Canada, including 2,100 active cases.\n\nMaking sure early vaccine batches reach Indigenous populations is one of the key priorities of highlighted by the National Advisory Committee on Immunization, due to the disproportionate consequences of infection in those communities.\n\nThe feds are setting aside additional vaccine doses for First Nations people who live on reserve, where health care is a federal responsibility, said Health Minister Patty Hajdu.\n\nHowever Metis, First Nations and Inuit living in urban areas, for instance, will be considered part of the provincial population, she said.\n\nThis is “very concerning” for National Chief Perry Bellegarde of the Assembly of First Nations.\n\n“Whether you live on reserve or not, the federal government has responsibility to provide the vaccine to First Nations — without delay,” he tweeted after Hajdu’s remarks on Friday, adding his office has reached out to the minister for clarification.\n\nAdina Bresge, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nWant to support local journalism? Make a donation here.\n\nCoronavirus",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-12-11 15:30:00-08:00",
    "title": "Feds say all large provinces need stronger COVID-19 response ‘now’ – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/news/feds-say-all-large-provinces-need-stronger-covid-19-response-now/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}