{
    "authors": [
        "Thom Barker",
        "Local News"
    ],
    "content": "Duane Etzerza says he will use his winnings to start a business and a new car collection\n\nThe winner of a guaranteed $1 million prize in the Nov. 25 Lotto 6/49 draw on ticket bought in Smithers is a resident of Telegraph Creek.\n\nAccording a press release from BCLC this afternoon, Duane Etzerza woke up the morning after the draw to a post on Facebook that someone who had purchased a ticket in Smithers had won. He immediately checked the numbers on the ticket he got from Shoppers Drug Mart on Main Street in the BCLC Lotto! app.\n\n“I couldn’t believe it,” he exclaimed. “I think I was still half asleep and had to ask my partner what she saw on the screen to confirm the win.”\n\nEtzerza immediately shared the news with his mom, who was in as much shock as him.\n\n“I have teased my mom that I would win, so when she realized I wasn’t joking, she was happy for me,” he said.\n\nEtzerza, who has been a car collector for many years, but recently sold his collection said he plans start a new collection and use his unexpected prize to start a new business.\n\n“It’s an amazing feeling and overwhelming at the same time,” he said. “It’s great to be a winner.”\n\nNobody won the jackpot of an estimated $6 million jackpot on Nov. 25 or in any of the draws since. Saturday night’s jackpot is now up to an estimated $20 million.\n\nThe 6/49 is a nationwide lottery in which participants select six numbers for a chance to win a jackpot that starts at $5 million and steadily grows. Each ticket purchased also includes a 10-digit number that is automatically entered to win the guaranteed $1 million prize.\n\nREAD MORE: Ken and Susan Salter of Telkwa win $20 million\n\n\n\ndeb.meissner@interior-news.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Smithers",
        "British Columbia"
    ],
    "publication date": "2020-11-26 09:00:00-08:00",
    "title": "UPDATE: Telegraph Creek resident wins $1 million on ticket purchased in Smithers – Smithers Interior News",
    "url": [
        "https://www.interior-news.com/news/winning-6-49-ticket-in-nov-25-draw-bought-in-smithers/",
        [
            "Smithers",
            "British Columbia"
        ]
    ]
}