{
    "authors": [
        "Clare Rayment",
        "Local News"
    ],
    "content": "The health authority has reported over 1,000 cases since the start of the pandemic\n\nThere has been almost 1,200 COVID-19 cases in Northern Health since the start of the pandemic, with 402 of those cases still active. (K-J Millar/Black Press Media)\n\nNorthern Health Authority (NHA) has reported over 400 confirmed COVID-19 cases in the region as of Thursday (Dec. 10).\n\nIn the past week, from Dec. 4 to 10, the north has seen 53 cases in the Northwest Health Service Delivery Area (HSDA), 129 in the Northern Interior HSDA, and 37 in the Northeast HSDA.\n\nThe BC CDC has switched from reporting two weeks at a time to one week at a time. So, in the two weeks prior to the most recent reporting period, the Northwest Health Service Delivery Area (HSDA) had 79 cases, Northern Interior HSDA had 201, and the Northeast HSDA had 63.\n\nIn total, from January to Dec. 10, the Northwest HSDA has reported 255 cases, Northern Interior HSDA has reported 604, and the Northeast HSDA has reported 340.\n\nLocal Health Areas (LHAs) have been updated, as well, with the Kitimat LHA at four reported cases from November 29 to December 5. Previously, the LHAs were updated on a monthly basis, but have recently be changed to be reported on a weekly basis, as well.\n\nSince Dec. 4, there have been 271 new cases reported in NHA, with 43 currently hospitalized and 14 in critical care. There are 402 active cases at this time and throughout the pandemic, NHA has seen 1,199 cases total, with 788 recovered and nine deaths.\n\nWith the LNG Canada site outbreak, Northern Health said in. a release on Dec. 11 that the number of COVID-19 positive cases is still at 56.\n\nThis has not changed since the previous update on Dec. 9. Northern Health said one of these cases is still active and 55 are considered recovered.\n\nNorthern Health said no one is in self-isolation at the project site and the self-isolation requirements for the 55 recovered individuals has ended. There have been no new cases associated with this outbreak reported since Dec. 2, and the date of the last potential exposure at the project site was Nov. 26.\n\nIf no new cases associated with the outbreak appear in two 14-day periods following the last potential exposure on Nov. 26, Northern Health will declare the outbreak over at that time.\n\nREAD MORE: Victoria hospital takes in two COVID-19 patients from Northern Health\n\nREAD MORE: Haven’t received your COVID-19 test results yet?\n\n\n\nclare.rayment@northernsentinel.com\n\nLike us on Facebook and follow us on Twitter",
    "city": [
        "Kitimat",
        "British Columbia"
    ],
    "publication date": "2020-12-11 08:56:00-08:00",
    "title": "Over 400 active COVID-19 cases in Northern Health – Kitimat Northern Sentinel",
    "url": [
        "https://www.northernsentinel.com/news/over-400-active-covid-19-cases-in-northern-health/",
        [
            "Kitimat",
            "British Columbia"
        ]
    ]
}