{
    "authors": [],
    "content": "Black Press Media’s Business Continuity Plan is available for local businesses when they are ready to re-open.\n\nWhen you’re ready, we’re here for you.\n\nThat’s the message Black Press Media shares with the businesses and organizations in their communities throughout BC, Central Alberta and Yukon.\n\n“We are living in unprecedented times brought about by the implications of COVID-19, but just as our journalists work tirelessly to bring you timely, accurate news as it happens, your Black Press Media team is also here to help local businesses successfully move though this crisis,” says Randy Blair, Black Press Media Chief Operating Officer.\n\nWith concerns about how COVID-19 is affecting all aspects of our lives, people are turning to their trusted local community news source more than ever before:\n\nReach 7 out of 10 adults in your local community\n\nCanadians are consuming more than 1 million page views per day across our digital news platforms\n\n1 million social media followers are highly active and engaged\n\n4.1 million monthly unique views\n\n79%+ increase in visits to our news platforms compared to the same period last year\n\nTo aid businesses in their recovery, innovations are needed, and for that, Black Press Media is offering advertisers a new Business Continuity Communication Plan that will be rolled out based on the timetable and needs of each individual business.\n\nYour Communication Plan\n\nDesigned for local businesses experiencing difficulties during these challenging times, this multimedia campaign offers three packages, priced in keeping with the promise ‘We’re in This Together.’\n\nYou’ll receive comprehensive web, social and print options, based on your selected communication package.\n\nOur team of expert marketing consultants can arrange for a one-on-one webinar to review your marketing needs and business objectives.\n\nOptions include:\n\nSocial media advertising across Facebook and Instagram\n\nTargeted online advertising to a defined audience\n\nPrint advertising in your local community newspaper\n\nCarousel gallery-style ads highlighting individual products\n\nStorytelling; featured articles on your business engaging consumers in your brand, products and service\n\nProviding both flexibility and our proven ability to reach your customers, the two-month campaigns begin with the date of your first ad. So, if your first ad runs May 2, your two-month campaign ends on July 1. This approach puts the decision on when to start the campaign in your hands.\n\n“We appreciate that these are equally challenging times for you, your employees and your families. Our role, as your community partner, is to be there for you as soon as you’re ready to go to market,” Blair says.\n\nWhen you’re ready, Black Press Media is ready\n\nYour customers have relied on us for important information about the COVID-19 pandemic.\n\nYou can rely on us to communicate your business continuity plan to our audience when you are ready.\n\nTo learn more about the Business Continuity Communication Plan, click here.\n\n#WereInThisTogether.\n\nBusiness and Industrial",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-04-01 06:00:00-08:00",
    "title": "Business Continuity Plan: When You’re Ready, We’re Here for You – Houston Today",
    "url": [
        "https://www.houston-today.com/marketplace/business-continuity-plan-when-youre-ready-were-here-for-you/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}