{
    "authors": [],
    "content": "Coastal GasLink has successfully completed its winter construction program, in time for the spring thaw.\n\nThis week, Coastal GasLink concluded its winter construction program in time for the spring thaw. With the change in season, the project has completed its planned reduction in workforce numbers to approximately 400, down from 1,200 in February.\n\nAccording to Dan Bierd, Coastal GasLink’s vice-president of pipeline implementation, the scheduled ramp-down concludes a successful winter construction season.\n\n“Over the past several months, we have accomplished many important milestones,” said Bierd, “including the clearing of more than 65 per cent of the 670-kilometre right-of-way.”\n\n“And most importantly,” added Bierd, “we achieved all of this with safety as our top priority, and with the hundreds of Indigenous and local residents as part of our workforce.\n\n“We’re proud of our safety record this winter that saw over four million person-hours of work undertaken on hazardous clearing activities that were completed without serious incidents or injury.”\n\nThe start of spring means that melting snow and thawing conditions make the ground either too soft or too muddy for trucks, machinery and people to work. That, coupled with the sensitive migration stages for birds, fisheries and other wildlife species make this a good time for crews to take a break.\n\n“We’re going to focus our smaller team of local workers and contractors on critical activities such as environmental monitoring, sediment and erosion control, and site-specific activities including maintenance,” noted Bierd.\n\nThe smaller and more local workforce has also allowed Coastal GasLink to strengthen the focus on the health and safety of the workforce and communities and do its part to help slow down the spread of COVID-19.\n\n“Safety is our number one value, and our first concern is for all the employees, families and communities who may be affected by this situation,” said Bierd. “We send our sincerest well-wishes to everyone and recognize the tremendous efforts of first responders and health professionals worldwide.”\n\nCoastal GasLink is taking proactive steps to help slow down the spread of the virus. Plans are in place and measures being taken help protect the health of the critical teams at work and all non-essential staff are working remotely and air travel restricted.\n\nIn addition to social distancing, CGL is engaged with health and medical experts, including Northern Health, ensuring workers have continued medical coverage, working primarily with local workers for essential activities and minimizing the number of residents at workforce accommodation sites, which will continue to fall as work is further reduced along the route.\n\n“We recognize even more so now that we have to work together and look out for one another. We will offer our assistance in support of local efforts to keep residents safe,” said Bierd.\n\nCoastal GasLink has been working closely with provincial health authorities and have been taking the advice of the Provincial Health Officer as they continue essential project work and will continue to seek their advice prior to resuming construction.\n\n“We will overcome this challenge, and we look forward to continuing to work together when project construction resumes to deliver significant economic benefits to British Columbian families for the long-term,” he added.\n\nLearn more and stay connected at www.CoastalGasLink.com\n\nenergy sector",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-03-30 06:00:00-08:00",
    "title": "Coastal GasLink wraps up winter construction – Houston Today",
    "url": [
        "https://www.houston-today.com/marketplace/coastal-gaslink-wraps-up-winter-construction/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}