{
    "authors": [],
    "content": "CMCL Coordinators Harry Bodewitz, Rocky Desjarlais and Mike Gouchie, with Witset First Nation CMCL Advisor Cameron Ogen, and Trevor Michell (former CMCL Advisor).\n\nIntegrity, collaboration and respect are at the heart of Coastal GasLink’s commitment to communities in northern British Columbia.\n\nFrom the very start, Coastal GasLink has been committed to getting it right, and that includes making sure Indigenous and local communities had input into project development, from participating in environmental assessment fieldwork to providing feedback on project design.\n\n“Coastal GasLink has focused on building relationships based on mutual trust and respect by providing meaningful opportunities for participation in project planning and construction,” said Tiffany Murray, Coastal GasLink’s director of Indigenous Relations.\n\n“We’re proud of the relationships we are building and are committed to continuing to working collaboratively to build a positive future for all,” added Murray.\n\nTo protect Indigenous culture and values along with the environment during project construction, Coastal GasLink has launched the Construction Monitoring and Community Liaison Program (CMCL). The program provides opportunities for Indigenous community members to participate in construction within their traditional territory for the purposes of observing, recording and reporting on implementation of construction activities to their communities.\n\nHarry Bodewitz, a program coordinator who is working closely with CMCL advisors from several Indigenous communities along the project corridor, has seen the value of the program.\n\n“Something might have been planned initially, but once we actually get to the field, that plan may change, or get modified, to make sure it’s done right,” said Bodewitz. “In the CMCL Program, we have an opportunity to observe what’s going on, discuss it and share that with our communities.”\n\nFor Mike Gouchie, a CMCL coordinator from Lheidli T’enneh First Nation, the program provides a chance to be out in the field to make sure what matters to his community, and neighbouring community CMCL advisors, is at the forefront of the construction program.\n\n“As a CMCL coordinator, I’m able to assist the CMCL advisors to be out in the field with inspectors, construction management and myself to visit sites of interest, to understand the scope of the project in our territories, and make sure environmental issues are identified,” he said.\n\nTransparency is core to the CMCL program, with Indigenous communities meaningfully participating in the project to monitor construction activities, which is well underway.\n\nThis open, relationship-based approach is something that Coastal GasLink believes is integral to the success of the project.\n\nenergy sectornatural gas",
    "city": [
        "Houston",
        "British Columbia"
    ],
    "publication date": "2020-03-09 06:00:00-08:00",
    "title": "Coastal GasLink collaborating to protect cultural values and the environment – Houston Today",
    "url": [
        "https://www.houston-today.com/marketplace/coastal-gaslink-collaborating-to-protect-cultural-values-and-the-environment-2/",
        [
            "Houston",
            "British Columbia"
        ]
    ]
}